{
  "candidate": "Tim Burchett",
  "positions": [
    {
      "issue": "Military Spending",
      "stance": false,
      "desc": "Rep. Tim Burchett advocates for increased transparency and accountability in military spending, criticizing the lack of information from Congress and the Pentagon about how tax dollars are used. He also opposes excessive military spending, suggesting that priorities should be reassessed to address domestic issues such as veterans' support and border security.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We have such a bloated budget because both sides of the aisle bring their programs, criticize the other side's priorities, and then pass a bill that includes all of it. Congress is gutless. https://t.co/9xxE9QgywN",
          "date": "2024-09-24T15:37:33.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris administration is sending $725 million in NEW FUNDING to Ukraine while we have countless issues to address here at home.  Our endless War Machine is burning your tax dollars.",
          "date": "2024-09-11T18:47:15.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Gov Website",
          "url": "Tim Burchett House.Gov",
          "tweet": null,
          "date": "2025-04-27 22:44:25",
          "scraped_on": "2025-04-27 22:44:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Analysts estimate the Biden-Harris failures in Ukraine, Afghanistan, the Middle East, and with our own Southern border have cost the American taxpayers $381 billion.. and counting.",
          "date": "2024-10-25T13:53:05.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The War Machine never stops. No money for veterans or our border but we can find another $1.7 billion for Ukraine while we’re $35T in the hole.",
          "date": "2024-07-30T13:25:03.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        }
      ]
    },
    {
      "issue": "Abortion",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Tim Burchett House.Gov",
          "tweet": null,
          "date": "2025-04-27 22:44:25",
          "scraped_on": "2025-04-27 22:44:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today we celebrate the two-year anniversary of Dobbs v. Jackson, which allowed Tennessee to pass a trigger law to protect unborn babies' right to life.\n\nTennesseans understand these sweet little babies are precious, and I'll keep fighting to protect them in Congress.",
          "date": "2024-06-24T17:55:11.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My bill to stop our tax dollars from going to the Taliban will be brought to the floor for a vote this week. \n\nNot one PENNY of Americans' hard-earned money should ever end up in the hands of terrorists. https://t.co/IblUU94G2i",
          "date": "2024-06-24T20:41:44.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        }
      ]
    },
    {
      "issue": "Balancing the Budget",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Tim Burchett House.Gov",
          "tweet": null,
          "date": "2025-04-27 22:44:25",
          "scraped_on": "2025-04-27 22:44:25"
        }
      ]
    },
    {
      "issue": "Illegal/Undocumented Migrants",
      "stance": false,
      "desc": "Rep. Tim Burchett's stance on Illegal/Undocumented Migrants is characterized by his strong anti-immigration views, emphasizing national security risks and crime prevention. He supports policies to hold illegal immigrants accountable for their actions and has expressed concerns about the influx of undocumented migrants, particularly from Central and South America. However, it appears he holds a more nuanced view towards Palestinian immigration, welcoming them as individuals while acknowledging Tennessee's positive experience with Palestinians.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I joined @MarshaBlackburn's letter to\n@SecMayorkas demanding information about an illegal immigrant who violently attacked a woman in a public bathroom in Nashville.\n\nTennesseans are getting hurt because of Biden's open borders, and they deserve justice and accountability. https://t.co/Nvu6rmLspG",
          "date": "2024-05-24T17:58:11.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @gc22gc: Rep. Burchett: “We’re on the verge of losing everything, and out of control spending is the biggest threat—not China, not Russi…",
          "date": "2024-09-11T16:08:24.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "If Kamala wins in November, your tax dollars will continue to be sent overseas, 20+ million illegals will receive citizenship, and the crime that's going on right now in your communities will look like a Sunday picnic. Go vote like your life depends on it.",
          "date": "2024-09-26T15:20:43.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Central and South American nations are emptying their prisons and mental institutions so they can flood the United States, so the White House promotes another DEI hire who called for the abolishment of ICE. Washington is a clown show under @POTUS. https://t.co/Hn8dfHyruF",
          "date": "2024-06-24T14:31:48.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Your tax dollars are being used to gather information, intimidate, and harass middle-class Americans. Congress knew this was going to happen when they cut the check. https://t.co/uyNlYQ7w2K",
          "date": "2024-05-14T13:56:46.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @RepEliCrane: Made disturbingly worse by the sharp uptick in illegals entering our country from China.",
          "date": "2024-06-21T19:15:16.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Yesterday, Israel got their Bin Laden. I suspect the members of Hamas who are still alive will be looking over their shoulders for the days they have left on this earth. https://t.co/QAIdRuYRrp",
          "date": "2024-10-18T14:05:05.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My friend @RepMattGaetz and I know Americans are infuriated by the border situation. \n\nAmericans are sick of seeing jobs being taken and crimes being committed by illegals who shouldn't be here in the first place. https://t.co/O0qmXucwwn",
          "date": "2024-07-12T16:52:47.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Gov Website",
          "url": "Tim Burchett House.Gov",
          "tweet": null,
          "date": "2025-04-27 22:44:25",
          "scraped_on": "2025-04-27 22:44:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @NEWSMAX: Rep. Tim Burchett, R-Tenn., told Newsmax on Friday he has little faith that certain members of his own party will support crim…",
          "date": "2024-06-07T17:39:59.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“Using the border as a political tool”would be leaving the border wide open and flooding the U.S. with 10 million people in hopes they could vote someday, or at least counting on them affecting the number of House seats and electoral votes. https://t.co/89HnQJgxDg",
          "date": "2024-05-08T18:50:44.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I joined @SenatorHagerty, @RepAndyBiggsAZ, and some other members of Congress to demand answers about how Biden's DOJ is investigating and prosecuting noncitizens who register to vote.\n\nThis administration let over 10 million illegal immigrants into this country. They shouldn't https://t.co/0OXrJwgcOK",
          "date": "2024-07-12T20:14:42.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Other",
          "url": "https://www.wsmv.com/2025/02/06/rep-burchett-welcomes-idea-palestinians-relocating-us-tn/",
          "tweet": null,
          "date": "February 6, 2025",
          "scraped_on": "2025-04-15 14:13:12"
        }
      ]
    },
    {
      "issue": "China",
      "stance": false,
      "desc": "Insufficient Data.\n\nHowever, according to publicly available sources, Tim Burchett has expressed support for taking strong action against China on various issues, including trade and national security. He has also voiced opposition to giving US tax dollars to China. Additionally, Burchett has introduced bills related to protecting American interests and genetic information from Chinese government interference.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The communist Chinese have their hooks in nearly every aspect of American life, and they're tracking as much of your data as they can. My bill to protect Americans' genetic information from China's government is a no-brainer.\n\nThank you @RepMoolenaar for the support. https://t.co/zlGf2I9Jrx",
          "date": "2024-06-27T16:00:18.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Gov Website",
          "url": "Tim Burchett House.Gov",
          "tweet": null,
          "date": "2025-04-27 22:44:25",
          "scraped_on": "2025-04-27 22:44:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Is there a foreign country we don't give US tax dollars to? https://t.co/sANSPSFjoN",
          "date": "2024-10-05T01:14:26.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Other",
          "url": "https://www.wsmv.com/2025/02/06/rep-burchett-welcomes-idea-palestinians-relocating-us-tn/",
          "tweet": null,
          "date": "February 6, 2025",
          "scraped_on": "2025-04-15 14:13:12"
        }
      ]
    },
    {
      "issue": "Israel-Gaza War",
      "stance": false,
      "desc": "Tim Burchett's stance on the Israel-Gaza War is characterized by strong support for Israel, criticism of Hamas, and a seemingly ambivalent view towards Palestinian immigration to the US. He has expressed frustration with the Biden administration's handling of the conflict and accused Democrats of being too soft on Hamas. Burchett also voiced his disapproval of pro-Hamas protests in Washington D.C. during Joint Sessions of Congress.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hezbollah receives 75% of their funding from Iran. Iran receives billions in sanctions relief from Biden/Harris. \n\nIran has made it clear they intend to wipe Israel off the map and this admin is paying for it.",
          "date": "2024-08-26T18:56:53.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The United Nations put the Israeli Defense Force on a list of children's rights abusers alongside groups like the Taliban and Hezbollah. What a joke. \n\nI introduced a resolution that rejects that decision, condemns the UN's anti-Israel bias, and reaffirms our support for Israel.",
          "date": "2024-06-27T13:56:39.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Let Israel finish the job. https://t.co/90kQkXKyNl",
          "date": "2024-05-07T16:13:50.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Israel fights to win. Another strongly worded letter from Secretary Blinken and Secretary Austin won't change how Netanyahu and the IDF wage this war. https://t.co/IOmwfnuSz3",
          "date": "2024-10-16T14:44:41.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nothing says supporting Israel like not showing up to a Joint Session of Congress while thousands of pro-Hamas protestors march on Capitol Hill. https://t.co/XrkbW4PnVz",
          "date": "2024-07-24T17:56:12.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden comes up with a three-tiered peace plan and just expects the Israelis to fall in line. We need to get out of their way and let the IDF eliminate these savages. https://t.co/Obg9jfjXwr",
          "date": "2024-06-04T16:42:09.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The @StateDept should denounce Code Pink, which supports Hamas and threatened my wife and daughter. https://t.co/yQsXYQjs7i",
          "date": "2024-05-28T19:15:30.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The White House delayed announcing its pause in weapons shipments to Israel until after the President's Holocaust Remembrance Day speech so it wouldn't ruin his image. \n\nMy @GOPOversight colleagues and I requested information about why they hid this from the American people. https://t.co/ydOIDgQPH6",
          "date": "2024-05-10T19:58:36.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Other",
          "url": "https://www.wsmv.com/2025/02/06/rep-burchett-welcomes-idea-palestinians-relocating-us-tn/",
          "tweet": null,
          "date": "February 6, 2025",
          "scraped_on": "2025-04-15 14:13:12"
        }
      ]
    },
    {
      "issue": "Public Healthcare",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This morning I received the “Friend of Farm Bureau” award. I’ll always vote to protect the American farmer and the work they do. It’s more than a job, it’s a way of life. https://t.co/rqDxUB1SRD",
          "date": "2024-10-23T13:51:15.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Gov Website",
          "url": "Tim Burchett House.Gov",
          "tweet": null,
          "date": "2025-04-27 22:44:25",
          "scraped_on": "2025-04-27 22:44:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Great morning at the groundbreaking of Willow Place III. It’s our duty to take care of the greatest generation and this new housing will serve our seniors well. https://t.co/oTfjcaBNJ0",
          "date": "2024-06-18T15:52:34.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @RepEliCrane: Every member of Congress should have to use their office budget to send a letter to their constituents detailing how much…",
          "date": "2024-10-29T19:32:02.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Visited with Bearden High School students enrolled in the JROTC program this morning. Great group of young men and women who are ready to lead. https://t.co/yFZhRrjfhZ",
          "date": "2024-10-30T18:45:00.000Z",
          "scraped_on": "2025-03-30 19:48:16"
        }
      ]
    }
  ]
}