{
  "candidate": "Andy Ogles",
  "positions": [
    {
      "issue": "Abortion",
      "stance": true,
      "desc": "Andy Ogles has put forth policy proposals to ban chemical abortions and protect women and unborn children, citing moral duty and prioritizing the sanctity of life. He supports federal action to block the use of chemical abortions and introduce legislation to prevent forced abortions, indicating a stance against abortion.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "http://ogles.house.gov",
          "tweet": null,
          "date": "2025-04-27 23:30:17",
          "scraped_on": "2025-04-27 23:30:17"
        }
      ]
    },
    {
      "issue": "China",
      "stance": false,
      "desc": "Andy Ogles is a strong advocate for taking decisive action against China, labeling it as the \"greatest foreign adversary\" facing the United States. He believes that China's use of cyberattacks on critical infrastructure poses a significant threat to American national security and economy, citing incidents like the \"Typhoon\" intrusions as a growing concern. Ogles supports legislation aimed at stopping the flow of taxpayer dollars to fund the Chinese Communist Party, highlighting Beijing's ongoing efforts to undermine American sovereignty through cyber warfare. His stance emphasizes the need for proactive measures to address this emerging threat.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden’s disastrous policies are destroying American energy independence.\n\n@AugustPfluger and I are fighting back to ensure American energy production thrives. Read more in the @DailyCaller EXCLUSIVE here👇\nhttps://t.co/FIG3cuJhIV",
          "date": "2024-07-11T18:59:16.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Gov Website",
          "url": "http://ogles.house.gov",
          "tweet": null,
          "date": "2025-04-27 23:30:17",
          "scraped_on": "2025-04-27 23:30:17"
        }
      ]
    },
    {
      "issue": "Military Spending",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "http://ogles.house.gov",
          "tweet": null,
          "date": "2025-04-27 23:30:17",
          "scraped_on": "2025-04-27 23:30:17"
        }
      ]
    },
    {
      "issue": "Border Patrol",
      "stance": true,
      "desc": "Andy Ogles supports strengthening the Border Patrol, highlighting the need for national security and economic protection from groups like Volt Typhoon and Salt Typhoon. He emphasizes his commitment to securing America's borders, as evident in his perfect score on border security among congressional members. Ogles also mentions President Trump's efforts to acquire Greenland, indicating a focus on protecting national interests.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A big thanks to @FoxBusiness and @cherylcasone for having me on this morning to talk SCOTUS immunity ruling and Biden’s leadership problem.\n\nVoters are asking who will fix the border… who will fix the economy? Republicans have the solution. Republicans will prevail in November! https://t.co/jvjhAOKXPm",
          "date": "2024-07-03T21:57:05.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Gov Website",
          "url": "http://ogles.house.gov",
          "tweet": null,
          "date": "2025-04-27 23:30:17",
          "scraped_on": "2025-04-27 23:30:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @MariaBartiromo: Battleground states are 'screaming' to 'please do something' about border crisis: Rep. Andy Ogles |  https://t.co/0vH1B…",
          "date": "2024-06-13T00:53:16.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Immigration is the most important issue in Tennessee because Biden’s atrocious policies have turned every town into a border town.\n\nI’m tremendously proud to be one of only four members of Congress with a perfect score on securing our border.\n\nhttps://t.co/ADoeGeYd0A",
          "date": "2024-06-22T23:30:18.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thrilled that Senator J.D. Vance has been selected as Trump’s VP candidate. Coming from working-class roots, he embodies the heart and soul of our great nation and is a living example of the American dream. J.D. has fought tirelessly to defend our liberties in the Senate, and he https://t.co/RQBwbxDePd",
          "date": "2024-07-15T21:15:00.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I am incredibly honored to receive Congressman Mark Green’s endorsement—he led the impeachment of Mayorkas and tirelessly fights to secure our border. I couldn’t ask for a greater vote of confidence.\n\nRemember, early voting starts today!\n\nWATCH BELOW👇 https://t.co/mMO9iCgOCA",
          "date": "2024-07-12T19:17:38.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @JakeMcCalmonTN: Happy to support my Congressman, @AndyOgles, last night and stand up for the Tennessee conservative values he’s protect…",
          "date": "2024-06-25T19:01:26.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        }
      ]
    },
    {
      "issue": "Limits on Prescription Drug Prices",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "http://ogles.house.gov",
          "tweet": null,
          "date": "2025-04-27 23:30:17",
          "scraped_on": "2025-04-27 23:30:17"
        }
      ]
    },
    {
      "issue": "Illegal/Undocumented Migrants",
      "stance": false,
      "desc": "Rep. Andy Ogles (R-TN) has expressed strong opposition to illegal and undocumented migrants, stating that the issue is a \"crisis\" and calling on action to strengthen national security and protect the economy from potential threats posed by migrant groups such as Volt Typhoon and Salt Typhoon. He also criticizes President Biden's handling of the border, particularly under the leadership of Kamala Harris, whom he accuses of allowing the nation to be invaded and failing to address the issue effectively. Ogles has supported legislation aimed at restricting government spending during peacetime and strengthening law enforcement's ability to arrest and jail illegal aliens.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Wonderful to join @MariaBartiromo this morning. \n\nEight ISIS-linked terrorists were just caught at the Southern border. This blatant national security failure is due to Joe Biden's disastrous policies. Americans are paying the price for his reckless disregard for our safety. https://t.co/hO2nrw4skw",
          "date": "2024-06-12T21:40:08.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We are witnessing unprecedented actions of election interference emanating directly from the White House that are more akin to dictatorships. I’m proud to stand with President Trump in New York today and fight against this political persecution. https://t.co/0rYKtpbqOg",
          "date": "2024-05-16T15:11:50.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ve been to the border. I’ve seen firsthand the devastation caused by Border Czar Kamala Harris. Every town has become a border town.\n\nTennesseans are demanding accountability. Enough is enough! https://t.co/1fPQsLGhjr",
          "date": "2024-07-26T23:13:50.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Gov Website",
          "url": "http://ogles.house.gov",
          "tweet": null,
          "date": "2025-04-27 23:30:17",
          "scraped_on": "2025-04-27 23:30:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Radical left-wing media is desperately trying to reinvent Kamala Harris, erasing any mention of her utter incompetence at the border.\n\nWe must hold Harris accountable for her failures as border czar. We must define her. Do not let the media’s lies deceive you. https://t.co/wzcncEulPF",
          "date": "2024-07-24T22:39:07.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Immigration is the most important issue in Tennessee because Biden’s atrocious policies have turned every town into a border town.\n\nI’m tremendously proud to be one of only four members of Congress with a perfect score on securing our border.\n\nhttps://t.co/ADoeGeYd0A",
          "date": "2024-06-22T23:30:18.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Border Czar Harris has utterly failed us on the southern border. \n\nShe deserves to be impeached. https://t.co/CQyWZCEsI1",
          "date": "2024-07-26T19:20:57.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We MUST expose the truth about Border Czar Kamala Harris.\n\nHer policies have made the border a catastrophic mess, and she would be a disaster for the middle class. \n\nThe American people cannot afford her reckless incompetence. https://t.co/VmY4LbJNsu",
          "date": "2024-07-29T23:35:59.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s unconscionable for Kamala Harris to claim she’s serious about border security when, as Border Czar, she has allowed our nation to be invaded.\n\nBig thanks to @MariaBartiromo and @FoxBusiness for having me on this morning. https://t.co/9XLwlgdKvX",
          "date": "2024-08-01T15:11:43.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Tennesseans are tired of Biden’s open border and fentanyl crisis. They’re fed up with rising costs. They want President Trump to restore prosperity, unity, and safety. \n\nI’m proud to be endorsed by President Trump, and this country can’t wait for his victory in November! https://t.co/pkw60GtK14",
          "date": "2024-07-16T22:32:49.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @JayneZirkle: Rep. Andy Ogles On Kamala Harris Impeachment: Lays Out Indictment Of Her Role As Border Czar @AndyOgles https://t.co/qDu9q…",
          "date": "2024-08-01T17:02:47.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Governor Landry put the Ten Commandments back in schools, signed legislation to allow law enforcement to arrest and jail illegal aliens, and enacted the harshest penalty possible against degenerates preying on children.\n\nI'm proud to have his endorsement. https://t.co/8ywVJaKXP5",
          "date": "2024-07-25T18:40:57.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @FoxNews: Kamala Harris hit with articles of impeachment over border crisis, 'misleading' people on Biden https://t.co/9mDJL0en8j",
          "date": "2024-07-23T23:13:55.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Under Harris's watch, every single town has become a border town. Hundreds of thousands have overdosed on illicit drugs, and countless women and children have been raped and murdered.\n\nShe has willfully disregarded her oath, and she should be impeached.\nhttps://t.co/hgqupmDUvQ",
          "date": "2024-07-23T23:23:25.000Z",
          "scraped_on": "2025-03-31 00:10:17"
        }
      ]
    },
    {
      "issue": "Cybersecurity",
      "stance": true,
      "desc": "Andy Ogles supports the Strengthening Cyber Resilience Against State-Sponsored Threats Act, aiming to defend against Chinese Communist Party (CCP) cyber threats and hold the CCP accountable. He advocates for a unified government strategy to combat these threats and protect critical systems relied upon by Americans daily.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "http://ogles.house.gov",
          "tweet": null,
          "date": "2025-04-27 23:30:17",
          "scraped_on": "2025-04-27 23:30:17"
        }
      ]
    }
  ]
}