{
  "candidate": "Bob Casey",
  "positions": [
    {
      "issue": "Public Healthcare",
      "stance": true,
      "desc": "Bob Casey supports public healthcare as a fundamental right, emphasizing the need for affordable access to quality care. He advocates for expanding Medicare's ability to negotiate prices with pharmaceutical companies to lower costs for American families. Additionally, he fights to protect programs like Medicaid and Social Security from cuts and expansion efforts. Casey believes that every Pennsylvanian should be able to access healthcare without worrying about affordability.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Mom Your Business helps women of color achieve entrepreneurial success in business ownership. I am proud to have secured $130,000 in funding to support the continued growth of women-owned small businesses in Philadelphia. https://t.co/OARt5V1FyH",
          "date": "2024-07-09T21:42:54.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Many Americans have to choose between going to the doctor and paying their bills. I’m fighting to ensure that all Pennsylvanians can access quality health care without worrying about whether they can afford it. https://t.co/jdEaRoAx9k",
          "date": "2024-08-29T21:29:15.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In case you missed my bilingual seminar last week, here are some resources for seniors seeking Medicare and prescription drug assistance. https://t.co/7MlFwJah7q",
          "date": "2024-09-12T18:37:07.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is good news. \n\nAmericans should have an easy and free way to file their taxes. I’m proud to have voted for the Inflation Reduction Act to make this possible and I encourage Pennsylvanians to use this program next year. https://t.co/DJzkLNV2j8",
          "date": "2024-05-30T18:56:47.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ve fought to restore rail service between Scranton and New York for my whole career in the Senate. With funding from the infrastructure law, we’re finally making real progress. Today I joined @RepCartwright to announce funding that will begin construction on the line. https://t.co/Io9GUznaw6",
          "date": "2024-10-29T16:07:28.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Every family deserves a safe and affordable home. That’s why I fought to secure this essential funding to help lower housing costs for seniors, families, and people with disabilities in Philadelphia. https://t.co/KJ8AN20k07",
          "date": "2024-10-02T19:33:24.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I fought to give Medicare the power to negotiate prices with drug companies to lower costs for American families. Today, Medicare rolled out newly negotiated prices for 10 of the most popular drugs in the U.S. https://t.co/DOiGpW0Oms",
          "date": "2024-08-15T23:52:07.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In the wake of the Norfolk Southern train disaster, @RepDeluzio , @SenFettermanPA , and I secured $3.66 million to expand access to clean public drinking water. I will keep showing up for Darlington and fighting to pass the Railway Safety Act. https://t.co/On7EX6NbwT",
          "date": "2024-07-12T19:04:02.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The PACE program helps many low-income seniors and people with disabilities receive care while still living in their communities. My new bill will expand the enrollment period to every day of the month instead of just the first, making it easier for Americans to access care. https://t.co/Z6V5ce3MtT",
          "date": "2024-07-25T16:27:01.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Wishing a Happy #GrandparentsDay to all the grandparents across the Nation, especially those who have stepped up to raise their grandkids. I’ll keep fighting to support grandfamilies in Congress. https://t.co/bBjW26KVUt",
          "date": "2024-09-08T18:43:21.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Last week I joined union leaders and retirees to announce that more than 6,700 Pennsylvania bakery and confectionery workers' pensions would be protected, thanks to the American Rescue Plan. Standing up for PA workers and their families will always be one of my top priorities. https://t.co/ik4ZUncJDJ",
          "date": "2024-06-24T20:44:16.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We just secured $25 million in funding to support the Borough of Sharpsburg’s effort to reconnect their community to the riverfront. This project will support construction of a multimodal transportation network on a former brownfield site to unlock new opportunity for residents. https://t.co/NzwJNE5oAS",
          "date": "2024-06-26T23:03:40.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This morning, I visited the @weitzmanmuseum to highlight funding I helped secure to expand the Museum's antisemitism educational program. As antisemitism is on the rise, I'll always fight to support the safety of the Jewish community in Pennsylvania. https://t.co/jwWg61V6FL",
          "date": "2024-05-10T19:15:40.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "No one should have to forgo health care because they can’t afford it. When we passed the Inflation Reduction Act, I fought to extend lower health care premiums to save Pennsylvanians hundreds of dollars per month. https://t.co/QoKSgDIV98",
          "date": "2024-08-07T20:15:23.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Other",
          "url": "https://penncapital-star.com/campaigns-elections/bob-casey-calls-current-moment-a-time-of-real-peril-as-he-urges-democrats-to-fight/",
          "tweet": null,
          "date": "March 26, 2025",
          "scraped_on": "2025-04-15 13:20:09"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This morning, I was in Harrisburg to talk about $1.25 million in new funding to reduce flooding along Paxton Creek. Investments in infrastructure like this are critical to protecting Pennsylvanians, and I'll continue to fight for them in Washington. https://t.co/ItDnq9hzkJ",
          "date": "2024-05-20T21:31:13.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Medicare and Medicaid are sacred promises that we’ve made to Americans. I’ll always fight to protect these programs for the millions of Pennsylvanians that rely on them, and I’ll always fight back against efforts to cut funding by extreme politicians. https://t.co/riY70zHJcq",
          "date": "2024-07-30T14:07:39.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Creating jobs &amp; spurring manufacturing doesn't happen overnight. The infrastructure law, the CHIPS and Science Act, and the Inflation Reduction Act are long-term economic investments in Pennsylvania and we're going to see their benefits for years to come. https://t.co/DkiXSTKhTp",
          "date": "2024-07-27T22:41:54.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/harris-and-biden-hold-pennsylvania-campaign-event",
          "tweet": null,
          "date": "September 2, 2024",
          "scraped_on": "2025-04-15 13:20:04"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Investments in our airports are critical to make them more efficient, improve the passenger experience, and help keep passengers and workers safe. I fought for major funding investments for the Philadelphia, Pittsburgh, and Harrisburg airports to keep our Commonwealth moving. https://t.co/y6cHue8wEn",
          "date": "2024-10-23T18:56:50.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I will never stop fighting to expand opportunities for Americans with disabilities.",
          "date": "2024-07-10T16:08:12.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We just secured $21 million for the Philadelphia Housing Authority’s Westpark redevelopment. This project will pave the way for future affordable housing by improving infrastructure to make West Philadelphia more livable for all. https://t.co/ioplE2tfW9",
          "date": "2024-06-26T20:49:37.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Pennsylvania workers are the backbone of our Nation’s economy. I will always fight to support our workers, create good union jobs, and bring investments to the Commonwealth that help Pennsylvanians support their families. https://t.co/aW1wVN9XwG",
          "date": "2024-10-25T20:28:21.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Keeping Pennsylvanians safe from fentanyl is one of my top priorities. I've fought to ensure Pennsylvania law enforcement have the resources they need to tackle this crisis. https://t.co/uXcAF6Uc0T",
          "date": "2024-05-20T17:28:12.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I will always fight to make sure every young American has access to the education they need to reach their full potential. Today I introduced three new bills that would invest in colleges and help students receive their degrees. https://t.co/WMqmab2bQh",
          "date": "2024-09-25T20:57:58.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I'll never stop fighting for Pennsylvania workers.",
          "date": "2024-05-22T20:13:54.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Raising kids in America is expensive. When we expanded the Child Tax Credit in 2021, I heard from parents who were able to spend more time with their kids and put them in activities for the first time. \n\nHow do you put a price on that? https://t.co/TcU0IfMcpT",
          "date": "2024-08-20T20:25:24.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I'm in Harrisburg with @SecretaryPete and @GovernorShapiro to announce $500 million for the I-83 South Bridge. I fought to pass the infrastructure law and secure this funding so this bridge remains safe and reliable for all Pennsylvanians. https://t.co/J2hFnBu9Tb",
          "date": "2024-07-17T15:14:06.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Supporting PA's farmers and rural communities is one of my top priorities. It was great to be back at Penn State's Ag Progress Days and hear directly from the people who power PA's biggest single industry, agriculture. https://t.co/ckerC2L9fL",
          "date": "2024-08-15T21:30:31.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We just secured $15 million in funding to support the Codorus Greenway Project along Codorus Creek in York. This transformational project will create a mile of waterfront trail along the creek for generations of York residents to come. https://t.co/hF3UJsjkj0",
          "date": "2024-06-27T14:50:32.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Workers should be treated with the dignity they deserve, and in the era of AI that means ensuring technology can't be used to spy on them at work. My Stop Spying Bosses Act will protect workers.",
          "date": "2024-05-22T14:57:54.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I am happy to announce $500,000 in federal funding to reimagine Johnstown neighborhoods, with the goal of creating safe and vibrant communities and higher-quality affordable housing options for Johnstown residents. https://t.co/Xq0yVkPBq4",
          "date": "2024-09-09T21:52:12.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Workers shouldn't have to worry about intrusive uses of technology by supervisors. My Stop Spying Bosses Act would protect them from that and ensure they can continue to work with the dignity they deserve.",
          "date": "2024-05-09T21:22:31.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was great to be back in Johnstown yesterday to see Pennsylvania’s defense innovations on display at Showcase for Commerce. I’ll keep working to support our men and women in uniform, protect our national security, and create good-paying manufacturing jobs here in PA. https://t.co/UkMbTw41i8",
          "date": "2024-05-31T20:23:02.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @DonaldNorcross: Right on, @SenBobCasey. Our No Tax Breaks for Union-Busting Act would make sure that hardworking Americans aren't footi…",
          "date": "2024-05-15T19:09:05.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        }
      ]
    },
    {
      "issue": "Renewable Energy",
      "stance": true,
      "desc": "As a champion of renewable energy, Senator Bob Casey supports expanding investments in the industry to ensure Pennsylvania remains a leader in clean energy development and job creation. He highlights the growth of solar energy projects in rural areas, reducing operating costs for businesses while promoting economic growth. Additionally, he emphasizes the importance of investing in Pennsylvania's energy sector, citing President Biden's efforts to increase domestic energy production under his leadership. Casey also vows to protect and promote the interests of Pennsylvania's energy workers and communities.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I'm proud to announce that small business owners and farmers across Pennsylvania will benefit from @USDA's REAP program.\n$24.1M toward creating jobs, lowering energy, and expanding access to clean energy. https://t.co/nQ09ys72sP",
          "date": "2024-10-24T20:59:06.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Solar energy is helping rural businesses across PA lower their operating costs while continuing to grow their businesses. Last week, I stopped by Remmey - The Pallet Company in Beaver Springs to see how they're making use of @usdaRD funding to purchase solar equipment. https://t.co/0ahjfEeX9E",
          "date": "2024-07-22T14:55:52.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/harris-and-biden-hold-pennsylvania-campaign-event",
          "tweet": null,
          "date": "September 2, 2024",
          "scraped_on": "2025-04-15 13:20:04"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Pennsylvania has always been an energy state and over the last two years, we have seen an influx of clean energy projects coming to our Commonwealth. I'll keep fighting to create new, good-paying energy jobs for PA workers. https://t.co/iMMa3eHIMQ",
          "date": "2024-08-19T15:40:27.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "From putting food on the table, to powering our homes and businesses, Pennsylvania energy is a life-sustaining industry. I’m fighting to expand energy investments in the Commonwealth to ensure Pennsylvania’s proud energy sector can continue to be a leader for the future. https://t.co/7SQoo78KFV",
          "date": "2024-10-24T14:51:00.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        }
      ]
    },
    {
      "issue": "Limits on Prescription Drug Prices",
      "stance": true,
      "desc": "Bob Casey supports limits on prescription drug prices as part of his efforts to reduce healthcare costs and expand access to care for all Americans. He advocates for giving Medicare the power to negotiate medication costs and has voted to pass legislation addressing price gouging and combating the fentanyl crisis in Pennsylvania. Casey's Price Gouging Prevention Act aims to crack down on excessive pricing by certain companies, particularly those producing and trafficking fentanyl.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "No one should be denied health care because they can’t afford it. I’m fighting to lower prescription drug costs and expand access to health care for all Americans.",
          "date": "2024-07-11T18:26:30.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I'll never stop fighting to end the fentanyl crisis in Pennsylvania.",
          "date": "2024-05-24T14:38:51.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We passed the FEND Off Fentanyl Act to target criminal organizations that produce &amp; traffic fentanyl, but there’s more to be done to combat this crisis. \n\nMy Stop Fentanyl at the Border Act would ensure border protection officers have the resources to stop it at ports of entry.",
          "date": "2024-05-08T16:54:31.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Other",
          "url": "https://penncapital-star.com/campaigns-elections/casey-talks-penn-encampment-and-war-in-gaza-during-visit-to-american-jewish-history-museum/",
          "tweet": null,
          "date": "May 10, 2024",
          "scraped_on": "2025-04-15 13:20:14"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I fought to pass the FEND Off Fentanyl Act to target the criminal groups who produce and traffic fentanyl - but there's still more to do. My Stop Fentanyl at the Border Act will ensure border protection officers have the resources to detect it at ports of entry.",
          "date": "2024-05-15T16:46:39.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Working families can't afford to pay for corporations’ record profits. The Price Gouging Prevention Act would   make sure they don't have to.",
          "date": "2024-05-07T16:00:02.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Millions of Americans are struggling to afford their prescription drugs, that's why I fought to give Medicare the power to negotiate the cost of medications. It was great to be in Pen Argyl last week to celebrate a huge victory for families across the Commonwealth. https://t.co/8ZKf4fIONt",
          "date": "2024-09-05T19:16:29.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today, I voted to pass the Kids Online Safety &amp; Privacy Act to make sure internet companies are protecting kids from bullying, mental health issues, and predators. This is an important step to protect our children's wellbeing against growing threats online. https://t.co/fSYGL0HlVU",
          "date": "2024-07-30T19:48:05.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I fought to give Medicare the power to negotiate prices with drug companies to lower costs for American families. Today, Medicare rolled out newly negotiated prices for 10 of the most popular drugs in the U.S. https://t.co/DOiGpW0Oms",
          "date": "2024-08-15T23:52:07.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Other",
          "url": "https://penncapital-star.com/campaigns-elections/bob-casey-calls-current-moment-a-time-of-real-peril-as-he-urges-democrats-to-fight/",
          "tweet": null,
          "date": "March 26, 2025",
          "scraped_on": "2025-04-15 13:20:09"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Big corporations are making record profits while working families pay higher prices. It's called greedflation and my Price Gouging Prevention Act will crack down on it.",
          "date": "2024-05-21T13:14:54.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nearly a decade ago, I passed the ABLE Act to help people with disabilities save for their futures without losing federal benefits. Yesterday, I announced $130 million invested in PA ABLE accounts, showing how well this program is working here in the Commonwealth. https://t.co/Wk3PmZ4YzG",
          "date": "2024-10-15T20:10:49.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        }
      ]
    },
    {
      "issue": "Abortion",
      "stance": true,
      "desc": "Bob Casey has consistently demonstrated a strong stance against abortion rights, voting against measures that support reproductive freedom and contraception access. He has expressed disappointment in Senate Republicans for failing to protect women's rights, particularly in light of the overturning of Roe v. Wade. However, he also emphasizes his commitment to supporting veterans' care through legislation such as the PACT Act and addressing rising antisemitism.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Make no mistake: IVF acess is in jeopardy because of the fall of Roe v Wade. But when given the opportunity to protect access to fertility treatments today, Senate Republicans have once again failed to do so. American women know that actions speak louder than words.",
          "date": "2024-09-17T20:25:32.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "But make no mistake: reproductive rights are still under attack. Extreme politicians are going to keep pushing to ban abortion nationwide and take away the right to contraception, and we're going to fight them every step of the way.",
          "date": "2024-06-13T15:15:46.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is huge news: 1 million PACT Act claims have been granted and our veterans are getting the treatment they need for toxic exposure.\n\nI was proud to fight for the PACT Act, but our work to ensure our veterans are cared for is never done.\nhttps://t.co/kpwP1HetmW",
          "date": "2024-05-22T13:10:21.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Last week, Senate Republicans voted against the right to contraception, and today they voted against protecting IVF for families trying to conceive.\n\nActions speak louder than words. Republican politicians are again proving that they can't be trusted on reproductive rights.",
          "date": "2024-06-13T21:00:10.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In the two years since the overturning of Roe v. Wade, the impacts of the Supreme Court's dangerous decision are clear. States are passing total abortion bans and access to IVF and contraception is under threat.",
          "date": "2024-06-24T14:36:14.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Stories like Scott and Michelle’s are why I fought to pass the PACT Act. We owe everything to our veterans and we should make sure they're taken care of when they get back home.\nhttps://t.co/lm6ipJDkkO",
          "date": "2024-05-17T18:32:08.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The fentanyl crisis has impacted communities across Pennsylvania. On Fentanyl Awareness Day, it's important to spread awareness of the dangers of fentanyl, and it's why I've been fighting for legislation to end fentanyl trafficking. https://t.co/gSwXs4HGqB",
          "date": "2024-05-07T17:22:02.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This morning, I visited the @weitzmanmuseum to highlight funding I helped secure to expand the Museum's antisemitism educational program. As antisemitism is on the rise, I'll always fight to support the safety of the Jewish community in Pennsylvania. https://t.co/jwWg61V6FL",
          "date": "2024-05-10T19:15:40.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m praying for the victims and all those impacted by the shooting in West Philadelphia overnight. \n\nI have reached out to local officials to offer support and I will keep pushing for commonsense gun safety laws to end the scourge of gun violence across our Nation. https://t.co/wet8TBujUR",
          "date": "2024-07-21T15:25:52.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Senate Republicans just blocked another bill to protect reproductive rights, just one month after blocking bills to protect access to IVF and contraception. At every opportunity, Republican politicians prove they can’t be trusted to support women’s rights.",
          "date": "2024-07-10T22:12:29.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Republicans arguing that voting against the right to contraception means they support contraception https://t.co/C0y0MNwC1M https://t.co/pHItPfzFLd",
          "date": "2024-06-06T22:14:03.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "To root out antisemitism, we must educate the next generation about its dangers. I was honored to join Tree of Life on Friday to announce funding I helped secure to expand their noble mission to end antisemitism and hate in all its forms as they Remember, Rebuild, and Renew. https://t.co/XKnrqnC36Z",
          "date": "2024-05-28T18:18:26.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Other",
          "url": "https://penncapital-star.com/campaigns-elections/bob-casey-calls-current-moment-a-time-of-real-peril-as-he-urges-democrats-to-fight/",
          "tweet": null,
          "date": "March 26, 2025",
          "scraped_on": "2025-04-15 13:20:09"
        }
      ]
    },
    {
      "issue": "Pollutant Controls",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I had the chance to tour Pine Creek Seed Farm and congratulate them on winning @SBAgov’s Eastern PA Family-Owned Small Business of the Year Award recipient. It's great to see family-owned farms thriving in rural Pennsylvania. https://t.co/TalwnNTTJK",
          "date": "2024-07-19T13:16:28.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The PA Wilds are known for their natural beauty, and when a new low-flying zone threatened to disrupt the tourism that supports the regions economy, I went to work to stop it. Last week, I took @SBAIsabel to Kinzua Bridge State Park to show off this Pennsylvania treasure. https://t.co/AqvigjunTn",
          "date": "2024-05-21T14:21:20.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The fentanyl crisis has impacted communities across Pennsylvania. On Fentanyl Awareness Day, it's important to spread awareness of the dangers of fentanyl, and it's why I've been fighting for legislation to end fentanyl trafficking. https://t.co/gSwXs4HGqB",
          "date": "2024-05-07T17:22:02.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/harris-and-biden-hold-pennsylvania-campaign-event",
          "tweet": null,
          "date": "September 2, 2024",
          "scraped_on": "2025-04-15 13:20:04"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "En caso de que te hayas perdido mi seminario bilingüe la semana pasada, estos recursos son para personas mayores que buscan asistencia con Medicare y medicamentos recetados. https://t.co/KqZ28yKkRG",
          "date": "2024-09-12T18:37:54.000Z",
          "scraped_on": "2025-03-26 18:13:03"
        }
      ]
    }
  ]
}