{
  "candidate": "Debbie Mucarsel-Powell",
  "positions": [
    {
      "issue": "Abortion",
      "stance": true,
      "desc": "Debbie Mucarsel-Powell supports efforts to prevent state restrictions on abortion before viability or in cases where a woman's life is at risk. She believes that such bans disproportionately affect low-income and women of color, particularly those with limited access to healthcare through Medicaid. Her stance emphasizes the importance of reproductive health care as central to overall women's healthcare.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida's abortion ban goes beyond the state. Women throughout the SE in need of critical health care have been abandoned because of these extremist laws. Rick Scott is proud of this ban and wants a national one. We CAN’T let him back in the Senate. https://t.co/HIEI4HSShs",
          "date": "2024-05-15T21:35:22.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Congratulations, Senator-elect 👏💙 I know my friend @CarlosGSmith will be a voice for hope, and will fight for meaningful change in the Florida Senate! https://t.co/PJLd5CpX8C",
          "date": "2024-06-14T21:03:29.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As a Latina, I have seen firsthand how these extreme bans affect our communities. This is why countries like Colombia and Argentina have legalized access. When I get to the Senate I will protect freedom for all women and girls. https://t.co/fTtvTqLoE7",
          "date": "2024-06-22T18:34:21.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our people-powered campaign is greater than Scott’s self-funded lies. Floridians want to protect:\n\n✅Social Security &amp; Medicare\n✅Reproductive freedom\n✅Democracy\n✅FL’s unique environment\n\nHelp us unseat the thief running for GOP Senate Leader. https://t.co/z8u7ajOPkH",
          "date": "2024-08-27T17:42:25.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“They need a U.S. senator of unassailable values: one who will stand up for their freedom to make their own reproductive health decisions; one who who will strengthen the social safety net of the Affordable Care Act, Social Security and Medicare and not take aim at them.” \n\nThank https://t.co/CnLk8LvlRw",
          "date": "2024-10-06T13:27:51.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I'm running to fight for Florida families. Rick Scott's failed policies have caused an affordability crisis and blocked economic opportunity for too long. No Más! https://t.co/0fy2aXW7Lu",
          "date": "2024-06-11T16:30:21.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida’s dangerous abortion ban has forced thousands of women to travel for days just to receive vital health care. I refuse to accept this as our new normal — women shouldn’t have to spend every dollar they have to cross state lines to get the care they deserve.",
          "date": "2024-06-24T12:49:56.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://www.wusf.org/politics-issues/2024-08-12/debbie-mucarsel-powell-economy-taxes-insurance-abortion-florida-primary-2024-us-senate",
          "tweet": null,
          "date": "August 12, 2024",
          "scraped_on": "2025-04-15 13:45:23"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott started this insurance crisis and it’s Florida homeowners who are paying the price. I’ll always fight to lower the extraordinary everyday costs Floridians are facing, and tackle the climate crisis driving people out of our state. https://t.co/aKkFTPQzcc",
          "date": "2024-06-10T20:52:06.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "While Rick Scott thinks it’s okay to strip half the population of their rights, I’m fighting back. Women in Florida deserve a Senator who will protect their fundamental freedoms. We deserve to make our own health care decisions. #NOMÁS\nhttps://t.co/BebCyh05uV",
          "date": "2024-06-25T19:07:49.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I was grateful to be honored at the @RuthsListFL gala. Receiving the Architect of Change award reaffirms my commitment to fighting for a world where women have the opportunities to thrive, have our voices heard, &amp; rights protected. Let's build a better future for women in the US. https://t.co/5CQId1uzpS",
          "date": "2024-05-19T17:23:44.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://news.wgcu.org/2019-07-29/south-florida-lawmakers-make-case-for-tps-for-venezuelans",
          "tweet": null,
          "date": "July 29, 2019",
          "scraped_on": "2025-04-15 13:45:15"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kicked off our 75 stop tour — one for every time Rick Scott pled the fifth during the largest Medicare fraud scandal in US history.\n\nSo proud to be in the fight to lower costs and protect our rights with @DonnaShalala, Comm'r Higgins and  hardworking Floridians across the state. https://t.co/bBpOpde0Fv",
          "date": "2024-08-29T01:00:09.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "So happy to have @CortezMasto join us on our 75-stop tour!\n\nAs I travel all around FL, one thing is clear: people are fed up with Rick Scott. It’s time for a future where we know his greedy hands aren’t touching their Social Security &amp; Medicare, or stripping us of our rights. https://t.co/Rfi9hCuwbs",
          "date": "2024-09-23T15:05:34.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We will pass Amendment 4, we will protect Floridians hard earned benefits and in just 3 days — we will retire Rick Scott. https://t.co/FR794aYw70",
          "date": "2024-11-03T02:52:18.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott’s a con man &amp; cheat — and certainly doesn’t care about women. He voted against protecting contraception, sponsored a national abortion ban, and supports FL’s dangerous ban. #NoMás.\n\nWhen I get to the Senate, I’ll make sure we codify Roe &amp; protect IVF &amp; contraception. https://t.co/5V8qbwZO8I",
          "date": "2024-06-06T11:21:37.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Latinos around Florida know what it means to fight for freedom — it’s a fight that’s personal to me. @LULAC knows democracy is at stake in this election, and together, we’re going to protect it. https://t.co/rSoyh42IgK",
          "date": "2024-10-26T14:06:36.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My story is one that’s reflected all around Florida. I went from working a minimum wage job to serving in Congress. Now, I’m running for Senate to protect the very opportunities that empowered me.\n\nFlorida’s worth fighting for. Are you with us?",
          "date": "2024-05-12T21:20:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The cost of living is skyrocketing — and our Senator is doing nothing about it. I'll fight to make FL more affordable by:\n\n🔹lowering every day costs\n🔹expanding the Child Tax Credit\n🔹creating good paying jobs\n🔹tackling the homeowner insurance crisis https://t.co/EwiEPJR9R3",
          "date": "2024-05-20T22:01:14.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is the right response. I've long called on the U.S. to support the Haitian people in these unstable times. They deserve to feel safe. https://t.co/rrrUtKiVhX",
          "date": "2024-07-25T20:40:12.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott skipped Senate votes yesterday — including one which extremist Senate Republicans blocked bipartisan legislation to protect access to reproductive health care.\n\nWhile Scott's playing political games, I'm running to stop him and protect our freedoms.",
          "date": "2024-07-11T14:53:27.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @Vegalteno: At @latinovictoryus we support @DebbieforFL for US Senate!",
          "date": "2024-05-27T14:57:31.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joined @LaPoderosa670 this morning to talk about what’s at stake this year. Across FL, voters are fed up with Rick Scott ignoring the skyrocketing cost of living &amp; his authoritarian attacks on our rights. Democracy is on the line, &amp; I am proud to be a Latino voice that will fight https://t.co/JUCEm4NJtK",
          "date": "2024-05-21T15:56:30.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "But something’s happening in Florida — men and women all around the state have told me they’re fed up with Scott and his attacks on our rights. Abortion access is literally on the ballot this year, and people are FIRED UP to fight for our freedoms. https://t.co/xkHHFyzlBa",
          "date": "2024-06-24T12:49:57.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Floridians hit by Helene need resources now, and Rick Scott wasn’t even at a critical FEMA funding vote. It’s time Floridians had a Senator who fought for them. https://t.co/gXRT3Sj3pt",
          "date": "2024-10-02T21:45:22.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott’s scared. Floridians want someone who's fighting *for* them, not against.\n\nThere are only 6 more Mondays until Election Day, let’s make it happen! https://t.co/iVZz66AVIJ",
          "date": "2024-09-24T02:56:48.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Congressman @ClyburnSC06's lifelong dedication to fighting for freedom and equality has been an inspiration to me and so many others. I'm honored to have his support, and together, we'll continue fighting for the fundamental freedoms of all Americans. https://t.co/djm3qUGSJx",
          "date": "2024-08-14T21:50:39.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Haitian culture is part of the fabric of South Florida. As we honor Haitian Heritage Month, we must stand with those in Haiti fighting for freedom and democracy. Their fight is our fight. https://t.co/ov64xr6L6U",
          "date": "2024-05-31T00:54:38.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://floridaphoenix.com/2024/10/04/mucarsel-powell-calls-rick-scotts-reluctance-to-debate-a-dereliction-of-duty/",
          "tweet": null,
          "date": "October 4, 2024",
          "scraped_on": "2025-04-15 13:44:56"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Women in Florida are being turned away from life-saving treatment because of Rick Scott and DeSantis’ abortion ban. \n\nEmily should never have had to go to Virginia just to seek health care — but that’s the reality for women in Florida because of these extremist bans. https://t.co/iBkEX33l0O",
          "date": "2024-10-16T14:52:55.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On the anniversary of the Social Security Act, let me be clear: I’ve pledged to always protect Social Security &amp; Medicare once I’m in the Senate. \n\nWhile Rick Scott wrote the plan to end Social Security &amp; Medicare, seniors can count on me to fight for their hard-earned benefits. https://t.co/Ef9uInCBZp",
          "date": "2024-08-14T15:20:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott just voted against protecting access to IVF — AGAIN. He's a fraud who keeps showing us his phony support for IVF is just his latest ploy to trick women into believing that he cares about reproductive freedom.\n\nIn the Senate, I'll fight to protect IVF for families.",
          "date": "2024-06-13T18:44:50.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "If Rick Scott wanted to protect IVF, he would have voted to protect IVF. Actions speak louder than his empty promises. https://t.co/MRzHOW3RLv",
          "date": "2024-06-19T17:34:59.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hey @ScottforFlorida, DON’T MESS WITH MY PEOPLE!!!\n\nLatinos are making it loud and clear, we’re going to fight to protect our rights this November! https://t.co/NZxOyB81q4",
          "date": "2024-09-07T17:15:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "THIS is the result of extremists like Scott and DeSantis’ attacks on education, erasing Black history and banning books!! We can’t let Scott back in office in November. https://t.co/UkyF98ZRRl",
          "date": "2024-08-15T21:41:33.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "🚨NEW AD JUST DROPPED 🚨\n\nMy mom brought me here from Ecuador for better opportunities that allowed me to go from a minimum wage job to the first South American immigrant in Congress. Rick Scott’s threatening Floridians’ opportunities — we’ll retire him in November. https://t.co/5oTnFYBork",
          "date": "2024-09-09T15:01:17.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In less than 90 days, this election will determine the future of our rights — and Gen Z will be impacted for years to come. If you’re ready to fight for our most fundamental freedoms and unseat Rick Scott, apply to join our Students for Debbie Digital Organizing Fellowship! https://t.co/psXma9kG4O",
          "date": "2024-08-08T21:41:22.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There’s power in voting. The world is watching Venezuela right now. As Venezuelans fight for their freedoms, we must do the same here to protect our democracy. VOTE. https://t.co/gviyJGNX7r",
          "date": "2024-08-09T18:00:36.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Does Rick Scott support this unconstitutional attack against Americans’ freedoms? \n\nTargeting and harassing the opposition happens in Cuba, Venezuela, and Nicaragua. Now Scott’s far-right agenda is using the same tactics as Maduro’s playbook, from not recognizing election results https://t.co/8LTZIoBFB5",
          "date": "2024-09-01T18:55:55.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m ready to fight for every single Floridian. And when we fight, we WIN! Si se puede!! https://t.co/a4MZ1Dvcu4",
          "date": "2024-10-24T01:59:14.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Women around Florida and the country are FIRED UP. This is our moment. I’m so proud to have the support of @NationalNOWPAC. Together, we’ll fight for our freedoms — and elect the first statewide Latina in Florida. https://t.co/15EIpsgpCp",
          "date": "2024-08-18T19:35:18.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The energy from women around Florida who are ready to fight for their freedoms this November is incredible 🤩 Sarasota county’s sick of Rick Scott and going to retire him! https://t.co/lbALQ2pFxn",
          "date": "2024-08-14T00:24:49.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Women like @SamanthaHopeFL and Grace, who runs La Costa Latina Newspaper, are doing the hard, critical work this election — organizing their communities, meeting voters where they are, and helping turn people out as we fight for our freedoms this  November. Let’s do this 💪 https://t.co/PlCJ6ZbAPt",
          "date": "2024-07-12T18:13:35.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Banning Books is NOT freedom.\n\nSuppressing free speech is NOT freedom.\n\nBanning access to abortion is NOT freedom. \n\nFloridians from all political affiliations have had enough and will vote for freedom this November.",
          "date": "2024-06-19T13:18:10.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today is Black Women’s Equal Pay Day, and Black women make 66 cents for every $1 their white male counterparts earn for the same work — that’s a disgrace.\n\nIn the Senate, I’ll fight to close the wage gap and pass the Paycheck Fairness Act. https://t.co/FzvVrYMpL4",
          "date": "2024-07-10T00:38:21.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Here's my promise: When I get to the Senate I will fight to protect women's rights and codify Roe v. Wade.",
          "date": "2024-06-28T15:39:54.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I will always fight to protect IVF.\n\nI will always fight to protect access to contraception.\n\nI will always fight to protect abortion access.\n\nExtremists think they can take away our freedoms, but we won’t let them.",
          "date": "2024-06-12T19:52:24.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott, has stood firmly in the way of legislation to prevent gun violence while being backed by the gun lobby throughout his career. I'm running to be Florida's next U.S. senator to expand gun safety laws so nobody has to live in fear. You have my word on that.",
          "date": "2024-06-12T12:25:53.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today, I joined Congressman @AlLawsonJr and local leaders in Tallahassee to discuss how Rick Scott’s dangerous abortion ban has impacted panhandle communities. The fight for reproductive freedom runs through Florida, Floridians can count on me to fight for our rights. https://t.co/VcptBo0Qyq",
          "date": "2024-07-08T20:50:07.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@BarbieHardnHall @JenniferAdamsFL So proud of all the women leaders running in Florida to make sure we fight to lower costs for families, for children’s health and safety and for women’s fundamental reproductive rights. Let’s do this!!!",
          "date": "2024-07-20T16:07:57.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Women around Florida are fed up with Rick Scott's dangerous policies to control our own bodies. No más!\n\nOur Women for Debbie coalition is ready to fight back against Scott, so that women can determine their own futures. https://t.co/up2V35Sv6M",
          "date": "2024-08-02T17:20:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As my mom's primary caretaker, I know what a critical lifeline Social Security and Medicare are for seniors.\n\nI'm honored to have @SSWorks alongside us in the fight to stand up for our seniors and unseat the man who wrote the plan to end Social Security &amp; Medicare. https://t.co/JzXMVsLHAe",
          "date": "2024-08-14T14:16:54.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Even Trump is running away from @scottforflorida's abortion ban because Floridians are against it. Scott's desperate and alone in his dangerous positions, and we'll prove it in November. https://t.co/GU2l7BftmI https://t.co/tbP6GIfNwk",
          "date": "2024-08-29T22:59:32.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Unlike Rick Scott, when I’m in the Senate, I’ll always fight to protect reproductive freedoms. https://t.co/QEyjEGl737",
          "date": "2024-06-07T11:42:14.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There’s something happening in Florida. I’m running to retire Rick Scott and his extremist policies, and Floridians are READY. We’re in the fight of our lifetime to protect our rights — Florida is worth fighting for. https://t.co/kXGRrXgO1l",
          "date": "2024-05-13T16:49:12.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott once again voted against IVF. I’m the only candidate in this race who will fight to protect women’s reproductive freedom and Florida families. We can’t allow Scott to continue attacking our rights. https://t.co/QTMwxubHXl",
          "date": "2024-09-24T15:36:25.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m honored to have the support of my friend, former colleague, and future Speaker of the House @hakeemjeffries, who’s consistently fought for everyday Americans.\n\nHe knows better than anyone how out-of-touch politicians like Rick Scott are failing American families. Together, https://t.co/q3db00nFWr",
          "date": "2024-08-16T13:23:57.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "One week until Election Day, and we’ve still got stops to make on our Freedom Bus Tour! Today, voters from all over Gainesville showed up and proved that we’re ready to fight for our freedoms and take back Florida. https://t.co/IkZc41XJ63",
          "date": "2024-10-30T01:11:21.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott is a danger to Latinos and those of us who’ve fled from authoritarian regimes. The fight for democracy is personal to me, and I’m making sure Latinos across Florida know that I’ll always fight for our freedoms. https://t.co/G1R6g2SRac",
          "date": "2024-09-10T14:18:46.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "50 days left, Team DMP!\n\n🔹Affordability is on the ballot\n🔹Democracy is on the ballot.\n🔹Reproductive freedom is on the ballot.\n🔹Climate action is on the ballot.\n🔹Our children's safety is on the ballot.\n\nLet’s do this, Florida! https://t.co/Wuf4zUtkOq",
          "date": "2024-09-16T23:12:39.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Mifepristone is safe, effective &amp; has had FDA-approval for over 20 years. Access to this lifesaving drug remains for now — but attacks on our reproductive rights won't stop. We have to fight for them at the ballot box.",
          "date": "2024-06-13T16:10:01.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Brought #TeamDMP donuts to celebrate my favorite day of the year, #NationalDonutDay!\n\nWhen I was 15, I started working in a donut shop to help my family pay the bills. Donuts were the lifeline that helped my family survive, and I promise to fight for working class families like https://t.co/gVVeOJd1KB",
          "date": "2024-06-07T18:42:36.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is a good first step. Maduro’s narco regime MUST be held accountable. I stand with the people of Venezuela who continue to fight for democracy. https://t.co/wp2q9A48Ru",
          "date": "2024-09-14T00:42:11.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My heart BREAKS for the families of those who were murdered in Haiti — homes set on fire at 3 am is horrific. This violence has to end. We MUST support Haitians in the fight for democracy and their safety. https://t.co/UUG9lrcbD3",
          "date": "2024-10-05T15:35:52.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Women and girls in Florida can always count on me to fight for our most fundamental freedoms. https://t.co/lxVBI7dE0w",
          "date": "2024-07-23T18:47:29.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "FL leads the nation in mass shootings  — &amp; DeSantis refuses to do anything. It's my life's work to fight for common sense solutions to gun violence, including w/ @GIFFORDS_org. I won’t allow extremists to cower to the gun lobby over protecting our kids. https://t.co/ag0cA83FAf",
          "date": "2024-06-26T22:42:24.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Public Healthcare",
      "stance": true,
      "desc": "Debbie Mucarsel-Powell advocates for public healthcare by expanding access to quality health care, protecting patients' rights, and fighting against cost increases. She supports Medicaid expansion in Florida and will work to pass the Paycheck Fairness Act to lift families out of poverty. As a senator, she plans to protect Social Security and Medicare from benefit cuts and improve the programs.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida👏is👏in👏play👏\n\nExtremists like Rick Scott aren’t looking out for Floridians. I’m running for Senate to fix our affordability crisis and protect our fundamental freedoms. https://t.co/JFTfRmKk5R",
          "date": "2024-06-07T19:54:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida’s behind in health insurance coverage, and Rick Scott wants to shrink that number even MORE by repealing the ACA.\n\nFloridians have my word that in the Senate, I’ll fight to protect the ACA and support Medicaid expansion in Florida. https://t.co/GbX0fS52UO",
          "date": "2024-08-08T18:37:59.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Let me tell you, West Palm Beach is fed up with attacks on their Social Security and Medicare, and sky rocketing every day costs. They’re ready for a future where we can thrive, rather than be fearful about which of our rights Rick Scott will attack next.\n\nLet’s do this! https://t.co/wlDZHvDSQK",
          "date": "2024-09-21T16:49:34.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our seniors worked hard for their Social Security and Medicare benefits — but Rick Scott wants to strip them of these critical programs.\n\nFlorida seniors can count on me to fight for them in the Senate. https://t.co/EFZqARbgRZ",
          "date": "2024-07-29T23:02:12.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you to the @FLAFLCIO for your support and endorsement. In the Senate, I will make sure we protect safe workplaces, fight for fair wages and protect your hard-earned benefits. Si se puede! 💪 https://t.co/oQtZ0XBUpJ",
          "date": "2024-09-18T13:19:59.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was great seeing @Vegalteno and so many other friends championing @latinovictoryus this afternoon!\n\nI’m proud to have been the first South American immigrant elected to Congress. In the Senate, I’ll champion the freedoms so many of us fought to come to the U.S. for. https://t.co/CZIHN7tUov",
          "date": "2024-05-20T23:50:45.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "So many of our Floridians rely on critical programs like Social Security and Medicare. Rick Scott wants to take these lifelines away from seniors — I’m running to protect them. https://t.co/52qS3a6bui",
          "date": "2024-06-12T00:45:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "TALLAHASSEE IS READY TO FIGHT FOR OUR FREEDOMS!\n\nWhat a great day meeting with voters who are ready to fight for Florida’s future. Together, we’ll win in November 💪 https://t.co/K7Q0txDtFn",
          "date": "2024-07-08T23:54:34.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Esta mañana, realizamos un foro con @MegaTVLive para hablar sobre los temas que Rick Scott tiene miedo de debatir: la protección del Seguro Social y Medicare, la democracia y nuestras libertades. https://t.co/XNCvkTDq65",
          "date": "2024-11-02T18:16:59.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott wants to rip Social Security and Medicare away from our seniors.\n\nToday, I pledged to fight for these critical programs in the Senate. I will never take Social Security and Medicare away from those who’ve worked so hard for it. https://t.co/V7QWkOXb51",
          "date": "2024-05-30T00:34:07.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Scott failed public workers when he signed onto disastrous reforms to the FL Retirement System pension plan. Retirees on fixed-incomes will suffer because of his mismanagement, and they know who to blame. \n\nFirefighters in FL know that I'll fight for them. https://t.co/LcFmRI8Hlz",
          "date": "2024-05-31T16:18:16.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My mom had the courage to come to this country to give my sisters and me the very same freedoms and opportunities that extremists like Rick Scott want to take away.\n\nIn the Senate, I’ll fight for our freedoms every single day. https://t.co/ekQMZ8VapW",
          "date": "2024-05-07T15:52:58.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I recently had the pleasure of meeting this 95-year-old veteran. We talked about the vital programs our seniors rely on, like Social Security and Medicare.\n\nFlorida seniors have my word that I will never take away their hard-earned benefits when I’m in the Senate. https://t.co/ulfce7LUqX",
          "date": "2024-08-02T15:53:42.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I fought for fair wages and more job opportunities in Congress. Workers are the backbone of our economy, and Florida's workforce can count on me to have their backs. I'm proud to have the support of @flaflcio!! https://t.co/df0ieH3BYe",
          "date": "2024-09-20T16:40:18.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you for having me, @gregtoussaint. Haitian Americans are leaders, entrepreneurs, business owners, teachers — pillars of our community. I'll always fight for our Florida communities in the Senate. https://t.co/FoP7iIfxHB",
          "date": "2024-10-27T17:29:13.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When the system fails patients, free clinics like Caridad Center are critical. During my time as a Dean at FIU Medical School, I saw firsthand how health care workers tirelessly provide care. In the Senate, I’ll fight to protect patients &amp; expand access to quality health care. https://t.co/hDcLM21wYb",
          "date": "2024-05-24T21:31:15.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My story is one that’s reflected all around Florida. I went from working a minimum wage job to serving in Congress. Now, I’m running for Senate to protect the very opportunities that empowered me.\n\nFlorida’s worth fighting for. Are you with us?",
          "date": "2024-05-12T21:20:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "During my time as the Associate Dean of the FIU medical school, I learned that there’s no one more selfless — or critical to our health — than our nurses. This National Nurses week, I thank our nurses for the tireless work they do to advocate for their patients.",
          "date": "2024-05-07T20:03:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "BROWARD SHOWED UP 👏 \n\nVoters in Broward County are ready for change. They know it’s time for a senator who protects Social Security and Medicare and fights for our rights.  Let’s make it happen Florida! https://t.co/ezxlKqFYDg",
          "date": "2024-09-01T22:14:30.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In Florida, our rights and most fundamental freedoms are on the line. Rick Scott supports a dangerous national abortion ban.\n\nI know what it means to fight for your rights, and I will be a champion in the Senate. Thrilled to have @PPact alongside us in the fight of our lifetime. https://t.co/g2goNVqVnL",
          "date": "2024-05-21T20:22:52.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://states.aarp.org/florida/scott-mucarsel-powell-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 13:45:07"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida’s facing an affordability crisis, and mega-millionaire Rick Scott’s too out-of-touch to care about the extreme costs driving people out of the state.\n\nI have a plan on day one in the Senate to lower everyday costs and fight inflation. https://t.co/4XJSbVG5aD",
          "date": "2024-06-03T16:51:51.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On the anniversary of the Social Security Act, let me be clear: I’ve pledged to always protect Social Security &amp; Medicare once I’m in the Senate. \n\nWhile Rick Scott wrote the plan to end Social Security &amp; Medicare, seniors can count on me to fight for their hard-earned benefits. https://t.co/Ef9uInCBZp",
          "date": "2024-08-14T15:20:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our coastal communities are being abandoned by insurance companies and are dealing with the dangerous effects of the climate crisis — and Rick Scott doesn’t care.\n\nI’m proud to receive the support of the @FlaDemEnvCaucus. Together, we’ll fight for Florida’s future. https://t.co/gTmtkvRfnA",
          "date": "2024-07-16T14:25:21.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@Jiffy_Jimmy @C_Hurl802 Jim, I’d love to talk more about the issues that you care about. I’m focusing on: protecting Medicare and social security, creating good paying jobs, lowering property insurance rates and protecting freedom of choice. Shouldn’t be a “party” election it’s an “issue” election.",
          "date": "2024-05-27T19:53:09.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you to the @FloridaLegion for hosting last night’s Candidate Forum. I’m proud to support our veterans, and will always fight for them in the Senate. https://t.co/e7m9TNujcz",
          "date": "2024-09-26T18:35:59.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "After losing my father to gun violence when I was 24, I dedicated my life to fighting for gun safety in our communities, both in Congress and through my work at @Giffords_org. \n\nIn the Senate, I’ll fight to keep our communities safe. https://t.co/MBgvaRoXya",
          "date": "2024-06-09T17:20:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Strong women standing up to breast cancer 💪\n\nWhen I was an Assoc. Dean at the FIU Medical School and in Congress, I worked to expand health care access. Thank you, @UMiamiHealth, for hosting the 24K Pink Luncheon. https://t.co/QObEWNHqzZ",
          "date": "2024-10-18T01:08:19.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Equal Pay Act was signed today in 1963, &amp; women are STILL making less than their male counterparts.\n\nIn Congress, I launched the 1st Latina Equal Pay forum to advocate for FL’s Hispanic communities. In the Senate, I’ll fight to pass the Paycheck Fairness Act to lift families https://t.co/kApuIVZlxn",
          "date": "2024-06-10T17:15:25.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "All around Florida, voters are fed up with Rick Scott and his extremist games in Washington. This campaign’s about the issues Floridians are facing — lowering skyrocketing insurance costs, safeguarding Social Security &amp; Medicare, &amp; protecting our freedoms. https://t.co/CgJPekDWKI",
          "date": "2024-05-06T14:36:41.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s time to put a stop to Floridians from being priced out of the state. In the Senate, I’ll make Floridians’ livelihoods a priority: \n\n✅Common sense solutions to lower costs\n✅Tackle the homeowners insurance crisis\n✅Expand the Child Tax Credit\n✅Create good paying jobs https://t.co/3SO99xkp6u",
          "date": "2024-05-21T01:01:23.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My story is Florida's story. I'm proof that the American Dream is possible, and I'll never stop fighting to preserve it for future generations. https://t.co/InBZtlyZos",
          "date": "2024-09-02T15:24:38.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Unions make us stronger, from our healthcare system to our schools to our public safety and more — but in FL they’re under attack. \n\nI’m thrilled to receive the support of @afscme, and in the Senate, I’ll always fight to protect workers’ rights. https://t.co/YI85fBdbj5",
          "date": "2024-08-03T16:01:29.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m running to fight for ALL Floridians. While Rick Scott gets richer and richer, Floridians are struggling. \n\nScott only won by 10,033 votes last time — we WILL close that gap and beat him in November. https://t.co/WKO70Zhslt https://t.co/qZXOjug44Z",
          "date": "2024-07-19T17:50:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m proud to have the support of our veterans. In Congress, I held those who defraud vets of their benefits accountable and fought for job + educational opportunities for them &amp; their families.\n\nVeterans should thrive in FL — I'll fight to make it happen. https://t.co/5sKNnXzFGs",
          "date": "2024-08-15T15:04:47.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As my mom's primary caretaker, I know what a critical lifeline Social Security and Medicare are for seniors.\n\nI'm honored to have @SSWorks alongside us in the fight to stand up for our seniors and unseat the man who wrote the plan to end Social Security &amp; Medicare. https://t.co/JzXMVsLHAe",
          "date": "2024-08-14T14:16:54.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you, @HCFLDems, for having me at the Kennedy King Gala. Justice is one of the pillars that binds us as Democrats — Floridians around the state can trust me to fight for our rights and protect the freedoms of ALL. https://t.co/gJBoNXRnMQ",
          "date": "2024-08-18T16:11:04.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Contact your insurance company — your policy should cover many of the costs to repair or replace damaged property. If your insurance cannot cover it, FEMA can step in to help fill the gap and support your recovery without affecting your premiums.",
          "date": "2024-09-28T13:50:11.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There’s nothing better than visiting with our seniors. This morning, I stopped by senior centers across Miami to discuss critical programs at stake in this election, like Social Security and Medicare.\n\nFL seniors can count on me to fight for them in the Senate. https://t.co/ccIEHLNEKF",
          "date": "2024-05-30T23:30:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "💵lowering every day costs\n🗳️safeguarding democracy &amp; freedom\n🏥access to reproductive health care\n🦺protecting workers’ rights\n🌎climate action\n\nWe’re fighting for a better future for Florida. Are you with us?",
          "date": "2024-05-26T18:35:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We’ve been in this race for a year now. Here’s what’s at stake:\n\n🛒rising costs\n⚖️democracy &amp; national security\n🏦social security &amp; medicare\n🏥reproductive freedom\n🌴climate protections\n🌎ending gun violence\n\nFloridians can count on me to fight for them in the Senate. https://t.co/FUY9hZetYh",
          "date": "2024-08-22T17:42:50.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Pollutant Controls",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our people-powered campaign is greater than Scott’s self-funded lies. Floridians want to protect:\n\n✅Social Security &amp; Medicare\n✅Reproductive freedom\n✅Democracy\n✅FL’s unique environment\n\nHelp us unseat the thief running for GOP Senate Leader. https://t.co/z8u7ajOPkH",
          "date": "2024-08-27T17:42:25.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m thrilled to have the endorsement of @VoteWaterFL! Rick Scott has put Florida’s environment at risk since his first day in politics.\n\nFL’s natural beauty is a driver of our economic prosperity &amp; tourism — I’ll always fight to protect it from Big Sugar and Scott. https://t.co/87Gekb2IW0",
          "date": "2024-09-23T18:12:42.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://www.wusf.org/politics-issues/2024-08-12/debbie-mucarsel-powell-economy-taxes-insurance-abortion-florida-primary-2024-us-senate",
          "tweet": null,
          "date": "August 12, 2024",
          "scraped_on": "2025-04-15 13:45:23"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There's no better place to celebrate National Fishing and Boating week than FL 🚣‍♀️\n\nIn Congress &amp; on the trail, I've met many Floridians like Captain Benson who are committed to protecting our diverse ecosystem. In the Senate, I'll fight for our coastal communities &amp; waterways. https://t.co/iu1b3bbNUY",
          "date": "2024-06-06T18:25:27.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hey FL, remember when they wanted to write us off?!\n\nThis fight is about protecting our freedoms and Florida's future. Let's do this! https://t.co/JiAgQAocKL",
          "date": "2024-09-24T22:54:12.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "So-called “leaders” like Scott and DeSantis have removed the words “climate change” from state records, but the effects of the crisis they’re ignoring are devastating Floridians before our eyes. https://t.co/UchGPPakxb",
          "date": "2024-07-01T20:19:30.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Had a great time with incredible supporters in Coral Gables! \n\nWhere seniors see their secure retirement, Rick Scott sees dollar signs. Florida’s home to millions of seniors, &amp; Scott wrote the plan to gut their Social Security and Medicare. \n\nThat’s not happening on my watch. https://t.co/SYHzECaF9n",
          "date": "2024-07-18T13:17:17.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This was a bipartisan bill to increase water pollution warnings to Floridians &amp; tourists. But conspiracy theorists like Ladapo don’t care!\n\nFamilies deserve to know when water is unsafe. Rick Scott started this mess, we’ll clean it up in November. https://t.co/jP3LbQPw8b",
          "date": "2024-06-27T23:03:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Panhandle is ready to fight for our rights!\n\nFloridians around the state are building the momentum we need to win this November. Our freedoms are on the ballot, and we’re going to protect them💪🗳️ https://t.co/fr2yzQeI1Y",
          "date": "2024-07-26T13:15:12.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Happy Citizenship Day to all who love this country and know the value of calling it home! The day I became a U.S. citizen is one I’ll never forget. I'm grateful for the opportunities and freedoms this country has given me – I'll always fight to protect it! https://t.co/NWjme0RMCx",
          "date": "2024-09-18T00:05:30.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Agriculture is one of Florida’s largest industries, so we have to protect our farmworkers — from stopping climate change to protecting workers’ rights. It was a great afternoon meeting with the agricultural community in Homestead. https://t.co/6oPsEbgzay",
          "date": "2024-08-04T22:11:10.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott &amp; DeSantis deny climate change, neglect workers in extreme heat, and want to destroy state parks in favor of golf courses. \n\nThis November, we have the opportunity to RETIRE Rick Scott and protect our environment from their senseless, extreme policies.",
          "date": "2024-08-26T17:26:09.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Welcome to Florida, @harrisonjaime! \n\nIt was a great Day of Action talking to voters with Fort Myers Democrats. Floridians know what’s at stake: lowering skyrocketing costs, protecting our freedoms, and safeguarding democracy. Let’s do this 💪 https://t.co/w5fhC0DJbY",
          "date": "2024-09-04T00:19:12.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "FL’s cruel bill banning local heat protections for outdoor workers is now in effect.\n\nOur workforce deserves to feel safe while at work in extreme conditions &amp; rising temps. They deserve shade, rest, &amp; water — basic human dignity our “leaders” are denying. https://t.co/7yS2manWes",
          "date": "2024-07-02T15:39:42.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "SARASOTA IS FIRED UP TO FIGHT FOR OUR FREEDOMS!\n\nWomen in Florida are in the fight of our lifetimes for our rights and democracy. We have 62 days left until Election Day, let's do this 💪 https://t.co/ezrHcECijX",
          "date": "2024-09-05T01:00:20.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott banned the words “climate change” from state records &amp; voted against $1.5 Billion in funding infrastructure prep for extreme weather. He can ignore the climate crisis all he wants, but it’s Floridians dealing with the consequences of a month's worth of rain in 3 days.",
          "date": "2024-06-15T14:22:09.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s no surprise that Red Tide Rick would put Big Sugar over our environmental protections. Florida deserves a Senator who will fight to protect our coastal communities and natural resources — not one who cozies up to the sugar lobby. https://t.co/672gAbnjFI",
          "date": "2024-06-21T17:43:24.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Here’s what’s on the ballot this November:\n\n🔵lowering outrageous insurance costs\n🔵deciding when you want to start a family\n🔵the Social Security &amp; Medicare FL seniors’ rely on\n🔵access to the ballot box\n🔵protecting our kids from gun violence\n\nAre you with us in this fight?",
          "date": "2024-05-06T16:06:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There’s no place for extremism in our political parties. I’ll listen to all Floridians, I’ll fight for all Floridians, and that’s why in just 4 days, we will push our state in a new direction. https://t.co/bDCC6VrKHt",
          "date": "2024-11-01T22:59:16.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida's got Style  🤩✨ There's nothing better than making friendship bracelets and protecting our democracy ahead of @taylorswift13’s show tonight in Miami! https://t.co/tTZdA6Bjua",
          "date": "2024-10-19T22:00:53.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "One positive thing the FL State Legislature got right is passing a bill that would ban the sale of dangerous Delta 8 products which causes health risks to young adults and teens. DeSantis vetoing such a critical bill is borderline criminal. DeSantis will have to face the https://t.co/Gtv3Zud45Z",
          "date": "2024-06-07T23:17:17.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Young Floridians are concerned about affordability, education, reproductive rights, gun safety, and our environment. They know Rick Scott is a disaster and leaving future generations with a mess. \n\nI’m glad to receive their support this election. https://t.co/Pc2KENIePg",
          "date": "2024-05-07T19:00:47.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Illegal/Undocumented Migrants",
      "stance": false,
      "desc": "Debbie Mucarsel-Powell advocates for comprehensive immigration reform and opposes mass deportation policies. She supports providing a pathway to citizenship for undocumented immigrants and has fought in Congress for Temporary Protected Status (TPS) for immigrants fleeing violence, poverty, and persecution. Mucarsel-Powell also emphasizes the need for bipartisan support and international cooperation to address the root causes of migration.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m tired of this BS! Extremists like Rick Scott and Tim Scott have voted against economic opportunity and sided with dictators and communists — and now they're claiming to care about socialism and communism?\n\nWe need real leaders who will fight for economic growth, not https://t.co/YCh6y436Zf",
          "date": "2024-05-23T16:49:56.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you, Senator @clairecmc. \n\nFloridians are tired of a guy who led the largest Medicare fraud scandal in U.S. history stripping us of our rights. We have Scott scared — and we're going to WIN on Election Day 💪 https://t.co/RrZuhhH1SG",
          "date": "2024-08-13T23:01:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://news.wgcu.org/2019-07-29/south-florida-lawmakers-make-case-for-tps-for-venezuelans",
          "tweet": null,
          "date": "July 29, 2019",
          "scraped_on": "2025-04-15 13:45:15"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The @Hispanic_Caucus is in the house! ASI ES! Latinos in FL are ready to show the country we reject attacks on our liberties and will protect freedom and democracy! Si se puede! https://t.co/9l6SS8FZ9b",
          "date": "2024-05-08T00:46:07.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A powerful read from my friend @MarieWoodsonFL.\n\nRick Scott represents nearly half of all Haitian Americans, but has abandoned the communities he’s meant to protect in favor of his extremist puppet master.  ​​https://t.co/a3NapsQKZk",
          "date": "2024-10-20T14:30:36.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Yesterday in Broward, we said NO MÁS. Dobbs opened the floodgates for extremist attacks on our fundamental freedoms — and Rick Scott celebrated millions of women losing their reproductive rights.\n\nWomen around FL will celebrate when we kick him out of office &amp; protect our rights. https://t.co/mxvYMXAzQ6",
          "date": "2024-06-25T13:11:36.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I met this young woman (a first-time voter!!) in Miramar, &amp; I’m honored to have received her support! \n\nYoung people around FL are sick of extremists like Rick Scott striping away their rights — they’re ready to fight back &amp; build a better future. Let’s make it happen! https://t.co/cMryjiOOER",
          "date": "2024-08-19T17:03:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@ScottforFlorida your insults aimed at nuestros hermanos en Puerto Rico are not funny. Thousands of Puerto Ricans have fought and died to protect this nation. The only thing that is trash is your lack of leadership in the Senate and unwillingness to stand up for the Puerto Rican https://t.co/hoFbZ50xCi",
          "date": "2024-10-27T22:41:59.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I had the honor of joining a group of veterans in Pensacola to talk about what’s at stake this election. Over 1.4 million vets in FL fought for our freedoms. They know what’s on the line in Nov, and won't vote for a no-show senator like Scott who will never put their needs first. https://t.co/SCfXwtBRQe",
          "date": "2024-07-12T16:26:14.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Let’s be totally clear about something: immigrants are not eating people’s pets. It’s scapegoating and slander by Donald Trump and Rick Scott.\n\nThey’re using the same violent language as Maduro and Ortega, and every immigrant in South Florida who understands what it means to live",
          "date": "2024-09-11T14:34:05.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Threats of mass deportation are DANGEROUS — &amp; will destroy our economy. In FL, anti-immigrant laws will result in a $12.6 BILLION negative impact to our economy. \n\nIn the Senate, I’ll lead in immigration reform, support small businesses, agricultural &amp; hospitality sectors, &amp; https://t.co/k4eHsXA60R",
          "date": "2024-06-02T20:35:21.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://states.aarp.org/florida/scott-mucarsel-powell-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 13:45:07"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Another major Florida outlet reminding Floridians that Rick Scott’s company, under his watch, committed the largest Medicare fraud in history. \n\nIn Latin America we call that “gobierno de ladrones.” Ya no más! https://t.co/CYbsCc4asb",
          "date": "2024-05-11T16:42:06.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I know a certain medicare thief we can unseat in November 👀 https://t.co/vTTrMR0yXJ",
          "date": "2024-09-09T23:31:41.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida’s led the nation in mass shootings two months in a row — &amp; DeSantis doesn’t care.\n\nThese programs are critical to combat the rise in gun violence and keeping our communities safe. This is proof that extremists on the right will always put the gun lobby before the lives of https://t.co/xegYcbqecZ",
          "date": "2024-06-14T00:50:29.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Community leaders like Rodney Jones are changing lives.\n\nToo often, our systems fail our children. He’s helping young people in Escambia find a better way than ending up in the prison system. https://t.co/AWVQv20rqh",
          "date": "2024-07-10T17:34:54.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As the only Latina running for Senate, this issue is a top priority for me. I urge our leaders to address the crisis at the border and protect legal pathways to citizenship for those seeking freedom and opportunity. https://t.co/lJQSSwq3gl",
          "date": "2024-05-08T22:21:10.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Haiti is facing a humanitarian crisis. The international community MUST come together and support Haitians who are fleeing from violence, starving, and hungry. https://t.co/iFf05cgoLe",
          "date": "2024-08-24T15:16:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This race is tied, and Team DMP has the momentum!! The state is mobilizing, and Floridians are FIRED UP and READY to fight for their rights. https://t.co/Db67XewRLZ",
          "date": "2024-09-11T16:11:04.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://floridaphoenix.com/2024/10/04/mucarsel-powell-calls-rick-scotts-reluctance-to-debate-a-dereliction-of-duty/",
          "tweet": null,
          "date": "October 4, 2024",
          "scraped_on": "2025-04-15 13:44:56"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "All eyes are on Florida. \n\nFloridians in every corner of the state have made it clear that they’re ready to fight back against extremists like Rick Scott and their attacks on our freedoms. https://t.co/DweIkVVAB3",
          "date": "2024-07-10T23:13:31.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Listen to @TizzyEnt!!! We CAN fight back against Republican extremists like Rick Scott, who continue to vote AGAINST our freedoms!! https://t.co/PiqP0Gtv7R",
          "date": "2024-09-19T00:38:23.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Venezuelans are living under a violent dictator who is trying to steal an election away from the will of the people. Venezuela has one of the highest murder rates in the world. That's why in Congress, I fought for TPS of immigrants to help keep families safe.\n\nTrump continues to",
          "date": "2024-07-19T16:25:59.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our coastal communities are being abandoned by insurance companies and are dealing with the dangerous effects of the climate crisis — and Rick Scott doesn’t care.\n\nI’m proud to receive the support of the @FlaDemEnvCaucus. Together, we’ll fight for Florida’s future. https://t.co/gTmtkvRfnA",
          "date": "2024-07-16T14:25:21.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott continues to spread propaganda vilifying Venezuelans fleeing Maduro's brutal socialist dictatorship — this is not leadership. This is dangerous. https://t.co/QUykymPvPh",
          "date": "2024-09-18T00:30:19.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Trump is now not only insulting Haitians, but Venezuelans who are stuck under a narco regime in that country. Scott is complicit, standing alongside a man who rants and insults every immigrant that’s made this country a home. https://t.co/VkLUYZaY9Z",
          "date": "2024-09-13T19:56:29.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The last thing Florida homeowners should worry about is the crippling cost of insurance when a devastating storm hits, but that’s the reality for so many. Rick Scott denies climate change, and created an insurance crisis that’s left Floridians exposed. https://t.co/l2Dp9odXC4",
          "date": "2024-09-30T20:27:11.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida is a bright purple state.\n\nWe will kick Rick Scott and his extremist agenda out of the Senate &amp; protect our rights.\n\nMy mother brought me to the U.S. to leave the authoritarian regimes that extremists like Scott idolize. I refuse to let that happen here in FL.",
          "date": "2024-06-24T12:49:58.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott banned the words “climate change” from state records &amp; voted against $1.5 Billion in funding infrastructure prep for extreme weather. He can ignore the climate crisis all he wants, but it’s Floridians dealing with the consequences of a month's worth of rain in 3 days.",
          "date": "2024-06-15T14:22:09.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott threatened our seniors' hard-earned Social Security &amp; Medicare, and Floridians like the 96-year-old man I met in Tampa today are fed up!! Florida is in play — in 32 days, let's make it happen! https://t.co/lG8AgRA6IG",
          "date": "2024-10-04T15:39:58.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We kicked off the fight for November with @seiufl to send a strong message: workers in Florida can ALWAYS count on me to protect their rights! \n\nIt’s past time Florida had a Senator who will actually fight for labor — not just ask for their endorsement. Let’s do this 💪 https://t.co/9MSlzpEowN",
          "date": "2024-08-21T19:26:40.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Scott &amp; Trump's mass deportation plan would be detrimental to Florida. Immigrants are the backbone of FL. Stripping people from their homes and families is WRONG, and only has negative impacts on your hard-earned benefits like Social Security &amp; Medicare. https://t.co/hBtjoPjfJx",
          "date": "2024-11-01T14:02:36.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott voted NO to secure our border. \n\nRick Scott voted NO to support Israel.\n\nRick Scott voted NO to hold the line against Russia.\n\nRick Scott poses a risk to our national security.",
          "date": "2024-09-01T14:54:55.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Congratulations, @gayforcongress! Now let’s unseat extremist Matt Gaetz in FL’s 1st District and protect our rights 💪 https://t.co/XnnB9Fdr2W",
          "date": "2024-08-21T23:30:23.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It takes a whole lot of shamelessness to pretend to care about hurricane preparedness when you literally voted against FEMA funding. Rick Scott's not fighting for Floridians in the Senate. #NoMás https://t.co/HIF3kcKMDO",
          "date": "2024-06-03T19:19:15.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today, I stand in solidarity with our Venezuelan brothers and sisters here in Florida who’ve fled socialist rule in search of freedom. As Venezuelans took to the polls today, we are united in our fight for democracy and justice. https://t.co/MmfaAxYF1K",
          "date": "2024-07-28T22:00:13.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "JD Vance spread a dangerous conspiracy theory about Haitian immigrants that led to children needing to be escorted to school for their safety, and Rick Scott STILL won't disavow it. This fear mongering isn’t leadership, it’s destroying a community. https://t.co/iktcQ9jefH",
          "date": "2024-10-02T02:20:43.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "If you’re excited about last night’s debate, remember — when Kamala Harris wins, she's going to need a strong Senate majority if we’re going to protect our rights.\n\nRick Scott would run a scorched-earth campaign if he’s Senate Majority Leader. We’ve gotta retire Rick Scott.",
          "date": "2024-09-11T21:42:02.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott is the headmaster of disinformation — parole programs are legal pathways to those escaping dictatorships and lower the number of illegal entries at the border. \n\nScott, want to debate me on this? Let’s do it in Spanish in Miami in front of the thousands of Cuban, https://t.co/b7IMJllQG2",
          "date": "2024-05-05T19:07:47.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "From the Panhandle to Key West, Floridians are feeling the energy and are ready to fight for a better future! https://t.co/BWpW4UzXpA",
          "date": "2024-08-19T20:50:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @SteveSchmidtSES: Finally, a Democratic star has risen in Florida: Debbie Mucarsel-Powell, the first South American-born immigrant elect…",
          "date": "2024-06-26T12:55:18.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott is making skyrocketing profits through major energy companies while they raise rates on YOU. While he uses that money to lie to Floridians, he’s laughing  and raking in those profits. https://t.co/wHI0dukSs9",
          "date": "2024-06-20T16:50:31.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Five years ago, a white supremacist with a gun targeted Latinos, killing 23 people and injuring dozens — leaving our Latino community scarred.\n\nHate and division have no place in America. We honor them today by continuing our work to end gun violence and racism that fueled this https://t.co/Dyt1SXWr7r",
          "date": "2024-08-03T14:33:27.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott is a fraud who lies any chance he gets and whose allies are behind Project 2025. Here are just a few things Scott has done against Floridians: \n\n❌Voted against border security\n❌Voted against our allies in their fight against Russia\n❌Refused to certify the election https://t.co/EVa6vZfik2",
          "date": "2024-07-21T20:05:30.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our brothers and sisters, Cuban Americans in Miami, are supporting me in this race! Si se puede!! https://t.co/4MWawexU9C",
          "date": "2024-10-31T21:59:55.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Venezuela's election will be one of the most important battles for democracy in the hemisphere. \n\nI have always fought for policies supporting our Venezuelan brothers &amp; sisters, not communist dictators. Democracy must always prevail. https://t.co/GXaBAbKKJo https://t.co/UT9V07KD5V",
          "date": "2024-07-05T14:58:35.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "FL GOP extremists are using a commission created to protect our civil rights to waste taxpayer money attacking private businesses. Floridians are struggling to afford to live — maybe lawmakers should focus on that. https://t.co/rcE21r8OQm",
          "date": "2024-05-29T00:00:03.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida’s already seeing record heat temperatures and yet DeSantis refuses to protect outdoor workers with basic necessities like shade, rest, and water. This cruel law will greatly affect Hispanic workers. There’s no justice in this. https://t.co/7ZNroAvMTV",
          "date": "2024-05-10T23:34:29.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Donald Trump invokes fear and racism to scare Americans. His gross, racist lies about Haitian immigrants who have made the US a home are shameful.\n\nRick Scott represents the Haitian diaspora while supporting this man. He’s disgusting.",
          "date": "2024-09-11T01:35:04.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott’s terrified to debate me because he knows hardworking Floridians support our message to protect freedom over his extremist policies and lies.\n\nIf you’re ready to fight for our rights, join me at https://t.co/SEjNvvtjF7. https://t.co/YzyBOjfwMu",
          "date": "2024-09-13T17:05:55.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Election Integrity",
      "stance": true,
      "desc": "Debbie Mucarsel-Powell does not provide a detailed stance on Election Integrity in this text. She discusses voting rights, protecting democracy, and passing the John Lewis Voting Rights Act as key policy proposals, but her views on Election Integrity specifically are not explicitly stated.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My family is constantly sending each other news and memes on WhatsApp, and I know we’re not alone. Now, we’re reaching voters where they are, including WhatsApp!\n\nLatinos are READY to protect our freedoms and fight back against disinformation! https://t.co/ydnf1UJ0Rq",
          "date": "2024-09-06T19:14:53.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida is in play and we're ready to protect our freedoms!! https://t.co/d5G3RZGCIj",
          "date": "2024-09-04T16:24:38.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There’s nothing more powerful than community. \n\nIt was an honor to visit the Islamic Center of Greater Miami and discuss what’s at stake this election, from protecting our freedoms to lowering skyrocketing costs. We must all be united against discrimination and hate, and in our https://t.co/ACqGstV5rW",
          "date": "2024-08-02T23:12:46.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In 2008 and 2012, I volunteered for President @BarackObama’s campaign. Now, I’m honored to have his support to become Florida’s next U.S. Senator. This election is about Florida’s future, and I’m ready to fight for it. Si se puede! https://t.co/ZgvENskVAp",
          "date": "2024-10-04T11:04:50.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m full of energy because all around the state, Republicans, Independents, and Democrats all say they're supporting our campaign. If you're one of those voters, thank you!  Let's get this done!! https://t.co/fhJtpoCuKV",
          "date": "2024-10-30T12:01:01.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "All around the state, people are tired of extremism and hate. Republicans, Independents, and Democrats are supporting me in this race because they’re ready for change. https://t.co/PKvB6EJw7t",
          "date": "2024-10-31T01:17:15.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Tampa is ready to fight for our freedoms!💪\n\nAll around Florida, people are fed up with Rick Scott and his extremist policies. They’re fired up to send him packing and flip a critical Senate-seat blue to protect our rights. https://t.co/UKCX0rGvcg",
          "date": "2024-06-19T00:54:44.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I worked as an Assoc. Dean of the FIU Medical School for years, so I know a thing or two about university administration — and what we’re seeing from corrupt politicians who weasel their way into FL’s higher education system is alarming. 🧵",
          "date": "2024-08-17T18:17:03.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Dear Floridians: \n\nEnough with the frauds and the politics that divide us because of our beliefs, culture, gender, diversity or background. \n\nWe are ONE Florida united to fight against extremism but unified to work FOR the people. \n\nYes we can. Si se puede. Let’s goooo💪🏼",
          "date": "2024-06-27T16:36:50.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There's an energy in Florida like we've never seen before, and we're ready to deliver the Senate majority. We'll sleep after Election Day 😉💪 https://t.co/R3lrXLREDZ",
          "date": "2024-10-31T17:11:36.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s time to put an end to extremists’ attacks on our democracy. After November when we hold the Senate majority, we WILL pass the John Lewis Voting Rights Act. Thank you, @EricHolder and @SusieLeeNV for visiting Florida — let’s do this! https://t.co/6JlTjdohH1",
          "date": "2024-10-01T22:29:48.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "While we're facing dangerous attacks on democracy, a rise in voter suppression, &amp; the undermining our right to vote, I think of an incredible friend and civil rights leader who never gave up. When I get to the senate the first thing we’ll pass is the John Lewis Voting Rights Act. https://t.co/uf6VykKDRN",
          "date": "2024-06-09T14:56:41.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Tallahassee Mayor @JohnDaileyTLH has been a dedicated public servant his entire career, and a champion of Tallahassee. I’m proud to have his endorsement, together we’re going to protect Floridians’ voting rights and advocate for Florida families. https://t.co/GQQ9jcQkbO",
          "date": "2024-09-13T15:17:58.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Republicans always tell me they’re done with Rick Scott’s extreme policies and are supporting me in this campaign. Glad to have them on Team DMP! https://t.co/rhBBQlsBcF",
          "date": "2024-09-09T22:15:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "WE’RE NOT GOING BACK!! \n\nAnother stop on our 75 stop tour to make it clear to Rick Scott: Floridians are ready to fight for our future and flip the Senate seat!! https://t.co/xN6GvszOpU",
          "date": "2024-09-07T18:45:17.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "One year ago today, we launched our campaign for Senate — and this week, I became the Democratic nominee!\n\nWe’re going to spend the next 74 days doing everything possible to defeat Rick Scott, fight for our rights, and elect the first Latina from FL to the Senate. Let’s do this. https://t.co/hb6n9t3JY1",
          "date": "2024-08-22T14:24:56.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott has shown us how dangerous he is, he will always put his extremist agenda over democracy. We owe it to Floridians to protect their voices this election, and that starts by voting Scott out of the Senate. https://t.co/JozfAsLe7N",
          "date": "2024-10-17T22:55:02.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Diversity, Equity, Inclusion",
      "stance": true,
      "desc": "Debbie Mucarsel-Powell supports diversity, equity, and inclusion, highlighting the importance of unity against discrimination, economic growth from immigrant communities, and celebrating the contributions of AAPI small business owners and leaders. She advocates for supporting underrepresented groups, including Haitian Americans and Latino-owned businesses, to create a more inclusive society.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There’s nothing more powerful than community. \n\nIt was an honor to visit the Islamic Center of Greater Miami and discuss what’s at stake this election, from protecting our freedoms to lowering skyrocketing costs. We must all be united against discrimination and hate, and in our https://t.co/ACqGstV5rW",
          "date": "2024-08-02T23:12:46.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This rhetoric &amp; agenda are dangerous &amp; will incite further violence against immigrants. Immigrants bring diversity &amp; economic growth to our communities. I’ll work with anyone who has the courage to support legal pathways for Dreamers &amp; immigration reform. https://t.co/t4if4IJkpE",
          "date": "2024-07-21T16:35:11.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This rhetoric is DANGEROUS and outright racist!!! We must support the Haitian American community. Does @ScottforFlorida support this within his own party? https://t.co/nqdlFL1ooY",
          "date": "2024-09-26T12:58:33.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m thrilled to have the support of @mayordean! You’re a history and change-maker, and we’re going to continue to move South Florida forward as we protect our economic opportunities and rights. https://t.co/sXlgH55BuL",
          "date": "2024-09-13T15:17:59.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our AAPI community here in Florida is vast and diverse. As we close out AAPI Heritage Month, let’s celebrate our AAPI small business owners, educators, law enforcement and more for their contributions and culture, and honor their rich histories. https://t.co/cxjgKjsYV9",
          "date": "2024-05-31T22:14:57.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The affordability crisis in Florida is hitting all of us, especially small-businesses that are the hearts of our communities. \n\nI was proud to join @KathyCastorFL &amp; Tampa leaders to discuss the importance of investing in Latino-owned businesses to help our communities thrive. https://t.co/qSluYSNuoF",
          "date": "2024-06-18T21:12:17.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "What a great morning with @LevineCava and Reverend Reed as we joined the Purple Church to discuss their affordable housing project. These leaders are shaping our community, and I'm proud to stand alongside them as they create more housing options for Miami-Dade residents. https://t.co/NrTQWvpIMQ",
          "date": "2024-09-13T20:49:56.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "If history's taught us anything, it's that immigrants are capable of extraordinary things. Extremists like Rick Scott try to divide us because they know our unity is our strength. I'm honored to receive @LULAC's endorsement as we fight for democracy together. https://t.co/vTthpX9VXt",
          "date": "2024-10-24T22:20:24.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Renewable Energy",
      "stance": true,
      "desc": "Debbie Mucarsel-Powell supports expanding solar power to increase energy efficiency and reduce costs for Floridians. She prioritizes addressing climate change and protecting coastal communities from its effects. Her stance emphasizes the need for action on renewable energy to combat climate change.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We're on the FRONT LINES of climate change. It drives the destruction of our coastal communities and economy, and fuels the insurance crisis. DeSantis is finishing what Scott started when he was governor, and making sure our state doesn't stand a chance. https://t.co/CDHHJpl7UW",
          "date": "2024-05-16T17:19:49.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Floridians are facing extreme heat, and Rick Scott refuses to do anything about climate change’s impact while costs skyrocket for Floridians.\n \nIn the Senate, I’ll push to expand solar power and lower costs for Floridians’ electricity bills.",
          "date": "2024-05-26T15:02:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The @miamiherald knows I’ve been a champion for South Florida, and will continue to fight for our freedoms, economy, and environment around the state. https://t.co/kOU2eYuNlr",
          "date": "2024-10-23T17:09:21.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://floridaphoenix.com/2024/10/04/mucarsel-powell-calls-rick-scotts-reluctance-to-debate-a-dereliction-of-duty/",
          "tweet": null,
          "date": "October 4, 2024",
          "scraped_on": "2025-04-15 13:44:56"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communities on the Gulf just saw two major storms in two weeks — lives are forever changed. We have to protect our coastal communities, and that means tackling climate change &amp; investing in climate resiliency. https://t.co/gXKsExNR7O",
          "date": "2024-10-11T14:46:06.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you for joining us on the tour, @KathyCastorFL &amp; @LindsayCrossFL! When we VOTE, we WIN!!!\n\n🗳 Vote to lower sky rocketing insurance costs\n\n🗳 Vote to fight for climate action\n\n🗳 Vote for climate resiliency\n\n🗳 Vote for Florida’s future https://t.co/40iuaD4g4X",
          "date": "2024-10-15T19:35:12.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Project 2025 will worsen our climate crisis by eliminating any efforts to reduce carbon emissions. Scott has investments w/ Big Oil companies lobbying for the same proposals because federal regulations “hurt” their business.\n\nNever mind the communities hurting from the climate",
          "date": "2024-07-09T17:02:33.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Medicare Expansion",
      "stance": true,
      "desc": "Debbie Mucarsel-Powell supports expanding Medicare coverage, having previously introduced a bill to achieve this goal during the COVID-19 pandemic.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Medicare Open Enrollment period starts TODAY!! Enroll today before slippery Scott tries to take your Medicare away! https://t.co/Mdh5F6z7Yf",
          "date": "2024-10-15T20:33:31.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "What’s happening in Lee county is electric and it indicates the shift we have been seeing in Florida. Red and Blue Florida is all in to retire Rick Scott! Hands off our Medicare!!! https://t.co/3Sh9KvdC2p",
          "date": "2024-09-04T12:15:23.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://states.aarp.org/florida/scott-mucarsel-powell-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 13:45:07"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rick Scott has always attacked Medicare — he committed the largest Medicare fraud scandal in history, &amp; refused to expand Medicaid to 1.4 million uninsured Floridians.\n\nOn the anniversary of Medicare, I want to make it clear: I'll always protect Medicare from thieves like Scott.",
          "date": "2024-07-30T20:51:23.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kicked off our 75 stop tour — one for every time Rick Scott pled the fifth during the largest Medicare fraud scandal in US history.\n\nSo proud to be in the fight to lower costs and protect our rights with @DonnaShalala, Comm'r Higgins and  hardworking Floridians across the state. https://t.co/bBpOpde0Fv",
          "date": "2024-08-29T01:00:09.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Transgender Rights",
      "stance": true,
      "desc": "Debbie Mucarsel-Powell supports the LGBTQ+ community and advocates for equality, promising to pass the Equality Act in the Senate to protect fundamental freedoms. She emphasizes her commitment to fighting for the rights of Florida's LGBTQ community against extremism and transphobia.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you, @lgbtqdems! We’re building a movement of Floridians who are ready to put a stop to extremists’ attacks on our rights. Love is love, and when I get to the Senate, I'll make sure we pass the Equality Act to protect fundamental freedoms.\n\nTogether, we’ll WIN THIS 💪 https://t.co/bJCimkC9iy",
          "date": "2024-07-24T15:08:27.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The first Pride was a riot.\n\n55 years ago, brave Americans at Stonewall dared to fight for their rights. Today, throughout Pride Month, and every day, we celebrate those who risked it all for their rights. In the Senate, I’ll always fight for the LGBTQ+ community.",
          "date": "2024-06-28T20:21:08.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Dreamers are Americans just like any of us. It's time to provide a legal pathway, and for Congress to have the courage to act and pass immigration reform. https://t.co/Oib4qsaQmo",
          "date": "2024-06-15T17:55:47.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Love is love! But no surprise that small-minded and hateful senators like Scott and Rubio can’t recognize pride and love when they see it. To Florida's LGBTQ community: we see you — and I promise when I’m in the Senate, I will fight for equality for ALL. https://t.co/l6Vk7TK7hw",
          "date": "2024-06-15T22:09:00.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Happy Pride! Pride Month is about loudly and proudly celebrating the resilience of the LGBTQ+ community. As extremists in Florida attack our rights, I’ll always fight for the rights of LGBTQ+ Floridians.🌈 https://t.co/Yzb6mkm9zk",
          "date": "2024-06-01T13:27:34.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On International Day Against Homophobia, Transphobia, and Biphobia, let us remind our LGBTQ+ friends &amp; loved ones: we see you, and we will fight with you. In the Senate, I will proudly and loudly support the LGBTQ+ community and their freedoms.",
          "date": "2024-05-17T22:53:24.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Limits on Prescription Drug Prices",
      "stance": true,
      "desc": "Debbie Mucarsel-Powell supports taking steps to limit the price of prescription drugs. She aims to create an environment that encourages competition among pharmaceutical companies, allowing them to reduce prices and increase access to affordable medications. Her plan includes exploring policies such as re-importing generic or lower-priced versions of drugs from other countries.",
      "sources": [
        {
          "type": "Other",
          "url": "https://states.aarp.org/florida/scott-mucarsel-powell-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 13:45:07"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The debilitating insurance crisis we’re facing started under Rick Scott, giving millions to his campaign donors at the expense of Floridians.\n\nIn the Senate, I’ll fight to lower skyrocketing costs on day one. https://t.co/xFjev9NGaJ",
          "date": "2024-07-21T14:00:59.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It's always great to see friends in the Florida Keys.\n\nIn Congress, I fought for this community, and I’ll do the same in the Senate to lower the exorbitant costs that Floridians are struggling with every day and protect our coastal communities from the climate crisis. https://t.co/aDBOSCDyBA",
          "date": "2024-06-03T00:01:02.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Other",
          "url": "https://www.wusf.org/politics-issues/2024-08-12/debbie-mucarsel-powell-economy-taxes-insurance-abortion-florida-primary-2024-us-senate",
          "tweet": null,
          "date": "August 12, 2024",
          "scraped_on": "2025-04-15 13:45:23"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Floridians are struggling with rising everyday costs — especially at the gas pump. In the Senate, I’ll support the Price Gouging Prevention Act to crack down on Big Oil. https://t.co/g6g8BMTbPy",
          "date": "2024-07-03T21:46:17.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Doctors should not have to live in fear of prison for doing their jobs. Patients should not have to live in fear of losing their lives because they’re refused the care they need. https://t.co/m0gNvPAmrW",
          "date": "2024-06-24T12:49:56.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Floridians should not be paying 3x the national average on their home insurance.\n\nPeople shouldn’t have to choose between leaving the state or forgoing insurance to afford a home.\n\nIn the Senate, I’ll fight to lower the skyrocketing costs that started under Rick Scott.",
          "date": "2024-06-09T20:05:02.000Z",
          "scraped_on": "2025-03-29 03:15:32"
        }
      ]
    },
    {
      "issue": "Balancing the Budget",
      "stance": true,
      "desc": "Debbie Mucarsel-Powell supports balancing the budget by reducing government spending, addressing national debt, and ensuring that Social Security payments keep pace with inflation. She aims to protect seniors from rising inflation while promoting fiscal responsibility. By getting government spending under control, she hopes to bolster Social Security and safeguard it for future generations. Her stance emphasizes the importance of matching Social Security payments to inflation rates.",
      "sources": [
        {
          "type": "Other",
          "url": "https://states.aarp.org/florida/scott-mucarsel-powell-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 13:45:07"
        }
      ]
    },
    {
      "issue": "Progressive Taxation",
      "stance": false,
      "desc": "Debbie Mucarsel-Powell does not explicitly state her stance on progressive taxation. However, based on her opposition to increasing the top tax rate for individuals making over $400,000, it can be inferred that she may be against or has reservations about progressive taxation.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.wusf.org/politics-issues/2024-08-12/debbie-mucarsel-powell-economy-taxes-insurance-abortion-florida-primary-2024-us-senate",
          "tweet": null,
          "date": "August 12, 2024",
          "scraped_on": "2025-04-15 13:45:23"
        }
      ]
    }
  ]
}