{
  "candidate": "Jacky Rosen",
  "positions": [
    {
      "issue": "Public Healthcare",
      "stance": true,
      "desc": "This text appears to be a collection of quotes and statements from Jacky Rosen, an American politician who served as the senior United States Senator from Nevada from 2019 to 2021. The topics covered in this text include:\n\n* Social Security benefits\n* Medicare benefits\n* Veterans' issues\n* Economic issues (e.g., affordable housing, lowering costs)\n* Healthcare issues (e.g., protecting access to healthcare, reducing costs)\n\nSome key points that can be taken away from this text are:\n\n* Jacky Rosen is committed to protecting and strengthening Social Security benefits for future generations.\n* She believes in improving Medicare by ensuring it continues to provide critical health coverage for older Americans without being weakened.\n* Rosen prioritizes supporting veterans, including making military retirement pay tax-free.\n* She aims to address economic issues such as affordable housing and lowering costs, particularly for Nevada families.\n* As a senator, she is dedicated to fighting for better healthcare options and reducing costs.\n\nOverall, the tone of this text suggests that Jacky Rosen is a strong advocate for protecting and improving social safety nets, supporting veterans, and addressing economic challenges affecting Nevada families.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Whether it’s bringing a new VA hospital to Northern Nevada or expanding health care for veterans exposed to toxic burn pits, I’m working hard in the Senate to deliver for those who served our country. https://t.co/RC0qtDNk8u",
          "date": "2024-09-27T21:11:47.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Growing the middle class means investing in job training. I’ve fought to secure funding to support apprenticeship and technical skills programs – and I’ll continue to work with both parties to expand opportunities for all hardworking Nevadans.",
          "date": "2024-08-30T17:47:15.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "High housing and rent costs are putting a major strain on hardworking Nevadans’ budgets. I’m fighting to bring relief by:\n\n➡️ cracking down on price gouging by corporate investors\n➡️ making more land available for affordable housing in Nevada\n➡️ pushing for lower interest rates",
          "date": "2024-07-09T21:52:59.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I will always work to:\n✅ Protect our seniors\n✅ Defend abortion rights\n✅ Expand access to health care\n\nMy opponent’s record shows he will:\n❌ Gut Medicare &amp; Social Security\n❌ Ban abortion\n❌ Repeal the Affordable Care Act\n\nThis is what’s at stake in the Nevada Senate race.",
          "date": "2024-06-13T19:03:08.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When I first ran for Senate, I promised to always do what’s right for Nevada.\n\nThat’s why I’ve fought to pass bipartisan laws that rebuild our infrastructure, protect our veterans &amp; increase funding for border security.\n\nI don’t work for anyone in Washington. I work for Nevada. https://t.co/V6qHRRgcRI",
          "date": "2024-08-19T21:16:54.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Gov Website",
          "url": "https://www.rosen.senate.gov",
          "tweet": null,
          "date": "2025-04-28 01:43:28",
          "scraped_on": "2025-04-28 01:43:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I took on the big drug companies to cap the cost of insulin at $35/month for seniors and give Medicare the power to negotiate prescription drug prices – and I won. I’ll never stop fighting to lower costs for hardworking Nevadans.",
          "date": "2024-10-16T20:21:38.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m proud to accept the endorsement of @NCPSSM. I’m the only candidate in this race that Nevada seniors can count on to protect their earned Social Security and Medicare benefits – I’ll always stand up to MAGA extremists’ attacks on these lifelines. https://t.co/ijXy2o05RU",
          "date": "2024-10-31T00:01:02.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On National First Responders Day, I want to thank those who protect and serve our communities. From securing funding for new equipment for Nevada firefighters to rebuilding the fire station in Storey County, I’ll always work to support our first responders.",
          "date": "2024-10-28T18:58:57.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevadans deserve to retire with dignity.\n\nThat’s why I’ll always fight to protect the hard-earned Social Security and Medicare benefits that so many older Nevadans rely on to make ends meet.",
          "date": "2024-08-28T23:24:47.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "From increasing affordable housing opportunities, to protecting public lands, to  supporting veterans, I'm focused on continuing to deliver on the issues that matter most to Northern Nevadans.\n\nRead more:\nhttps://t.co/fGqeLSZIdS",
          "date": "2024-06-08T01:39:44.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@CortezMasto @KamalaHarris You’re exactly right, Catherine. Nevada’s elections are the closest in the country and we need every Nevadan to vote between now and November 5th so we can defend my Senate seat and keep making progress for our state.",
          "date": "2024-10-23T22:55:57.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Grateful to have the endorsement of @VoteVets for my reelection.\n\nFrom securing the first-ever dedicated Veterans Business Outreach Center in Nevada to helping pass the bipartisan PACT Act to expand health care for toxic-exposed veterans, I’ll always support our nation’s heroes. https://t.co/uDD02NtV3e",
          "date": "2024-08-06T23:12:15.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I grew up in a working-class family and was the first in my family to graduate college.\n\nNow, I’m fighting for Nevada every day in the Senate, and when I win this election I’ll keep delivering progress for hardworking families. https://t.co/Wfo6BJWlB2",
          "date": "2024-10-24T19:15:10.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m proud to be endorsed by the hardworking men and women of @IUBAC Mountain West. The bricklayers, craftworkers, and skilled tradespeople you represent across our state are building Nevada’s future, and I’ll always fight for you in the Senate. https://t.co/qhHxPnWtg4",
          "date": "2024-06-19T22:15:32.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "From advanced skills-training and apprenticeship programs to community college or a four-year college degree, I’m fighting hard to make sure every higher education option is accessible for Nevadans.",
          "date": "2024-09-22T17:12:24.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Grateful to Mayor Nathan Robertson for his partnership over the years and his endorsement across party lines for my reelection.\n\nI’m proud of the work we’ve done for rural communities like Ely, and I promise to keep fighting and delivering for all of Nevada in the Senate.",
          "date": "2024-09-16T19:16:00.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The work that Laborers’ Union Local 169 is doing to reach voters WILL make a difference in Washoe County and winning this critical battleground race. Together, we’re fighting for a future where all hardworking Nevadans can thrive – and our ground game is second to none. https://t.co/ffv8bTXaOp",
          "date": "2024-11-03T17:24:38.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The cost of buying a house or affording rent has gotten out of control. I’m taking action by standing up to corporate housing investors who jack up prices, working to cut taxes for first-time homebuyers, and pushing to open up federal land to build more affordable housing.",
          "date": "2024-10-18T02:16:50.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "From capping insulin at $35 a month to cracking down on price gouging by Big Oil, I’m fighting to build an economy that lowers costs for the middle class and gives everyone the opportunity to succeed.",
          "date": "2024-08-25T19:17:55.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s important for workers to have the skills they need to succeed – even if they don’t go to college or decide to change careers. That’s why I’m working across the aisle to expand job training and apprenticeship programs that will prepare Nevadans to get good-paying jobs.",
          "date": "2024-08-17T22:05:19.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown’s plan to eliminate the Dept. of Education would eliminate federal funding for Pell Grants, community college, career and technical education, and more.\n\nI know how important these programs are for Nevada students, and I’ll always fight to protect them.",
          "date": "2024-09-30T18:46:56.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Los nevadenses merecen un retiro digno.\n\nEs por eso que yo siempre lucharé por proteger el Seguro Social y Medicare, beneficios que nuestros adultos mayores se han ganado a base de trabajo duro y que les ayuda a solventar sus gastos mensuales. https://t.co/kK5HFMHfEO",
          "date": "2024-09-04T19:34:11.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We need to stop Big Oil CEOs from raising prices at the pump while raking in record profits at the expense of our hardworking families. I’m fighting every day to lower costs for Nevadans and hold corporate special interests accountable.\n\nhttps://t.co/vubTWPx2oE",
          "date": "2024-06-06T00:20:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Social Security and Medicare allow our seniors to retire with dignity and peace of mind.\n\nI’ve always worked to support Nevada’s seniors, and I’ll never stop pushing back against the extreme politicians in Washington who want to gut funding for these crucial programs. https://t.co/AsMjG17L2j",
          "date": "2024-08-21T17:16:05.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rising prices are stretching families’ budgets to the breaking point – that’s why I’m working to build more affordable housing, stop price gouging at the gas pump, and lower costs for everyday essentials.",
          "date": "2024-06-24T00:22:55.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown is running for Senate to please Donald Trump and force their Project 2025 agenda on Nevada.\n\nI’m running for reelection to lower costs and keep fighting for our hardworking Nevada families.",
          "date": "2024-09-23T22:16:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I'll always fight for hardworking Nevada families like yours in the Senate. Sam Brown would sell you out to his billionaire donors the first chance he gets. https://t.co/0URFDQjDFo",
          "date": "2024-11-01T15:27:45.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ve secured millions of dollars in funding for police departments to address staffing shortages, improve training practices, and upgrade equipment – I’ll always support Nevada law enforcement officers in the Senate.",
          "date": "2024-07-13T17:47:45.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Job training and apprenticeships are crucial in preparing workers for the 21st-century economy. I’m securing funding to expand these programs and ensure Nevadans can thrive even if they don’t go to college or change their careers.",
          "date": "2024-09-17T00:13:13.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Hoover Dam is a testament to the power of investing in infrastructure to grow the economy while creating jobs – and its construction began on this day in 1930.\n\nI’ll continue fighting to secure funding for public projects that make Nevada’s future stronger.",
          "date": "2024-07-07T23:09:42.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I took on powerful drug companies to cap the cost of insulin at $35 a month and allow Medicare to negotiate lower drug prices – and I won.\n\nI’ll never back down when it comes to fighting for lower costs for Nevadans. https://t.co/yZrSvreZ37",
          "date": "2024-06-20T20:45:24.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was great to meet with hundreds of hardworking @Culinary226 members today alongside Las Vegas’ own @jimmykimmel. Culinary workers are fighting tirelessly to make sure that one job is enough for the people who make our 24/7 economy possible. https://t.co/9w1SWQXxbX",
          "date": "2024-10-22T00:39:52.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m forever grateful to our nation’s veterans and will always support them in the Senate.\n\nToday, @CaptMarkKelly and I joined NV veterans to hear their concerns and talk about the work we’re doing to expand health care and economic opportunity for these heroes and their families. https://t.co/KLdF86xpDr",
          "date": "2024-06-28T23:04:41.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you for having me @RSChamberNV! I’m working hard in the Senate to support our Northern Nevada business community, and the Reno + Sparks Chamber has always been an incredible partner. I’m pushing for policies that will cut bureaucratic red tape, expand opportunities for… https://t.co/jW9NHBcYfb https://t.co/6bEBvkFhGc",
          "date": "2024-08-28T20:12:26.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I took care of my parents and in-laws as they got older and had health problems, so I understand the challenges our seniors and caregivers face.\n\nI’m fighting to lower costs and provide more support for NV’s seniors and caregivers because they deserve an advocate in the Senate.",
          "date": "2024-05-31T20:40:25.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I am committed to fighting for pro-worker policies in the Senate. \n\nOne job should be enough for hardworking Nevadans to earn fair pay, secure good benefits, and retire with dignity.",
          "date": "2024-09-01T22:58:22.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevada housing should be affordable for Nevada families.\n\nWatch my new ad on how I'm working to get it done: https://t.co/NBsleu21d5",
          "date": "2024-05-21T19:21:57.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Republicans are pummeling my campaign with attacks, and now Fox News is calling me \"extreme\" for supporting affordable health care and fighting to reduce gun violence.\n\nI'll always do what's right for Nevada, but I can't win this race alone. Please donate:\nhttps://t.co/ZlCPqVNaXl",
          "date": "2024-10-29T18:57:20.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevada families like Cindy’s deserve a Senator who’s fighting to give them some breathing room.\n\nOur campaign is investing in talking directly to Filipino voters about the cost of living issues that matter most right now. https://t.co/fk26G1m0TW",
          "date": "2024-10-10T17:32:56.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Grateful to my good friend and colleague @ReverendWarnock for joining me on the campaign trail in Las Vegas yesterday! Together we will defend the Senate and keep working to lower costs and expand opportunity for hardworking families. https://t.co/GCmbV5thhB",
          "date": "2024-10-06T17:23:53.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nowhere else I'd rather be after last night's debate than in the house of labor! Thank you to everyone who came out to talk about the work we're doing to deliver good paying-union jobs, lower costs, and protect Social Security and Medicare. https://t.co/lFRaj7AZMV",
          "date": "2024-10-18T22:04:44.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ll work with anyone from either party to support job training and boost our economy in Nevada. For Nevadans, I’m always going to work hard, because our state deserves it.",
          "date": "2024-06-03T18:37:00.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The outcome of Nevada’s Senate race will dictate our country’s path for decades to come.\n\nI’m fighting for hardworking Nevada families. Together, we will build a better future for our children. Are you with me?",
          "date": "2024-07-19T18:20:12.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Bringing a new VA hospital to Reno is crucial for Northern Nevada veterans. I’m fighting in the Senate to ensure our veterans get the quality health care they have earned.",
          "date": "2024-05-10T16:53:56.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On my birthday this year, I’m filled with gratitude – for my family, health, and for the incredible team supporting my campaign.\n\nMy birthday wish is that you’ll join our growing team working to defend Nevada by signing up below. Thank you! 💜",
          "date": "2024-08-02T18:11:30.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A “roadmap for a better America.”\n\nThat’s what my MAGA opponent called an extreme plan that included phasing out Social Security and Medicare in just five years.\n\nMake no mistake – I will always stand strong to protect Social Security and Medicare benefits for our seniors.",
          "date": "2024-07-31T22:45:32.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This #NationalPoliceWeek, I’m grateful for Nevada law enforcement officers who put their lives on the line every day to protect our communities. \n\nI’ll keep fighting in the Senate to make sure these brave officers have the resources they need to keep Nevadans safe.",
          "date": "2024-05-14T00:36:07.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ll always fight to protect and strengthen the Affordable Care Act – so that Nevadans like Margie will never have to worry about being denied coverage or discriminated against because of a pre-existing condition. https://t.co/ug59pbbgJw",
          "date": "2024-08-20T00:16:27.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Social Security and Medicare allow our seniors to retire with dignity, and I am committed to upholding and protecting those rights. \n\nNevadans – believe the words Sam Brown has said. Voting for him is not worth the risk. https://t.co/pQ2tHzw1eA",
          "date": "2024-10-30T22:12:39.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ve helped secure funding for a new training center for Las Vegas law enforcement, mental health initiatives for Reno and Henderson police officers, and crucial technology for police departments across the state.\n\nI'll always fight to deliver for Nevada law enforcement.",
          "date": "2024-08-07T17:54:30.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I was proud to help pass the PACT Act to support veterans exposed to toxic burn pits and expand health care for thousands of veterans in our state. It’s our responsibility to provide quality care to those who served, and I’m fighting for our veterans every day. https://t.co/QlOWJCGPRL",
          "date": "2024-10-18T03:01:26.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hi, I’m Jacky, and I’m fighting for hardworking Nevada families. https://t.co/t7LadcWjmI https://t.co/BOW6vbPFjK",
          "date": "2024-06-20T22:55:57.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Small business owners like Magnolia are the backbone of our state. I’m working to cut red tape and expand opportunities for our entrepreneurs, so that Nevada small businesses can thrive. https://t.co/MHY85HN9Lf",
          "date": "2024-08-26T22:03:20.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevadans want to defend reproductive freedom, lower the cost of everyday essentials, and protect hard-earned Social Security benefits for our seniors.\n\nSupporters like Gerrie know that I’m fighting hard every day in the Senate for the issues they care about. https://t.co/xyKK6a2NMJ",
          "date": "2024-08-05T16:46:33.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "60 years ago, the Civil Rights Act delivered critical protections against legalized discrimination for marginalized communities.\n\nWe’ve come too far in the fight for full equality and justice to let MAGA extremists take us backwards.",
          "date": "2024-07-02T20:37:50.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I put myself through community college and worked as a banquet waitress on the weekends so I could pay my bills and make ends meet.\n\nI’m fighting for hardworking Nevadans to get ahead because I understand the challenges they’re facing. https://t.co/9RpBzdo2g2",
          "date": "2024-07-10T20:54:42.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On the anniversary of Social Security becoming law, here’s a reminder that my opponent Sam Brown said he “admires” an extreme plan that would phase out the program in just 5 years.\n\nI’ll always fight to protect the hard-earned benefits that Nevadans rely on for their retirement.",
          "date": "2024-08-14T18:25:12.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ve always fought to protect Social Security, and I’ve worked hard in the Senate to ensure older Nevadans can retire with dignity and afford the health care and medications they need. I’m grateful to have the support of @SSWorks. https://t.co/AyWBAluX4H",
          "date": "2024-05-23T00:42:06.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Other",
          "url": "https://states.aarp.org/nevada/rosen-brown-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 13:50:59"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Driving Nevada’s unique economy forward is one of my priorities in the Senate. I’m fighting to continue bringing good-paying jobs to our state, cutting red tape for small businesses, and securing funding for infrastructure projects across Nevada.",
          "date": "2024-10-04T17:18:43.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was wonderful to stop by the MLK Senior Center in North Las Vegas.\n\nWhether it’s protecting Social Security and Medicare or capping the cost of insulin at $35/month for seniors, I’m fighting hard in the Senate to make sure that older Nevadans can retire with dignity. https://t.co/AwLRvwuErE",
          "date": "2024-10-01T01:18:42.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I'm proud to have the endorsement of the @LasVegasSun. In the Senate, I’ve been an independent voice for Nevada and worked across the aisle to deliver for hardworking Nevadans, and I look forward to continuing to fight for our state. https://t.co/GXMWyyoi7d",
          "date": "2024-10-22T16:05:17.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        }
      ]
    },
    {
      "issue": "Renewable Energy",
      "stance": true,
      "desc": "Chair of the Subcommittee on Tourism, Trade, and Export Promotion, Jacky Rosen has expressed her commitment to bolstering Nevada's booming clean energy economy, jumpstarting the state's future in solar and geothermal energy, and investing in projects that create jobs. She aims to protect public lands, promote clean energy, and support hardworking families while cutting red tape for small businesses.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Had an awesome meeting with workers at Reno’s Patagonia warehouse touring their facility and sharing my commitment to protecting our public lands, promoting clean energy, and supporting hardworking families. https://t.co/KCUl7eV8Hu",
          "date": "2024-10-25T23:36:26.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Gov Website",
          "url": "https://www.rosen.senate.gov",
          "tweet": null,
          "date": "2025-04-28 01:43:28",
          "scraped_on": "2025-04-28 01:43:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Black entrepreneurs are a key part of Nevada’s economic growth, and I’m committed to cutting red tape and expanding entrepreneurship opportunities to help small businesses thrive.\n\nIt was great to join @WillMcCurdyII and small business owners for brunch this morning! https://t.co/gSDNfzLoY6",
          "date": "2024-06-15T22:14:28.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My extreme MAGA opponent Sam Brown says clean energy projects are “not for the benefit of Nevadans.” \n\nHe couldn’t be more wrong.\n\nI’m working to jumpstart Nevada’s future in areas like solar and geothermal so that we can create good-paying jobs &amp; grow our clean energy economy.",
          "date": "2024-09-12T20:32:24.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "From extreme heat and drought to deadly wildfires – the climate crisis impacts Nevadans on a daily basis.\n\nI fought to ensure funding for clean energy projects, which are helping tackle climate change while creating thousands of good-paying jobs.",
          "date": "2024-05-19T17:03:35.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown has a reckless plan to abolish the Department of Energy.\n\nNevada is a leader in solar energy production, and I’m making sure that we continue investing in clean energy projects that create jobs.",
          "date": "2024-08-05T19:01:24.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        }
      ]
    },
    {
      "issue": "Limits on Prescription Drug Prices",
      "stance": true,
      "desc": "Jacky Rosen supports capping the cost of prescription drugs at $35/month for seniors and empowering Medicare to negotiate lower prices. She aims to make life more affordable for hardworking families, particularly those struggling with the high cost of insulin. Rosen also seeks to combat corporate price gouging in housing markets and promote pro-worker policies like paid family leave and equal pay for equal work.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m supporting a bipartisan bill to combat fentanyl because we have to do more to address this crisis. Providing our law enforcement the equipment and resources they need is critical to keeping our communities in Nevada safe.",
          "date": "2024-07-31T20:04:08.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My extreme opponent is on the wrong side of lowering prescription drug costs.\n\nI helped pass the new law capping the cost of insulin at $35 a month.\n\nSam Brown wants to repeal that law and take those savings away from thousands of Nevadans.",
          "date": "2024-07-29T22:58:45.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I took on powerful drug companies to cap the cost of insulin at $35 a month and allow Medicare to negotiate lower drug prices – and I won.\n\nI’ll never back down when it comes to fighting for lower costs for Nevadans. https://t.co/yZrSvreZ37",
          "date": "2024-06-20T20:45:24.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thanks to the historic law that I proudly helped pass two years ago, we’re lowering prescription drug costs for seniors, investing in clean energy and manufacturing, and creating thousands of good-paying jobs right here in Nevada.",
          "date": "2024-08-16T16:33:53.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Gov Website",
          "url": "https://www.rosen.senate.gov",
          "tweet": null,
          "date": "2025-04-28 01:43:28",
          "scraped_on": "2025-04-28 01:43:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hardworking Nevadans are being squeezed by rising costs on their everyday needs. I took on the big drug companies to lower prescription drug costs and I’m pushing back against corporate investors who drive up housing costs to make sure that our hardworking families can succeed.",
          "date": "2024-09-06T16:51:25.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I took on the big drug companies to cap the cost of insulin at $35/month for seniors and give Medicare the power to negotiate prescription drug prices – and I won. I’ll never stop fighting to lower costs for hardworking Nevadans.",
          "date": "2024-10-16T20:21:38.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevadans are being squeezed by rising costs on everyday essentials. From capping the cost of insulin at $35/month to standing up to price gouging by corporate housing investors, I’m hard at work to make life more affordable for hardworking families.",
          "date": "2024-09-16T21:22:05.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown supported an extreme plan to phase out Social Security and Medicare in just five years and called $35/month insulin a “big loss for the American people.”\n\nHe is a direct threat to the benefits that Nevada seniors rely on for their retirement. https://t.co/EKd3FwEYOT",
          "date": "2024-08-28T05:14:08.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our workers deserve leaders who will advocate for their jobs, their families, and their rights. That is why I’m supporting initiatives to fund apprenticeship programs, fight for a higher federal minimum wage, and guarantee paid leave.",
          "date": "2024-08-05T21:14:04.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m fighting to build on our progress and cap the cost of insulin and bring down prescription drug prices for every single American — because no one should have to worry about how they’re going to pay for their life-saving medications.",
          "date": "2024-09-20T18:02:54.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Other",
          "url": "https://states.aarp.org/nevada/rosen-brown-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 13:50:59"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "No parent should have to worry about whether they can afford life-saving medication for their diabetic child.\n\nI took on the big drug companies to cap the cost of insulin at $35/month because of families like Geoconda’s. Here’s her story: https://t.co/ESCvLHF2A4",
          "date": "2024-09-25T21:26:35.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We capped the cost of insulin at $35 a month for seniors and finally empowered Medicare to negotiate lower prescription drug prices – a historic investment that is bringing down costs for hardworking families.\n\nMy MAGA opponent called it “a big loss for the American people.”",
          "date": "2024-08-16T19:17:49.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m taking on corporate price gouging to provide relief for hardworking Nevada families in the checkout line and at the gas pump.\n\nNevadans are being squeezed by rising costs, and I’m working hard to make everyday essentials more affordable.",
          "date": "2024-08-02T16:52:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I took on the big drug companies to lower prescription drug costs, I’m holding corporate investors accountable for driving up housing costs, and I’m working across party lines to cut wasteful spending: https://t.co/ndGdiuXLfG",
          "date": "2024-07-17T01:05:54.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m proud of the work we’ve done to start lowering prescription drug prices, but there’s more to do to bring down costs for Nevadans.\n\nI’m taking on price gouging by big grocery store chains and corporate landlords because we can’t let special interests keep ripping us off. https://t.co/hMFBu54vmp",
          "date": "2024-10-15T16:38:08.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevadans are being squeezed by rising costs. I’m taking on price gouging at the gas pump and standing up to corporate investors who jack up housing prices — because hardworking families need some breathing room. https://t.co/C4XMxyuBnu",
          "date": "2024-10-18T02:06:33.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        }
      ]
    },
    {
      "issue": "Abortion",
      "stance": true,
      "desc": "I'd be happy to help you summarize this text!\n\nAfter reviewing the text, I can see that it's a collection of statements and positions held by a candidate ( likely Senator Catherine Cortez Masto) on various issues, including:\n\n1. **Reproductive rights**: The candidate strongly supports abortion rights and will continue to fight for women's reproductive freedom in the Senate.\n2. **Gun safety**: The candidate advocates for commonsense gun safety reforms, including banning bump stocks.\n3. **Medicare and Social Security**: The candidate is committed to protecting these programs and ensuring their continued funding.\n4. **Affordable healthcare**: The candidate supports expanding access to affordable healthcare, including lowering prescription drug costs.\n5. **Climate change**: Although not explicitly stated, the candidate mentions tackling climate change as part of their platform.\n\nOverall, this text presents a clear and consistent message from the candidate on various issues that are important to Nevadans.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Not only was my opponent caught on tape admitting he will vote against Question 6, he was spreading dangerous misinformation about Nevada’s abortion protection ballot measure. Nevada women can’t trust Sam Brown to support reproductive freedom.",
          "date": "2024-11-01T21:09:59.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I first ran for office to make a difference for hardworking families. I’ve fought to lower housing and prescription drug costs, to pass common sense gun safety reform, and to protect abortion rights. Now, I’m running for reelection to continue delivering progress for Nevada. https://t.co/sLTXSTIooT",
          "date": "2024-10-20T19:48:02.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My support for reproductive freedom is unbreakable.\n\nAs a pro-choice leader in the Senate, I’ll continue to represent Nevadans and fight for women’s rights like lives depend on it – because they do.",
          "date": "2024-07-22T21:19:54.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On DACA’s 12th anniversary, it's never been more clear that we need a bipartisan solution for DACA recipients who are stuck in limbo.\n\nNevada’s Dreamers deserve long-term security and peace of mind. America is their home, and I’ll never stop fighting for permanent protection.",
          "date": "2024-06-15T22:42:22.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s been 64 years since the FDA approved the birth control pill, but anti-abortion extremists are still trying to limit women’s access to basic health care like contraception.\n\nI will ALWAYS stand up for a woman’s right to make her own family planning decisions.",
          "date": "2024-05-09T17:21:23.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Unlike my extreme MAGA opponent Sam Brown, I stand for what Nevadans care about – from protecting reproductive rights to lowering the cost of prescription drugs.\n\nNevada voters know my record as an independent voice who puts NV first, and it’s why we’re going to win in November. https://t.co/M680csQFQe",
          "date": "2024-06-12T04:37:23.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @dscc: ✔️Jacky Rosen is fighting for Nevadans. https://t.co/0X2iRsW1VN",
          "date": "2024-10-19T21:50:55.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A national abortion ban would be devastating to women’s freedom in this country, especially in pro-choice states like Nevada.\n\nIn the Senate, you can ALWAYS count on me to fight for a woman’s right to make her own health care decisions.",
          "date": "2024-08-22T21:58:56.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you to @lasvegasfill for having me on your podcast to talk about what’s at stake in this election! Abortion access is on the ballot in Nevada, and I’ll always fight for our women’s right to choose. https://t.co/PmntqHAxil",
          "date": "2024-10-22T18:01:18.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Just $5 will make a world of difference in our fight to defeat MAGA extremism, defend Nevada, and keep delivering for hardworking families. Can you make a donation today?\n\nhttps://t.co/pd5G9SoNKw",
          "date": "2024-10-30T16:48:13.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My extreme opponent will lie to advance his political ambitions, but hardworking Nevadans know I’ve fought for our state – and always will. https://t.co/msKpXW14EN",
          "date": "2024-08-23T22:10:38.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This election is about choices.\n\nAnd in November, Nevada voters are going to choose lower prescription drug prices, tax cuts and lower costs for working families, and reproductive freedom over far-right MAGA extremism. https://t.co/MlsJBIWvbN",
          "date": "2024-08-13T17:04:47.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We are 1️⃣ month out from Election Day!\n\nThere's so much on the line this November - from reproductive rights to housing affordability. So please, spread the word on this important Nevada Senate race. https://t.co/L3wu6BH1kd",
          "date": "2024-10-05T17:26:58.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“A moral atrocity.”\n\nThat’s what the anti-abortion group where my extreme opponent Sam Brown served as local president said about abortion.\n\nHe is out of touch and too extreme for Nevada.",
          "date": "2024-08-17T18:11:18.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I believe we must protect Nevada's kids and communities from gun violence. Our leaders can't accept these mass shootings as just a fact of life or be unwilling to consider bipartisan solutions.\n\nNevada families deserve a Senator who fights for commonsense gun safety measures.",
          "date": "2024-09-08T19:07:50.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Here are the facts:\n\n➡️ Cook Political Report rates my race a Toss Up.\n➡️ My GOP opponent is a direct threat to reproductive freedom, Social Security and Medicare, and education funding.\n➡️ We need all hands on deck to win.\n\nShare if you’re on board to defend Nevada in November🗳️",
          "date": "2024-07-13T00:07:30.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On the anniversary of Social Security becoming law, here’s a reminder that my opponent Sam Brown said he “admires” an extreme plan that would phase out the program in just 5 years.\n\nI’ll always fight to protect the hard-earned benefits that Nevadans rely on for their retirement.",
          "date": "2024-08-14T18:25:12.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevada is a pro-choice state, and we’re going to keep it that way.\n\nThank you @alexismcgill and @PPact for joining me in defending reproductive freedom and keeping my opponent’s extreme anti-abortion agenda out of the Senate. https://t.co/55XA6XnOqF",
          "date": "2024-08-01T00:23:35.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My opponent is lying about his record to try to win an election, but we know the truth: he’s been trying to ban abortion for the past decade. \n\nWatch my latest ad, and visit https://t.co/xdhzjqpE9q to get the facts: https://t.co/FzmCiNHjrx",
          "date": "2024-10-22T16:52:25.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I just got an F rating from the NRA – and I’m proud.\n\nWhile my MAGA opponent says he's “not willing to consider” any middle ground on gun safety reform, I’ll keep supporting common sense efforts to reduce gun violence.\n\nI don't work for the gun lobby, I work for Nevada. https://t.co/7FPYvOblBE",
          "date": "2024-09-18T20:01:01.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The stakes of this election are high, and @barackobama said it best - we need to restore the reproductive freedoms women had for nearly 50 years before MAGA extremism overturned them.\n\nI’m voting yes on Question 6 and will vote to codify Roe v. Wade protections into federal law. https://t.co/OKSDvfxlF1",
          "date": "2024-10-21T17:28:35.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I will always work to:\n✅ Protect our seniors\n✅ Defend abortion rights\n✅ Expand access to health care\n\nMy opponent’s record shows he will:\n❌ Gut Medicare &amp; Social Security\n❌ Ban abortion\n❌ Repeal the Affordable Care Act\n\nThis is what’s at stake in the Nevada Senate race.",
          "date": "2024-06-13T19:03:08.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m fighting hard to restore the protections of Roe and pushing back against anti-abortion judges who want to ban abortion medications women have safely used for decades.\n\nAbortion access is about women’s freedom – and freedom is always worth fighting for.",
          "date": "2024-09-03T18:11:41.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My extreme, anti-abortion opponent keeps finding new ways to show Nevada voters he can't be trusted when it comes to reproductive freedom. Unlike Sam Brown, I'll be voting YES on Question 6.\n\nhttps://t.co/82SNy3RVV2",
          "date": "2024-09-04T18:27:01.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Loved welcoming the Reproductive Freedom Bus to Las Vegas today! I want to remind all Nevadans to vote FOR pro-choice leaders in November &amp; vote YES on the Reproductive Freedom Amendment to protect abortion rights in our State Constitution. https://t.co/2i3uQNOA7r",
          "date": "2024-10-16T22:22:45.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Is Nevada a pro-choice state? Can you drop your ballot into a slot machine? Find out the answer to these questions and more as @JimmyKimmel and I play Nevada True or False! ✅❌ https://t.co/Xr5A08jEre",
          "date": "2024-10-29T18:26:55.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There’s no other way to put it – winning Nevada is *crucial* to holding the Senate. I’m ready to defend my battleground seat, defeat MAGA extremism, and keep delivering for our state. https://t.co/hHvh376I8n",
          "date": "2024-07-11T19:07:12.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevada’s AANHPI community is an integral part of our state’s economy and culture. Thank you, Rozita, for your support – you can count on me to fight for AANHPI Nevadans in the Senate. https://t.co/S3rqz4odxG",
          "date": "2024-08-24T17:16:05.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "During National #WomensHealthWeek, we’re reminded of the disproportionate barriers that women face when it comes to health care access.\n\nI’ll never stop fighting in the Senate to address the maternal health crisis and to restore women’s reproductive rights.",
          "date": "2024-05-13T01:25:26.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The stories I hear from Nevadans plant the seeds of the legislation I fight for in the Senate.\n\nYou can always count on me – not only to listen, but to take action and get things done on the issues that matter. https://t.co/OJxJq4UK07",
          "date": "2024-08-13T22:14:14.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@BarackObama Jacky Rosen here.\n\nIf you want to help me protect abortion rights in Nevada, support working families, and defeat MAGA extremism, please, join me in this fight by pitching in to my campaign today: https://t.co/nyCgJbdhWM",
          "date": "2024-10-20T02:32:24.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Election Day is 100 days away.\n\nIn 100 days, the future of reproductive freedom, Social Security and Medicare, and affordable housing will be on the ballot.\n\nIn 100 days, we’re going to defend Nevada – together. https://t.co/NhzomD9Y3S",
          "date": "2024-07-28T19:39:10.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevadans deserve a senator who puts our hardworking families first.\n\nI’m working every day to lower costs, defend Medicare and Social Security, and protect reproductive freedom – and I’ll always stand up for Nevada families in the Senate.",
          "date": "2024-07-16T20:28:49.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I joined @emilyslist and @jessicamackler to discuss the threat that MAGA Republicans pose to abortion rights.\n\nReproductive freedom is on the ballot this year, and NV voters know that personal medical decisions should be made by a woman and her doctor – not extreme politicians. https://t.co/DGXUGrr80x",
          "date": "2024-08-08T21:07:20.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Had a wonderful time in Reno meeting with local Latino community leaders, elected officials, and small business owners.\n\nHearing your stories and answering your questions helps me understand how I can keep fighting for you in the Senate. https://t.co/09oSNn1fKH",
          "date": "2024-06-21T23:19:13.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevada families like Cindy’s deserve a Senator who’s fighting to give them some breathing room.\n\nOur campaign is investing in talking directly to Filipino voters about the cost of living issues that matter most right now. https://t.co/fk26G1m0TW",
          "date": "2024-10-10T17:32:56.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was a pleasure to join the members of @Culinary226. You had my back when I was a cocktail waitress at Caesars Palace, and now I have your back as your U.S. senator – you can count on me to fight for hardworking Nevadans and their families. https://t.co/Kr64O3g5Yx",
          "date": "2024-10-01T00:31:03.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In the two years since Roe was overturned, attacks on abortion rights from MAGA Republicans like my opponent have only intensified.\n\nNevadans can always count on me to fight for their reproductive freedom. https://t.co/pXRqZo262k",
          "date": "2024-06-24T17:28:54.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown thinks he can hide his decade-long anti-abortion history – but Nevadans aren’t buying it.\n\nNevada is a pro-choice state, and I’m proud to vote YES on Question 6 to enshrine abortion rights into our state constitution.",
          "date": "2024-09-27T22:49:08.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Abortion rights are officially on the November ballot in Nevada – and it’s time to make our voices heard.\n\nI’ll be voting YES on Question 6, the critical amendment to permanently protect reproductive freedom in our state constitution. Join me: https://t.co/6dL6vZHe14 #YesOn6NV https://t.co/FXWAi1CVYJ",
          "date": "2024-08-12T21:22:06.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Senate Republicans just blocked another vote on the Right to IVF Act today. My extreme MAGA opponent Sam Brown would join them in voting against protecting IVF and other assisted reproductive services.\n\nHe can’t be trusted to defend reproductive freedom.",
          "date": "2024-09-18T00:17:21.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Two years ago today, the Supreme Court overturned Roe v. Wade and gave my daughter fewer rights than I had at her age.\n\nWe need to elect pro-choice candidates in November so anti-abortion extremists don’t take us back even further.",
          "date": "2024-06-24T23:50:53.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "If you want to protect abortion rights in Nevada, support hardworking families, and defeat MAGA extremism, then please join me in this fight and pitch in to my campaign right now:\n\nhttps://t.co/WRwjuISeKL",
          "date": "2024-11-02T00:02:45.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Medical decisions should be between a woman and her doctor, period. I’ll always fight for women’s freedom to make their own choices without interference from anti-abortion politicians like Sam Brown. https://t.co/X5QHbR5yn0",
          "date": "2024-10-22T22:03:21.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Gov Website",
          "url": "https://www.rosen.senate.gov",
          "tweet": null,
          "date": "2025-04-28 01:43:28",
          "scraped_on": "2025-04-28 01:43:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m fighting to restore protections nationwide for abortion rights – because women’s lives depend on it. MAGA Republicans have no business interfering in personal health care decisions. https://t.co/03l1pa3gUx",
          "date": "2024-09-30T21:55:40.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "While my opponent Sam Brown served as the local president of an organization that opposes marriage equality and supports legislation discriminating against same-sex couples, I proudly stand with the LGBTQ+ community in the fight for full equality for all Nevadans.",
          "date": "2024-10-07T20:28:33.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m honored to have the endorsement of @LULAC Adelante PAC, representing one of our country’s oldest Latino civil rights organizations. I’m fighting to uplift hardworking Latino families by lowering costs, expanding opportunity, and defending our fundamental freedoms. https://t.co/kpqgynEH9l",
          "date": "2024-10-31T18:58:55.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @dscc: Must watch debate answer from Jacky Rosen: “He has a decade-long record of saying he's against any exceptions on abortion even in…",
          "date": "2024-10-19T21:50:30.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was wonderful to join @GwenWalz, Jennifer Garner, and so many other champions for reproductive freedom in Reno. Our daughters have fewer rights than we did – we won’t let extreme MAGA Republicans keep attacking abortion rights. https://t.co/d3sGqz9zf1 https://t.co/jpoBgjxg4f",
          "date": "2024-10-19T21:29:24.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I will be voting YES on Question 6 to protect abortion rights in Nevada – my extreme MAGA opponent can’t say the same. Our state can’t trust Sam Brown on reproductive freedom.",
          "date": "2024-09-25T23:19:02.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Mi oponente Sam Brown apoya la anulación de Roe v Wade, una decisión de la Corte Suprema, que ha sido devastadora para la libertad reproductiva de las mujeres. Si llega a ser elegido, él seguirá apoyando las restricciones extremas del aborto. No podemos dejar que esto suceda!",
          "date": "2024-08-09T23:10:29.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“Non-negotiable.”\n\nThat’s how my MAGA opponent described his extreme opposition to abortion rights.\n\nNevada is one of the most pro-choice states in the nation, and I’ll always fight for reproductive freedom.",
          "date": "2024-08-15T22:41:45.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Winning Nevada is crucial to defending our pro-choice Democratic Senate majority. Can you chip in to help protect women’s freedom across the country?\n\nhttps://t.co/UJHL0306MN",
          "date": "2024-06-24T18:04:12.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Election Day is just 2 months away, folks! \n\nWe have just ✌️ months to defeat MAGA extremism in Nevada and defend the Senate. Can I count on you to help me beat my Trump-endorsed opponent, protect abortion rights, and keep fighting for working families?",
          "date": "2024-09-05T22:26:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevadans have experienced the devastation that bump stocks can inflict, and I’m committed to fighting for commonsense reforms that make our communities safer.\n\nThat’s why I’m calling for bipartisan action in the Senate to ban bump stocks once and for all.",
          "date": "2024-06-17T22:50:41.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is the horrifying reality created by extreme MAGA abortion bans – women are dying because life-saving medical procedures have become illegal.\n\nThese deaths are preventable. I’m fighting to restore the protections of Roe v. Wade so tragedies like this never happen again. https://t.co/vQ1XAUROim",
          "date": "2024-09-18T01:33:50.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My far-right opponent Sam Brown advocated for overturning Roe v. Wade – a Supreme Court decision that was devastating to women's reproductive freedom.\nIf elected, he would support MAGA abortion bans. We can’t let it happen.",
          "date": "2024-08-09T23:10:00.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A “roadmap for a better America.”\n\nThat’s what my MAGA opponent called an extreme plan that included phasing out Social Security and Medicare in just five years.\n\nMake no mistake – I will always stand strong to protect Social Security and Medicare benefits for our seniors.",
          "date": "2024-07-31T22:45:32.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "From more affordable housing and lower Rx drug costs to defending reproductive freedom, I’m fighting every day on the issues that matter most for hardworking Nevadans.\n\nThank you for your strong endorsement, President @BarackObama! It’s an honor to have your support. https://t.co/yoB7CFbMqk",
          "date": "2024-10-08T16:04:41.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our future depends on the Senate, and the Senate depends on what happens in battleground Nevada.\n\nI’ll always fight to protect Nevadans' reproductive freedoms and hard-earned benefits like Social Security and Medicare in the Senate. My extreme opponent won’t.",
          "date": "2024-07-25T00:50:19.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I have a proven record of supporting abortion rights – unlike the extreme MAGA Republicans in this race who want to roll back our rights even further. I’ll never stop fighting to protect a woman’s freedom to make her own health care decisions. https://t.co/FyzTYoGZdm",
          "date": "2024-06-07T17:20:04.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevadans want to defend reproductive freedom, lower the cost of everyday essentials, and protect hard-earned Social Security benefits for our seniors.\n\nSupporters like Gerrie know that I’m fighting hard every day in the Senate for the issues they care about. https://t.co/xyKK6a2NMJ",
          "date": "2024-08-05T16:46:33.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m taking on corporate investors who jack up housing costs — because hardworking Nevadans deserve the opportunity to afford a home. https://t.co/NK1Og6p1j0",
          "date": "2024-11-02T21:52:41.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Supreme Court's reckless decision to overturn the federal ban on dangerous bump stock devices is an assault on public safety.\n\nUnlike my extreme MAGA opponent, I’m going to keep working in the Senate to permanently ban bump stocks &amp; pass commonsense gun safety for Nevadans.",
          "date": "2024-06-14T21:04:42.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown is being bankrolled by the creators of Project 2025 – a plan that would eliminate the Dept. of Education, gut Medicare, and take away abortion rights.\n\nBrown will put MAGA extremism and Trump over what’s right for Nevada.",
          "date": "2024-09-24T23:09:08.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I joined @MSNBC to warn voters about Sam Brown’s extreme, decade-long anti-choice record and the threat he poses to reproductive rights in Nevada and nationwide.\n\nThanks for having me on to discuss this critical issue, @TheRevAl. https://t.co/qabb95MIB6",
          "date": "2024-10-28T19:58:58.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m proud to join so many powerful pro-choice advocates in the fight for reproductive freedom. Together, we will win in November and restore the protections of Roe v. Wade for women across the country. https://t.co/9rMi8nhkkk",
          "date": "2024-10-24T23:25:26.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Reproductive freedom is on the ballot on November 5th.\n\nI’m proud of my record fighting for Nevadans’ reproductive freedom and standing up against MAGA extremists like my opponent who want to take away reproductive rights.\n\nThank you @TammyDuckworth, @jessicamackler,… https://t.co/ouqAKMCYm3 https://t.co/QS7BF71D1U",
          "date": "2024-11-01T23:07:52.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m committed to defending the Affordable Care Act for people with pre-existing conditions, protecting Social Security &amp; Medicare for our seniors, and fighting for reproductive freedom for all women across the country.\n\nMy MAGA opponent Sam Brown simply does not share our values.",
          "date": "2024-08-02T22:51:30.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kyleigh is one of so many women who have been denied life-saving reproductive care since the overturning of Roe v. Wade in 2022. Her story is devastating and we can’t let this keep happening.\n\nWe MUST codify Roe v. Wade into federal law.\n\nhttps://t.co/dwTeIRdSlo",
          "date": "2024-08-13T19:03:56.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevada is a pro-choice state, and I’ve always fought for reproductive rights in the Senate. \n\nBut my opponent Sam Brown has a decade-long anti-abortion record.\nSee for yourself: https://t.co/kBEwHUVl4p",
          "date": "2024-06-13T23:00:18.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Senator @CaptMarkKelly has been a tireless advocate for reducing gun violence – and I was proud to work with him in the Senate to pass the first major new gun safety law in 30 years.\n\nWe joined a discussion with gun safety advocates in Nevada about the need for more commonsense… https://t.co/mobGvOEr8a https://t.co/DbcU4SEyTh",
          "date": "2024-06-28T16:56:28.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In November, we're going to vote to enshrine reproductive rights into our state constitution. Thank you to everyone who signed the petition to make this possible - let's get it done! https://t.co/vIszxNsDHo",
          "date": "2024-06-29T01:26:10.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "MAGA extremist Sam Brown supported a radical abortion ban that forced women like Valerie to flee their home states to get vital medical care. Now, he wants to bring his dangerous beliefs to Nevada. \n\nSam Brown is a direct threat to Nevada’s reproductive freedom. https://t.co/nqPO8W0xa4",
          "date": "2024-06-12T13:02:48.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "While Sam Brown pushes an extreme MAGA agenda that would hurt Nevadans, I’ve been working hard in the Senate to deliver for our state.\n\nFrom standing up for reproductive rights to lowering prescription drug costs and tackling climate change, I'll always do what’s best for Nevada.",
          "date": "2024-06-04T21:41:45.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you to the incredible pro-choice advocates who joined me for an important conversation about women’s health care and reproductive freedom.\n\nNevadans have a legacy of taking action to defend our personal freedoms, and we’re going to do it again this November by codifying… https://t.co/AYNIjViCsY https://t.co/xzJkFlPHR2",
          "date": "2024-08-29T22:18:55.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our rights are on the line this November, and my anti-choice opponent has a decade-long record of pushing to ban abortion without exceptions for rape or incest.\n\nRead more from @NevadaNOW Executive Director Sue Burtch:",
          "date": "2024-07-23T23:11:04.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m a proven fighter for reproductive rights. My opponent has a decade-long record of trying to take away abortion rights. The contrast couldn’t be clearer. https://t.co/7ucPwJQDyy",
          "date": "2024-10-30T00:20:04.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        }
      ]
    },
    {
      "issue": "Election Integrity",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@MurrayCampaign @KamalaHarris Thanks for the support, Senator Murray! Grateful to have you in this fight to win Nevada and defend our Senate majority in 2024.",
          "date": "2024-10-26T02:02:03.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you to the faith and community leaders at Wealthy Place Ministries for welcoming me to their Shepherd's Breakfast.\n\nTogether, we’ll work to uplift Nevada, fight to protect every eligible Nevadan’s right to vote, and make sure to have all hands on deck to get out the vote! https://t.co/iSBvPtgdyv",
          "date": "2024-10-30T23:21:30.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We’ve officially kicked off the general election here in NV. As we face constant attacks on our rights from the GOP, I'm as committed as ever to keep fighting to better this world. But it’s going to take all of us. Chip in now to become a founding donor:\nhttps://t.co/acY1FPGqPU",
          "date": "2024-06-12T04:17:18.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "What happens in Washoe County will be critical for 2024.\n\nHad a productive meeting with @WashoeDEMs leaders today – I’m grateful for your support and hard work to defend Nevada this November. https://t.co/96UniEEWlh",
          "date": "2024-05-30T00:36:27.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I had the pleasure of joining @DemWomenWashoe and some of the inspiring women running for office in Northern Nevada. We need all hands on deck to defend my Senate seat and win up and down the ballot, and I know that this team is up to the task! https://t.co/qfLu7sFdUk",
          "date": "2024-08-28T02:16:12.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "All eyes are on Nevada in the final 9 days, and the contrast between me and my extreme opponent couldn’t be clearer. \n\nWatch my interview on @MSNBC and then go to https://t.co/xGNOTEGibT to support my campaign. https://t.co/2fbNDyDcqG",
          "date": "2024-10-28T01:18:38.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Help me fight back against these attack ads and keep MAGA extremism out of Nevada by pitching in here: https://t.co/3zQ29IE4RC",
          "date": "2024-08-03T00:30:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Had a great evening with supporters at San Francisco Bay Restaurant as we head into this campaign's final week. Nevada's Latino community will be decisive in this election, and we’re putting in the work to make sure every voter knows I’m fighting for them in the Senate. https://t.co/ZOh7cawxK0",
          "date": "2024-10-30T03:53:09.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown is fighting to please one person: Donald Trump.\n\nI’m fighting to continue delivering bipartisan results for all Nevadans.",
          "date": "2024-09-21T17:25:04.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevada, tonight marks the start of the general election – and Team Rosen is ready to win this battleground Senate seat, defend our rights, and defeat MAGA extremism.\n\nLet’s do this! https://t.co/6D67tZzPqR",
          "date": "2024-06-12T02:06:01.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "With donations from all 17 counties in Nevada in Q3, we are building a powerful grassroots movement that will defend NV’s critical Senate seat against MAGA extremism &amp; reach swing voters across our state.\n\nTHANK YOU for your support – let’s keep up this momentum &amp; finish strong! https://t.co/7ogyClOKks",
          "date": "2024-10-10T02:48:11.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Voters have a clear choice this November between MAGA extremism and real solutions that will make life better for hardworking Nevadans.\n\nI’m proud to have people like Will on my team who understand the stakes of this election and are committed to defending Nevada. https://t.co/GR5ZK0BmGm",
          "date": "2024-07-10T02:00:14.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The general election begins one week from today in Nevada. We need to hit the ground running and I need your help to do just that. Can I count on you to chip in to defeat my extreme MAGA opponent, Sam Brown, and protect our Senate majority?\n\nhttps://t.co/OlZrNrsKO7",
          "date": "2024-06-04T23:08:09.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Folks – we don’t have time to waste. Chip in to my campaign today to defend this battleground Senate seat and stop my extreme MAGA opponent from taking our state backwards: https://t.co/SwDXfotwxS",
          "date": "2024-08-28T15:18:11.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Other",
          "url": "https://mynews4.com/news/local/interview-with-nevada-sen-jacky-rosen-on-trump-assassination-attempt-biden-as-nominee",
          "tweet": null,
          "date": "July 15, 2024",
          "scraped_on": "2025-04-15 13:50:48"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We are this 🤏 close to reaching our end-of-month goal.\n\nWith less than 24 hours before our deadline, #TeamRosen needs you to donate just $1 to keep the momentum of our grassroots, people-powered campaign to defend Nevada going!\n\nhttps://t.co/ruFmp3pnUJ",
          "date": "2024-05-31T22:45:40.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Just wrapped a great discussion with South Asian community leaders about the issues on their minds in this election, from supporting small businesses to protecting our democracy. With the support of the AANHPI community, we’re going to win this race. https://t.co/OoGDnYwJJO",
          "date": "2024-10-17T03:05:09.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you, Daryl! I appreciate your support, and I will continue working tirelessly to deliver nonpartisan solutions for Nevada and protect our democracy. https://t.co/T0Yqnh3SmD",
          "date": "2024-08-22T23:40:10.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Folks, your $5 donation today will directly help me defend my campaign against the latest frenzy of MAGA Republican attack ads against me. Donate here before my midnight deadline: https://t.co/WMwiuIGYVG",
          "date": "2024-08-31T21:00:01.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today is the last major FEC fundraising deadline before Election Day, and my team needs to see a surge of support so we can finish strong and win this battleground race to defend Nevada. Can you make a donation before we close the books tonight?\n\nhttps://t.co/5w9mAkZuzx",
          "date": "2024-10-16T23:24:41.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Donald Trump immediately attacked me when he took the stage at his rally in Las Vegas. He called me a \"terrible Senator\" and promised that if Republicans win in NV, they will \"win the whole thing.\"\n\nRush a $5 donation now to help us fight back and win NV:",
          "date": "2024-06-09T20:59:03.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@TheDemocrats November’s election is so important, and I’m fighting hard to defend Nevada’s Senate seat so we can keep delivering for hardworking Nevadans. Join the fight by giving us a follow and texting JACKY to 30508 💙",
          "date": "2024-08-20T23:25:40.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our campaign raised a record-breaking $7.6 million in Q2, including donations from over 33,000 first-time contributors! \n\nI’m grateful to have such a strong grassroots team across Nevada in this fight with me – together, we will win this race and defend the Senate in November.",
          "date": "2024-07-10T23:27:29.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The road to defending our Senate majority runs right through Nevada, and we’re mobilizing and organizing to reach every voter we can and win this race! https://t.co/rZWFv5NpPb",
          "date": "2024-10-21T20:08:28.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Tomorrow, my campaign has to file our last major FEC fundraising report before the general election.\n\nFriends, this is the most important benchmark of our campaign so far, and it’s a huge test of our team’s strength.\n\nPlease chip in today:\nhttps://t.co/ujQnn19wJ6",
          "date": "2024-05-22T02:00:00.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Here are the facts:\n\n➡️ Cook Political Report rates my race a Toss Up.\n➡️ My GOP opponent is a direct threat to reproductive freedom, Social Security and Medicare, and education funding.\n➡️ We need all hands on deck to win.\n\nShare if you’re on board to defend Nevada in November🗳️",
          "date": "2024-07-13T00:07:30.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Folks, the GOP is spending millions on attack ads against me, aiming to mislead undecided voters about my bipartisan record. Now, it’s more important than ever that we keep our ads up on the air. Chip in to help me defend the Senate:\nhttps://t.co/ujKE8rHaHK",
          "date": "2024-07-08T02:23:18.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you to everyone who was up bright and early to knock doors this morning. With your hard work, we’re going to defend our Senate seat and reelect @DallasHarrisNV @MichaelNaft @Duyfornv to keep delivering progress for Nevadans. https://t.co/XQEIZoct3a",
          "date": "2024-11-03T21:08:10.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We’re in the home stretch of this election, and the energy is unstoppable on Team Rosen. Let’s carry that momentum to win this thing! 💜 https://t.co/rm6rKTTQB0",
          "date": "2024-10-29T22:56:35.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "No bells and whistles, just a simple request: will you donate $5, $10, or whatever you can to help me defend my battleground Senate seat in November?\n\nhttps://t.co/Xz0J768QAo",
          "date": "2024-09-09T23:30:32.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        }
      ]
    },
    {
      "issue": "Diversity, Equity, Inclusion",
      "stance": true,
      "desc": "Senator Jacky Rosen supports increasing opportunities for underrepresented groups, including small businesses, students, veterans, AANHPI communities, LGBTQ+ individuals, and immigrant entrepreneurs. She aims to promote diversity, equity, and inclusion through policies such as expanding job creation, battery manufacturing, and economic diversification.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "AANHPI Nevadans will play a decisive role in this election.\n\nI’m proud to fight for our AANHPI communities in the Senate by working to increase opportunities for small businesses and students, stand up against hate, and deliver for our veterans. https://t.co/lkWvWBVCnL",
          "date": "2024-11-02T03:23:20.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Grateful to LGBTQ+ small business leaders in Reno for connecting with me to celebrate the progress we’ve made for equality and discuss their challenges for the future.\n\nI’ll keep fighting to make sure ALL Nevada entrepreneurs are included and have the opportunity to thrive. https://t.co/i8lf91Pzje",
          "date": "2024-08-29T23:15:07.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This #ImmigrantHeritageMonth, we honor the many contributions of Nevada’s immigrant communities who grow our economy and define our state’s character.\n\nI’m proud to represent such a diverse state and will always fight to make the American Dream attainable for immigrants in NV.",
          "date": "2024-06-02T18:31:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s the honor of my life to serve Nevada, and I’m proud to celebrate our state’s history, diversity, and beauty.\n\nHappy Nevada Day (real) to all who call the Battle Born State home! https://t.co/zrmON9iJOU",
          "date": "2024-10-31T23:20:38.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This election is about the future, and Nevadans know that I’m working with both parties to create new good-paying jobs, expand opportunities for our state like battery manufacturing, and diversify our economy. Watch my new ad: https://t.co/JwGRRHsqfu",
          "date": "2024-09-17T20:28:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On #Juneteenth, we honor the end of slavery in America. We celebrate the progress we’ve made, while recognizing the discrimination that still exists today. We have a lot more work to do, and I’m committed to working towards a more equitable future for our Black community.",
          "date": "2024-06-19T16:11:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you @Culinary226 and @SEIU1107 for always doing the hard work to level the playing field and expand opportunity for workers across Nevada. Great to meet with union members in Reno! https://t.co/bVBdx971LQ",
          "date": "2024-10-10T22:39:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        }
      ]
    },
    {
      "issue": "Border Patrol",
      "stance": true,
      "desc": "Jacky Rosen advocates for a bipartisan approach to border security, prioritizing the safety of law enforcement officers and communities over partisan politics. She aims to work across the aisle to provide necessary resources for Border Patrol agents to strengthen security at the border and keep Americans safe. Her focus is on finding solutions that protect DACA and TPS recipients while addressing immigration concerns.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This #NationalPoliceWeek, I’m grateful for Nevada law enforcement officers who put their lives on the line every day to protect our communities. \n\nI’ll keep fighting in the Senate to make sure these brave officers have the resources they need to keep Nevadans safe.",
          "date": "2024-05-14T00:36:07.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Folks, National Republicans just announced a MASSIVE $6.2 million TV ad buy to boost my far-right opponent. Winning in Nevada and defending our Senate majority will take everything we’ve got. Can you pitch in to help my campaign fend off these new attacks?\nhttps://t.co/fZ0yjymvUx",
          "date": "2024-10-24T20:23:19.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I joined hundreds of Nevadans at the @nvdems State Convention today who are fired up to reject MAGA extremism and defend our state in 2024.\n\nI’m so proud of the powerful team we’re building to keep Nevada blue and keep fighting for hardworking Nevadans! https://t.co/Bg6ySJCPG9",
          "date": "2024-05-18T23:23:40.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevada small businesses drive our economy forward, and I’ll always work across the aisle to help them succeed.\n\nThis National #SmallBusinessDay, I’m proud to be fighting for Nevadans like Magnolia from @TrufflesNBacon_ https://t.co/r6mTCN1LnE",
          "date": "2024-05-10T21:05:24.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m so grateful for the work that folks in Douglas County are doing to mobilize rural support and defend this Senate seat. With 11 days to go, we are fighting for every vote! https://t.co/P7vSXSvzbO",
          "date": "2024-10-26T00:44:07.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I joined hundreds of @WSCarpenters members and leaders in Las Vegas to talk about the work I’m doing to stand up for workers and their rights. The United Brotherhood of Carpenters does incredible work to build up our nation  – and I’m fighting for their jobs in the Senate. https://t.co/zECUa1gZIC",
          "date": "2024-10-26T22:36:32.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "While some play political games with our immigration system, I'm focused on working in a bipartisan way to help secure our border, fix our broken immigration system, and protect DACA and TPS recipients.",
          "date": "2024-07-18T00:34:44.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We need meaningful, bipartisan action to address the crisis at our border and fix our broken immigration system.\n\nI’ll work across the aisle to ensure our law enforcement officers have the resources they need to strengthen security at the border and keep our communities safe.",
          "date": "2024-05-23T19:12:28.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Election Day is 100 days away.\n\nIn 100 days, the future of reproductive freedom, Social Security and Medicare, and affordable housing will be on the ballot.\n\nIn 100 days, we’re going to defend Nevada – together. https://t.co/NhzomD9Y3S",
          "date": "2024-07-28T19:39:10.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        }
      ]
    },
    {
      "issue": "Illegal/Undocumented Migrants",
      "stance": false,
      "desc": "Jacky Rosen supports comprehensive immigration reform, including a path to citizenship for DACA and TPS recipients. She opposes policies that prioritize partisan politics over bipartisan solutions, citing the need for long-term security and peace of mind for Nevada's Dreamers. Rosen rejects MAGA extremism and Donald Trump's agenda, instead advocating for commonsense policies to fix the broken immigration system and expand opportunities for mixed-status families in Nevada.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In 100 days, we’re going to defend my Senate seat and reject MAGA extremism in NV. But battleground campaigns require a lot of resources, and every dollar makes a difference.\n\nWill you help us finish strong and donate $5 to my campaign today?\n\nhttps://t.co/AOAJdEs81Y",
          "date": "2024-07-29T02:36:59.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "While my far-right opponent prioritizes partisan politics and pleasing Donald Trump, I’ll always support commonsense policies that help us fix our broken immigration system and expand opportunities for the thousands of mixed-status families who call Nevada home. https://t.co/Y1eTf9R71i",
          "date": "2024-06-18T23:36:52.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "En este 12° aniversario de DACA, es claro que necesitamos una solución bipartidista para los beneficiarios que están atrapados en un limbo.\n\nLos Dreamers de Nevada merecen seguridad y tranquilidad. Estados Unidos es su hogar y nunca dejaré de luchar para conseguir una  solución… https://t.co/iFh49dF61Z",
          "date": "2024-06-15T22:42:40.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On DACA’s 12th anniversary, it's never been more clear that we need a bipartisan solution for DACA recipients who are stuck in limbo.\n\nNevada’s Dreamers deserve long-term security and peace of mind. America is their home, and I’ll never stop fighting for permanent protection.",
          "date": "2024-06-15T22:42:22.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We need meaningful, bipartisan action to address the crisis at our border and fix our broken immigration system.\n\nI’ll work across the aisle to ensure our law enforcement officers have the resources they need to strengthen security at the border and keep our communities safe.",
          "date": "2024-05-23T19:12:28.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In just 3 days, my extreme opponent and I will meet on the debate stage and Nevada voters will see a clear contrast between a bipartisan senator who’s fighting for hardworking families, and a MAGA extremist who’s only out to please Trump. https://t.co/uxPc8y4jAz",
          "date": "2024-10-15T00:13:21.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@brianschatz Thank you for having these important conversations. Together, we’ll continue fighting for Tribal communities across Nevada.",
          "date": "2024-09-19T02:05:12.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This #ImmigrantHeritageMonth, we honor the many contributions of Nevada’s immigrant communities who grow our economy and define our state’s character.\n\nI’m proud to represent such a diverse state and will always fight to make the American Dream attainable for immigrants in NV.",
          "date": "2024-06-02T18:31:51.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "No better way to kick off the day than by joining @VoteAlexisHill to send canvassers out to talk to voters! These volunteers are playing a key role in defending Nevada from MAGA extremists, and I’m grateful for their hard work and dedication. https://t.co/maaAvpUvTO",
          "date": "2024-10-25T20:45:13.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My opponent Sam Brown has publicly supported plans that could force disastrous cuts to Social Security and Medicare.\n\nNevadans deserve a senator who will fight to protect their hard earned benefits – not a MAGA extremist like Sam Brown.",
          "date": "2024-07-09T19:38:31.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown opposed the bipartisan border deal this year before the text was even released – because he’s just a rubber stamp for Donald Trump.\n\nWhile Brown uses immigration as a political football, I’m focused on real solutions to fix our broken immigration system.",
          "date": "2024-09-26T19:31:11.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Other",
          "url": "https://mynews4.com/news/local/interview-with-nevada-sen-jacky-rosen-on-trump-assassination-attempt-biden-as-nominee",
          "tweet": null,
          "date": "July 15, 2024",
          "scraped_on": "2025-04-15 13:50:48"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Mientras otros utilizan el sistema de inmigración como un juego político, yo me enfoco en trabajar de manera bipartidista para que nuestra frontera esté segura, en arreglar nuestro fallido sistema de inmigración y proteger a los beneficiarios de DACA y TPS.",
          "date": "2024-07-18T00:34:15.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "DACA allows thousands of Dreamers in Nevada to be part of our workforce, contribute to our economy, and be part of the state we all call home.\n\nTrump’s attempt to end this program 7 years ago is a stark reminder that we MUST come together to permanently protect Dreamers.",
          "date": "2024-09-05T16:33:14.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I joined hundreds of Nevadans at the @nvdems State Convention today who are fired up to reject MAGA extremism and defend our state in 2024.\n\nI’m so proud of the powerful team we’re building to keep Nevada blue and keep fighting for hardworking Nevadans! https://t.co/Bg6ySJCPG9",
          "date": "2024-05-18T23:23:40.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was a pleasure to join AFSCME @local4041 retirees to discuss the stark choice in this election between my record of fighting for good-paying jobs and my extreme MAGA opponent’s agenda to slash the benefits that hardworking Nevadans have earned. https://t.co/V1FKb6Waq7",
          "date": "2024-10-26T02:39:59.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m working to take on the dysfunction in Washington by cracking down on the influence of lobbyists, fixing our broken campaign finance system, and demanding more transparency and accountability from Congress.\n\nI’m fighting for reform because I don't work for anyone in Washington… https://t.co/AX7SVbtATF",
          "date": "2024-06-16T22:45:43.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My MAGA opponent has a lengthy record of supporting harmful plans that would ban abortion with no exceptions for rape or incest, gut Medicare and Social Security, and turn Nevada into a nuclear waste dump.\n\nI will fight for Nevadans – Sam Brown will not.",
          "date": "2024-07-06T22:21:39.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m fighting for reproductive freedom because our daughters shouldn’t have fewer rights than we did.\n\nWith strong supporters like Gerrie on our team, we’re going to fight like hell to stop MAGA extremists from taking us back even further. https://t.co/Emuj8BGb9K",
          "date": "2024-07-09T02:52:06.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "El programa de DACA permite que miles de Dreamers de Nevada formen parte de nuestra fuerza laboral, contribuyan a nuestra economía y que sean parte de nuestra comunidad.\n\nEl intento de Trump de terminar con el programa hace 7 años nos sirve como un crudo recordatorio para seguir… https://t.co/M8tOPhR8X8 https://t.co/Jcp8UdB0by",
          "date": "2024-09-05T16:33:52.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My MAGA opponent is being bankrolled by the same extremists behind Project 2025, and he supports radical policies that come straight from their far-right playbook.\n\nSam Brown’s MAGA agenda is dangerous and wrong for Nevada.",
          "date": "2024-08-22T19:39:31.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My extreme MAGA opponent Sam Brown is a threat to Social Security and Medicare, and we’re holding him accountable. Watch my latest ad: https://t.co/e4mUU2gBAC",
          "date": "2024-08-14T16:42:23.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @Culinary226: #NVSEN Debate: Former Culinary Union member, Senator Jacky @RosenforNevada, was a tipped worker who supports ending sub-mi…",
          "date": "2024-10-19T21:50:02.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We need a permanent solution for our broken immigration system that secures our borders and provides pathways to citizenship. I’m pushing my colleagues on both sides of the aisle to come to the table and find common ground on this critical issue.",
          "date": "2024-06-26T23:44:41.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown supports an extreme MAGA agenda that would hurt immigrant communities in Nevada.\n\nWhile he refuses to voice support for Dreamers, I’ll keep pushing for comprehensive immigration reform that includes a path to citizenship for DACA and TPS recipients.",
          "date": "2024-10-02T17:25:16.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        }
      ]
    },
    {
      "issue": "Gun Ownership",
      "stance": true,
      "desc": "Jacky Rosen supports commonsense gun safety measures and will continue to fight against gun violence to keep Nevada families and communities safe. She believes in protecting kids and communities from gun violence and advocates for leaders who can come together to pass meaningful gun safety legislation.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Keeping Nevada families and communities safe is one of my top priorities. I’ve pushed for commonsense gun safety measures in the Senate, and I will keep working to reduce gun violence as long as I’m in office. https://t.co/v2lneC5Cxy",
          "date": "2024-09-20T21:20:59.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Nevada is no stranger to the devastating impact of gun violence and mass shootings.\n\nI’m fighting for commonsense gun safety reform in the Senate, and that’s why it means so much to receive @brady_pac’s support. I won’t back down from working to keep our kids &amp; communities safe. https://t.co/6Tu5JrWYbB",
          "date": "2024-06-04T20:10:11.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@GabbyGiffords @KamalaHarris @Tim_Walz @KamalaForNevada Thank you for joining us in Nevada, Gabby! I’ll always fight against gun violence and do what’s right to help keep Nevada families and communities safe.",
          "date": "2024-09-19T02:06:36.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @YoungDemsNV: There’s only one candidate in the Nevada Senate race with a record of delivering gun safety legislation, investing in clea…",
          "date": "2024-06-11T21:56:42.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I believe we must protect Nevada's kids and communities from gun violence. Our leaders can't accept these mass shootings as just a fact of life or be unwilling to consider bipartisan solutions.\n\nNevada families deserve a Senator who fights for commonsense gun safety measures.",
          "date": "2024-09-08T19:07:50.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sam Brown said he was “unwilling to consider” any sort of middle ground on gun safety reform.\n\nEnough.\n\nWe need leaders who will come together to tackle gun violence and pass commonsense gun safety legislation. I’ll always work to protect our communities and families. https://t.co/eYrJ3LJ9ar",
          "date": "2024-09-06T23:10:10.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Two years ago today, I helped pass the Bipartisan Safer Communities Act — the most significant gun safety legislation in a generation.\n\nIt was an important step forward, but there’s still work to be done. I’ll continue fighting to keep Nevadans safe from gun violence.",
          "date": "2024-06-25T23:57:35.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I just got an F rating from the NRA – and I’m proud.\n\nWhile my MAGA opponent says he's “not willing to consider” any middle ground on gun safety reform, I’ll keep supporting common sense efforts to reduce gun violence.\n\nI don't work for the gun lobby, I work for Nevada. https://t.co/7FPYvOblBE",
          "date": "2024-09-18T20:01:01.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Senator @CaptMarkKelly has been a tireless advocate for reducing gun violence – and I was proud to work with him in the Senate to pass the first major new gun safety law in 30 years.\n\nWe joined a discussion with gun safety advocates in Nevada about the need for more commonsense… https://t.co/mobGvOEr8a https://t.co/DbcU4SEyTh",
          "date": "2024-06-28T16:56:28.000Z",
          "scraped_on": "2025-03-17 20:43:01"
        }
      ]
    }
  ]
}