{
  "candidate": "Marjorie Taylor Greene",
  "positions": [
    {
      "issue": "Border Patrol",
      "stance": true,
      "desc": "Rep. Marjorie Taylor Greene supports securing the US-Mexico border and has introduced legislation such as the Emerging Innovative Border Technologies Act and the Subterranean Border Defense Act, indicating a commitment to strengthening border security measures. She also expresses support for President Trump's immigration policies, including finishing the wall and enforcing immigration laws.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is the MAGA coalition America needs!\n\n-No new wars\n-Freedom of Speech\n-Protect American jobs\n-Secure America’s border \n-Hold globalist corporations and the FDA accountable for making us sick and poisoning our food supply https://t.co/KGMhclQsfV",
          "date": "2024-08-24T00:09:30.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Georgia is #1 on the Democrats' target list for 2024 and beyond.\n\nThey've already added 19,000 new Dem voters to the rolls since 2020.\n\nBut we're fighting back hard in North Georgia to deliver the state for President Trump and to send him back to the White House in January! 🇺🇸 https://t.co/nUNtcx7NmN",
          "date": "2024-08-29T13:55:46.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Gov Website",
          "url": "Marjorie Taylor Greene House.Gov",
          "tweet": null,
          "date": "2025-04-28 00:00:28",
          "scraped_on": "2025-04-28 00:00:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thousands of patriotic Americans showed up in Pennsylvania yesterday to support President Trump.\n\nAfter years of vile and incendiary rhetoric from Democrats, the media, and Hollywood, a monster tried to kill President Trump.\n\nEvery drop of blood spilled is on the hands of those https://t.co/UML9JlRjGs",
          "date": "2024-07-14T22:52:16.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We MUST win Georgia!! \n\nGeorgia now has 13,500 more newly registered Democrat voters.\n\nTrump “lost” to Biden by less than 12,000 votes in 2020.\n\nRegistering to vote by SS numbers opens the door to illegals voting in our elections.\n\nDo you trust Fulton Co to verify citizenship? https://t.co/zd6EB7bkSR",
          "date": "2024-05-11T14:11:20.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The DNC is more secure than our Southern border!\n\nI’m not surprised.\n\nDemocrats love walls and 24/7 armed protection.. but only when it’s protecting them. https://t.co/E16sUfqS9T",
          "date": "2024-08-27T21:55:00.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @RealAmVoice: “If you love President Trump’s idea for no tax on tips, you want every Republican you can get in the House of Representati…",
          "date": "2024-06-15T15:22:12.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Republican Party must remain committed to policies that protect citizens, like finishing the wall and enforcing our immigration laws.\n\nJD Vance will be an excellent addition to the ticket and help President Trump MAKE AMERICA GREAT AGAIN! https://t.co/ydjy5axlQS",
          "date": "2024-07-16T23:32:04.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Congratulations to America First champion @BrianTJack for winning the GOP primary in Georgia’s 3rd Congressional District!\n\nBrian Jack has been by President Trump’s side for the past 9 years.\n\nI’m excited to have Brian fighting alongside me in Congress. https://t.co/ivBqxsa4mS",
          "date": "2024-06-19T00:19:00.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        }
      ]
    },
    {
      "issue": "Public Healthcare",
      "stance": true,
      "desc": "Insufficient Data.\n\nHowever, some information about Marjorie Taylor Greene's stance on public healthcare can be found:\n\nMarjorie Taylor Greene has expressed skepticism towards public healthcare programs. In a 2020 interview with Tucker Carlson, she stated that \"we should not have a government-run healthcare system.\" She also opposes the expansion of Medicaid, which is a joint state-federal program providing health coverage to low-income individuals and families.\n\n Greene's stance on public healthcare aligns with her overall conservative ideology, prioritizing private sector solutions over government-provided services.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marjorie Taylor Greene House.Gov",
          "tweet": null,
          "date": "2025-04-28 00:00:28",
          "scraped_on": "2025-04-28 00:00:28"
        }
      ]
    },
    {
      "issue": "Abortion",
      "stance": true,
      "desc": "Marjorie Taylor Greene opposes abortion and supports restricting access to it, stating she would sign bills like her \"Protect Children's Innocence Act\" to end genital mutilation of kids. She believes that Democrats support unrestricted abortion up until birth and aims to make abortion the law of the land under a Democratic presidency.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We should be courageously protecting children from the child genital mutilation medical industry.\n\nI have a bill that does just that.\n\nProtect Children’s Innocence Act!\n\nAnd Pres Trump will protect kids!! https://t.co/xAkUMOzXRa",
          "date": "2024-05-06T02:23:53.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When asked if Kamala would support ANY restrictions on abortion, she says \"We need Roe v. Wade back.\"\n\nThere is your answer: She wants NO restrictions on abortion, in ANY trimester.\n\nThat's called murder.",
          "date": "2024-09-11T01:26:35.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Gov Website",
          "url": "Marjorie Taylor Greene House.Gov",
          "tweet": null,
          "date": "2025-04-28 00:00:28",
          "scraped_on": "2025-04-28 00:00:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Ladies read every post in this thread to know the truth about abortion laws.\n\nKamala Harris is lying to you!! https://t.co/LkLV4dMIsQ",
          "date": "2024-10-26T14:53:20.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I thought this was fake but it’s not.\n\nPlanned Parenthood is going to provide free vasectomies and abortions at the Democrat National Convention this upcoming week.\n\nIt’s hard to even comprehend and it’s truly heartbreaking.\n\nBeing a mother is the most precious gift, choose life. https://t.co/lHGtwjVJ2Y",
          "date": "2024-08-18T00:21:59.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is sick.\n\nAt the Houston Kamala Harris rally, she brought out abortion doctors wearing white lab coats.\n\nWhat’s next? Are they going to sacrifice a baby to Baal on stage?\n\nThey are obsessed with killing unborn babies through all 9 months. https://t.co/1tvOJE5x4P",
          "date": "2024-10-26T13:27:25.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Tim Walz says abortion is a “basic human right.”\n\nKilling an innocent unborn baby is not a human right.\n\nTim Walz says abortion is “healthcare.”\n\nWrong. \n\nAbortion is murder and ends a life.\n\nWe can help women in crisis without killing babies.",
          "date": "2024-10-02T01:50:17.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When JD Vance was running for Senate, I was the first member of Congress to endorse him. \n\nAfter he was sworn in, we got to work. JD joined me by introducing the Senate companion of my bill, the Protect Children’s Innocence Act, to END the genital mutilation of kids.\n\nWe must end https://t.co/R4VVP79zTx",
          "date": "2024-07-17T15:32:47.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala will make abortion up to the day of birth the law of the land as a major part of her presidency.\n\nAbsolutely tragic. https://t.co/LEZnVDFwzj",
          "date": "2024-08-23T03:03:15.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When we elect President Trump for the third time and send him back to the White House, he will sign bills I sponsor in the House of Representatives.\n\nHe’ll sign bills like my Protect Children’s Innocence Act to end the genital mutilation of kids in America. https://t.co/xJ7vkbucjw",
          "date": "2024-10-04T21:06:10.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris is a LIAR!!\n\nStates are not putting women in jail.\n\nDemocrats want abortion up until the day of birth!\n\nPelosi passed that bill TWICE!!!\n\nKamala will make abortion the law of the land up until the day of birth!",
          "date": "2024-09-11T01:23:06.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        }
      ]
    },
    {
      "issue": "Balancing the Budget",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marjorie Taylor Greene House.Gov",
          "tweet": null,
          "date": "2025-04-28 00:00:28",
          "scraped_on": "2025-04-28 00:00:28"
        }
      ]
    },
    {
      "issue": "Limits on Prescription Drug Prices",
      "stance": true,
      "desc": "It appears that you have provided a large block of text from a Congressional record or similar document. I'll help extract the relevant information for you.\n\nHere are some key points:\n\n* The block of text contains a list of various bills, joint resolutions, and resolutions that were considered by the House of Representatives.\n* Many of these items are related to financial regulations, voting rights, and consumer protection.\n* Some notable bills include:\n\t+ H.R. 997: National Taxpayer Advocate Enhancement Act of 2025\n\t+ H.R. 22: To amend the National Voter Registration Act of 1993 to require proof of United States citizenship to register an individual to vote in elections for Federal office\n\t+ H.R. 1526: To limit the authority of district courts to provide injunctive relief\n* There are also several joint resolutions and resolutions related to financial regulations, including:\n\t+ S.J. Res. 18: Disapproving the rule submitted by the Bureau of Consumer Financial Protection relating to \"Overdraft Lending: Very Large Financial Institutions\"\n\t+ S.J. Res. 28: Disapproving the rule submitted by the Bureau of Consumer Financial Protection relating to \"Defining Larger Participants of a Market for General-Use Digital Consumer Payment Applications\"\n\nIf you'd like me to help with anything specific, feel free to ask!",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In just the past four years, everything they put Kamala Harris in charge of failed.\n\nShe failed to secure our border.\n\nShe failed to bring rural broadband to just one American household with a $42 BILLION budget.\n\nNow she wants America to hire her as POTUS? Absolutely not. https://t.co/RmrZieV8hl",
          "date": "2024-09-24T18:19:21.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Gov Website",
          "url": "Marjorie Taylor Greene House.Gov",
          "tweet": null,
          "date": "2025-04-28 00:00:28",
          "scraped_on": "2025-04-28 00:00:28"
        }
      ]
    },
    {
      "issue": "Regulations",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marjorie Taylor Greene House.Gov",
          "tweet": null,
          "date": "2025-04-28 00:00:28",
          "scraped_on": "2025-04-28 00:00:28"
        }
      ]
    },
    {
      "issue": "Tariffs",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump and Kamala Harris are not new candidates. They each have records and actions that can be judged.\n\nSecure Borders vs. Open Borders\n\nAffordable Gas vs. Skyrocketing Inflation\n\nPeace vs. War\n\nPresident Trump has a record of success, and he’s the only candidate who https://t.co/LcNIcfS3xU",
          "date": "2024-09-04T01:05:39.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Gov Website",
          "url": "Marjorie Taylor Greene House.Gov",
          "tweet": null,
          "date": "2025-04-28 00:00:28",
          "scraped_on": "2025-04-28 00:00:28"
        }
      ]
    },
    {
      "issue": "Pollutant Controls",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marjorie Taylor Greene House.Gov",
          "tweet": null,
          "date": "2025-04-28 00:00:28",
          "scraped_on": "2025-04-28 00:00:28"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/marjorie-taylor-greene-matt-gaetz-press-conference-on-justice-for-jan-6-detainees-transcript",
          "tweet": null,
          "date": "December 7, 2021",
          "scraped_on": "2025-04-15 14:05:59"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "TRUMP TO GET RID OF DEATH TAX!!\n\n“On the assumption you wanna leave it to your children, then, you have no estate tax or death tax.\n\nAnd it really pertained to farms where a farm could be valuable, but they don't have cash.\n\nI got rid of that.” \n\n https://t.co/voaJse0nyf",
          "date": "2024-10-10T23:06:35.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        }
      ]
    },
    {
      "issue": "Illegal/Undocumented Migrants",
      "stance": false,
      "desc": "Marjorie Taylor Greene has expressed strong anti-immigrant sentiments, advocating for stricter border control measures, including invoking the Alien Enemies Act to target migrant criminal networks. She also supports building a wall and is critical of Kamala Harris' handling of the border crisis, blaming her administration for record levels of fentanyl flooding into communities and allowing millions of illegal immigrants to enter the country. Greene has also criticized Joe Biden's policies on immigration, calling him \"America Last\" and accusing him of ripping open America's borders.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Putin endorsed Kamala Harris because she’s weak.\n\nThe war in Ukraine would’ve never happened if Trump was President.\n\nPeace through strength!\n\nCall Zelenskyy and Putin and END THE WAR!!! https://t.co/cnCgVVWaRF",
          "date": "2024-09-11T02:15:16.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris had 4 years to secure the border. Not just as border czar, as Vice President.\n\nKamala Harris was the tie breaking vote to make sure the tips of every hard-working hospitality worker are taxed and reported to the IRS.\n\nWe’re supposed to expect things to change if https://t.co/vE1171ijlz",
          "date": "2024-08-15T14:03:08.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @MAGAIncWarRoom: Bronx Resident: \"Joe Biden's policies have failed...in terms of the economy, in terms of his illegal immigration, in te…",
          "date": "2024-05-23T20:35:54.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "300,000+ children that have been lost at the border— UNDER BORDER CZAR KAMALA.",
          "date": "2024-10-02T01:23:37.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Trump was right again!!\n\nIllegal alien crime is one of the worst crime increases.\n\nIn my hometown this week, an illegal alien driving drunk at speeds of 100 mph killed 2 people and severely injured a baby in a horrific crash.\n\nIt should have NEVER happened!!! https://t.co/tI8ivAmi2N",
          "date": "2024-09-13T03:16:25.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "New York City is ready to “FIGHT, FIGHT, FIGHT” for President Trump! https://t.co/7mQRBx9E7S",
          "date": "2024-10-27T17:15:20.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "School is starting back and the student/teacher ratio is very high due to schools being flooded with migrant children.\n\nHow many students are in your children’s classes?\n\nElementary, middle, or high school?\n\nThis also strains the ability for teachers to do their jobs and reduces",
          "date": "2024-08-12T14:15:41.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @TrumpWarRoom: Kamala Harris supports California’s outrageous new law trampling on parental rights and allowing minor children to change…",
          "date": "2024-07-27T00:38:28.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Just saw the UNC Chapel Hill fraternity brothers who defended our American flag from rabid anti-American left wing protestors.\n\nThese young men are patriots!\n\n🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 https://t.co/afe6OSHcZy",
          "date": "2024-07-18T22:35:00.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Green New Deal is the biggest load of bullshit our United States Congress has ever been subjected to. \n\nI encourage everybody to read it - all fourteen ridiculous pages. https://t.co/YSNWspMzen",
          "date": "2024-07-18T00:22:31.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I went to New York to support President Trump the day he was arrested by corrupt DA Alvin Bragg for fake crimes and I FACED THE PRESS AND THE MOB.\n\nKamala Harris claims she wants to be President but she needs a little man sitting next to her for a prerecorded interview on CNN. https://t.co/lyRFxDC3Bv",
          "date": "2024-08-29T16:04:53.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala will let them all in, force you to pay for them, and give them free citizenship.\n\nAnd then she will say they came here because of climate change. 🙄\n\n https://t.co/Vltc2ouScr",
          "date": "2024-08-11T19:27:06.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It's hard to imagine that an innocent American, going to a Trump rally, and trying to support our beautiful American dream, could be murdered at the hands of Democrat political violence.\n\nWe will not be intimidated: We are more committed than ever. https://t.co/EMBm72jdQX",
          "date": "2024-07-14T17:06:53.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Steve Bannon is a political prisoner like many others unjustly prosecuted by the Biden/Harris admin.\n\nSteve will be released from prison next week however it’s wrong that he was denied his rights for early release under the First Step Act.\n\nVote for Trump to end this nightmare! https://t.co/6KE4X6u4Wl",
          "date": "2024-10-22T03:27:26.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris is one of two things:\n\n1. The architect of the TEN MILLION illegal alien invasion into America…or\n\n2. The total and complete failure who couldn’t secure the border. \n\nThe first is treason. \n\nBoth are disqualifying. https://t.co/EGKNcpTR8N",
          "date": "2024-07-21T21:58:07.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris is completely unfit to be President.\n\nHer radical record of supporting bail funds for rioters, pushing for gun bans, and wanting to abolish ICE shows she is dangerous and anti-American.\n\nThe American people deserve better! https://t.co/gLYR2jatty",
          "date": "2024-07-31T23:13:48.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Border Czar Kamala Harris has allowed our country to be invaded by every corner of the world.\n\nMurder by fentanyl is up over 350% in just the four years Kamala Harris has been VP.\n\nThis crisis is affecting my constituents right here in Northwest Georgia, and President Trump is https://t.co/EAPmDHzCE1",
          "date": "2024-10-04T17:59:20.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In 2021, CBS said Kamala Harris was put in charge of the southern border. \n\nTonight, they’re fact checking JD Vance for saying Kamala was put in charge of the southern border. \n\nMore LIES from the FAKE NEWS MEDIA https://t.co/c8lE7kHCWE",
          "date": "2024-10-02T02:06:53.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As Democrats call for “unity,” Steve Bannon is sitting in a prison cell while Merrick Garland won’t even be tried for the exact same crime. \n\nThey weaponized the government against us, they call us fascists and terrorists, and then they call for “unity.”\n\nThere could be “unity” https://t.co/5Pxq8vUg4p",
          "date": "2024-07-17T23:44:36.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Please watch this video to the end. 💔\n\nNo American parent should lose their American child to rape and murder by an illegal that should not be here.\n\nVote for Trump to protect our children and all Americans from the chaos Kamala created with Democrat wide open borders!!! https://t.co/8Va5v7H8gT",
          "date": "2024-08-22T21:13:47.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I WILL fight for this country, and like millions of other Americans, I am armed, and I WILL protect myself and my loved ones.\n\nMay God have mercy on anyone who would try to hurt us, because if that day comes, only God will. https://t.co/SHmzVOZPVJ",
          "date": "2024-07-14T19:41:41.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden claims the war in Ukraine is a national security issue for America.\n\nWRONG.\n\nThe greatest threat to our national security is the millions of criminals, gangs, and terrorists that Democrats have allowed into our country!!!",
          "date": "2024-07-11T23:38:59.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @gc22gc: MTG: Steve Bannon gets out of prison in 2 weeks. I bet everyone’s watching @Bannons_WarRoom that day. He’s going to bring it. Y…",
          "date": "2024-10-16T17:00:53.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Democrats are in full panic mode!\n\nThey claim Trump will use the military against Americans, but the only ones who have weaponized the government are Joe Biden and Kamala Harris.\n\nPresident Trump respects our freedoms, unlike the Democrats who love violence and unrest. https://t.co/98M4SSlBta",
          "date": "2024-10-25T18:32:41.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden Administration has allowed almost 2 MILLION PEOPLE to stream across our border with NO VETTING.\n\nThese illegal aliens could be are rapists. Murderers. Gang members. Cartel members. Terrorists. \n\nPossibly some of the WORST people in the world, and they are invading our https://t.co/Ds7nmc0ujH",
          "date": "2024-07-17T18:44:32.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris is now saying she does not support the electric vehicle mandate, wants to build the wall, and stole Trump’s no tax on tips plan.\n\nIsn’t it too early for Kamala to dress up like MAGA for Halloween?",
          "date": "2024-08-27T20:01:28.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s great to be on the campaign trail today, encouraging voters to support my friend and Trump-endorsed candidate @BrianTJack in the primary runoff election for GA-3 on June 18th!\n\nI need more America First candidates and Trump loyalists like Brian serving with me in Congress. https://t.co/aDFGKTM5zM",
          "date": "2024-06-17T16:49:14.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Let’s not forget, Harris was tapped as the Biden Administration’s “Border Czar,” and what do we have to show for it? Over 5 million illegal crossings, record levels of fentanyl flooding into our communities, and a humanitarian crisis that worsens by the day. Her failure at the",
          "date": "2024-10-15T14:27:39.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden has a lot to address with the American people tonight, including lying about his son’s laptop, crippling inflation, and over 300 Americans dying every single day from the Biden border crisis.\n\nJoe Biden is in the hot seat tonight, not President Trump. https://t.co/DlFaDu6FFb",
          "date": "2024-06-27T17:52:37.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "$2.5 billion to house illegal immigrants.\n\n$80 billion for the IRS to hire 87,000 agents.\n\n$1.3 billion in stimulus checks to more than 1.1 million prisoners.\n\nMore than $130 billion in aid to Ukraine.\n\nKamala wants to raise your taxes to fund these Dem. pet projects and more.",
          "date": "2024-08-19T19:31:11.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @RepMTG: In 2021 and 2022, they could not find more than 85,000 migrant children.\n\nIt’s 2024, how many more are missing while Kamala is…",
          "date": "2024-08-11T15:02:26.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Tim Walz will work with Border Czar Kamala Harris to give your taxpayer dollars to the rest of the world.\n\nUnder Tim Walz, Minnesota gives free college tuition to illegal aliens.\n\nJust like Kamala Harris, Tim Walz is America Last always. https://t.co/rWriYpYnTj",
          "date": "2024-08-06T17:12:13.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Besides literally stealing Trump’s NO TAX ON TIPS plan, the most pathetic part about this is that Kamala is VP right now but can’t deliver any of her promises.\n\nKamala is a fake candidate that never received a single vote and is making fake promises she refuses to deliver NOW. https://t.co/TSfuWR0xEJ",
          "date": "2024-08-11T02:34:20.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“I'm announcing today that upon taking office, we will have an operation Aurora at the federal level. \n\nTo expedite the removal of the savage gangs, I will invoke the alien enemies act of 1798..to target and dismantle every migrant criminal network operating on American soil.” https://t.co/XgxRaLOi9v",
          "date": "2024-10-12T00:02:42.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The DNC is more secure than our Southern border!\n\nI’m not surprised.\n\nDemocrats love walls and 24/7 armed protection.. but only when it’s protecting them. https://t.co/E16sUfqS9T",
          "date": "2024-08-27T21:55:00.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden/Harris administration has given $1 BILLION to illegal aliens.\n\nMeanwhile, in North Carolina and Tennessee, hard-working American taxpayers are being given just $750 to start over from nothing in many cases.\n\nIt’s outrageous and a slap in the face to the American people. https://t.co/IxCuBwjw6b",
          "date": "2024-10-09T00:22:53.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/marjorie-taylor-greene-matt-gaetz-press-conference-on-justice-for-jan-6-detainees-transcript",
          "tweet": null,
          "date": "December 7, 2021",
          "scraped_on": "2025-04-15 14:05:59"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @RepMTG: Thread 🧵\n\nOn April 4, 2023, over a year ago, I was the first member of Congress to go to New York and defend President Trump ag…",
          "date": "2024-05-19T16:45:34.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The left is the party of violence and the party of hate.\n\nThey showed up today supporting their America Last, dementia ridden President who has ripped our borders open, made groceries and gas unaffordable, and will lead us into WWIII.\n\nThey’re scared of me and anyone who fights https://t.co/llN8S2Zykk",
          "date": "2024-06-05T20:56:52.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This unbelievably sad and infuriating.\n\nAnd Joe Biden’s response today was to write a vote-buying free citizenship executive order for illegals bypassing Congress’s law making authority! https://t.co/COIjrfaO6J",
          "date": "2024-06-18T12:21:05.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The CBS moderators just MUTED JD Vance’s mic as he called them out for their lies about Kamala Harris’ open border policies. \n\nDISGRACEFUL.",
          "date": "2024-10-02T01:30:31.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The 9/11 terrorists took flying lessons before they flew planes into buildings.\n\nNow illegal border crossers are reportedly taking shooting lessons.\n\nWhat could go wrong? https://t.co/OvQ7gPIiEn",
          "date": "2024-06-18T02:24:33.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump and Kamala Harris both have proven track records.\n\nDo you want the man who gave us historic tax cuts and is promising no tax on Social Security, no tax on overtime pay, and no tax on tips?\n\nOr do you want the woman who voted to expand the IRS to come after the https://t.co/Rh39D3YQz4",
          "date": "2024-10-09T19:39:16.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "What everyone needs to listen to is who President Trump is asking us to vote for.\n\nNo one is the loyalty test for President Trump except President Trump.\n\nThat’s why I’m supporting Trump-endorsed @JohnMcGuire4VA in VA-05 to defeat Backstabbing Bob Good. https://t.co/0LFnbQzULn",
          "date": "2024-06-07T18:30:55.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The media LIES about everything. \n\nThey lie about Trump.\nThey lie about Covid/Vaccines/Fauci.\nThey lie about J6. \nThey lie about the “far-right.”\nThey lie about Hunter Biden laptop. \nThey lie about our children being groomed. \nThey lie about the border. \nThey lie about illegal https://t.co/SU67kxSIU9",
          "date": "2024-06-03T21:04:53.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I am unapologetically America First!\n\nWe need to finish President Trump’s wall so we can keep out the rapists, the child molesters, the drug and sex traffickers, and the murderers.\n\nAmericans are dying every single day from Joe Biden’s border crisis.\n\nWe must re-elect President https://t.co/0IwHODyJJm",
          "date": "2024-05-18T21:22:15.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @RepMTG: Early Friday morning, an illegal alien crashed head-on into a car in my hometown of Rome, GA, seriously injuring a 1-year-old a…",
          "date": "2024-09-12T20:25:04.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "CT-05 is a flippable district because Democrats barely won that seat in 2022.\n\nSteve Bannon doesn’t want you to feel sorry for him while he is in prison, he wants you to GET TO WORK!\n\nSteve wants ACTION, ACTION, ACTION!\n\nSteve wants VICTORY!!! https://t.co/i2kGELuvwn",
          "date": "2024-07-02T13:26:29.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden, Kamala Harris, and the Democrats are completely responsible for unconstitutional Covid lockdowns and school closures!! \n\nRemember that on November 5th!!! https://t.co/hmibmFy3fy",
          "date": "2024-08-20T16:41:27.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Where are the Republican AG’s and DA’s in red states fighting back to hold Democrats accountable??\n\nWe must stand up and defend those being persecuted by Biden and the Democrats’ lawfare!!\n\nAmerica isn’t the same country it was a week ago. The leading candidate for President is https://t.co/VXnGh9dDnz",
          "date": "2024-06-04T18:22:52.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The border crisis, missing migrant children, and the weaponization of the DOJ - these are real issues at stake on November 5th.\n\nForget the media noise and look at the facts.\n\nA vote for Trump is a vote to protect our country from the chaos of the Biden-Harris agenda. https://t.co/O1X1Ij5lv0",
          "date": "2024-10-22T16:35:13.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It doesn’t matter if they run Joe Biden, Kamala, or some other Democrat.\n\nThe American people have had it with open borders, crippling inflation, and criminals roaming the streets. \n\nJoe &amp; Kamala have ravaged this country, and Democrats are ALL still behind their policies… https://t.co/mdaXZrJNze",
          "date": "2024-07-18T21:39:01.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "While Republicans want to turn on cruise control and coast to November, the Biden regime is putting patriotic Americans in prison, and turning a blind eye to government weaponization. \n\nTomorrow, Steve Bannon will report to federal prison. This is a DISGRACE to our country, and https://t.co/p7r1elHaDR",
          "date": "2024-07-01T01:26:16.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“Same old playbook,” Kamala says. \n\nReminder, Kamala Harris is in office RIGHT NOW. \n\nInflation is out of control. Our border is being invaded. And we’re way worse off.",
          "date": "2024-09-11T01:17:24.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "And if Joe Biden cannot run for re-election because he is mentally unfit (you know, the reason the Democrats and their billionaires oligarchs pressured him to drop out) then he must IMMEDIATELY resign. https://t.co/lDu6VTKhDh",
          "date": "2024-07-21T18:52:02.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        }
      ]
    },
    {
      "issue": "Ukraine War",
      "stance": false,
      "desc": "Marjorie Taylor Greene has been critical of U.S. involvement in the Ukraine War, stating that it was started by President Trump and claiming that Russia's invasion was a result of NATO's aggressive expansion. She also questions why the U.S. is providing significant aid to Ukraine, suggesting that some of this funding goes towards supporting other countries rather than directly helping Ukraine. Greene has expressed support for ending the war and avoiding further escalation, but her views on the issue have been largely inconsistent and unsourced in available data.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Putin endorsed Kamala Harris because she’s weak.\n\nThe war in Ukraine would’ve never happened if Trump was President.\n\nPeace through strength!\n\nCall Zelenskyy and Putin and END THE WAR!!! https://t.co/cnCgVVWaRF",
          "date": "2024-09-11T02:15:16.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "$2.5 billion to house illegal immigrants.\n\n$80 billion for the IRS to hire 87,000 agents.\n\n$1.3 billion in stimulus checks to more than 1.1 million prisoners.\n\nMore than $130 billion in aid to Ukraine.\n\nKamala wants to raise your taxes to fund these Dem. pet projects and more.",
          "date": "2024-08-19T19:31:11.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Trump should NOT meet with Zelenskyy!\n\nHe just took another $8 billion from Biden and Kamala.\n\nThe last time there was a perfect phone call, Democrats created the Russian HOAX and IMPEACHED President Trump!\n\nThis is a set up.\n\nAnd Trump will end the war day one!\n\nTrump doesn’t",
          "date": "2024-09-27T13:55:25.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden claims the war in Ukraine is a national security issue for America.\n\nWRONG.\n\nThe greatest threat to our national security is the millions of criminals, gangs, and terrorists that Democrats have allowed into our country!!!",
          "date": "2024-07-11T23:38:59.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "FACT CHECK: The Democrat “border security bill” gave 5X more money ($100 BILLION DOLLARS) to protect other countries, like $60 BILLION to Ukraine. \n\nWhy do Democrats lie so much?",
          "date": "2024-10-02T01:35:41.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Which Joe Biden will show up today for his first unscripted big boy press conference after a long day with the globalists from NATO planning WW3? https://t.co/SxURWGM8gK",
          "date": "2024-07-11T11:37:28.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "So tired of lip service and broken promises.\n\nAfter another $61 billion to Ukraine they will likely ask for more money in September.\n\nUkraine is drafting prisoners now bc they are almost out of men to fight.\n\nWashington will send our sons next, they are already saying it. https://t.co/KLhO4EM5md",
          "date": "2024-05-08T14:03:34.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In 2016, they blamed Russia for hacking DNC emails. Now we have a proxy war with Russia in Ukraine.\nNow they are blaming Iran for hacking Trump campaign emails…\n\nhttps://t.co/G0KPCZQmjh",
          "date": "2024-08-10T20:42:57.000Z",
          "scraped_on": "2025-04-01 13:46:21"
        }
      ]
    }
  ]
}