{
  "candidate": "Mark Green",
  "positions": [
    {
      "issue": "Illegal/Undocumented Migrants",
      "stance": false,
      "desc": "Mark Green supports securing the US Southwest border and prioritizing border security, emphasizing that open-border policies put Americans at risk and claim lives. He criticizes President Biden's handling of the crisis, stating that the administration is more concerned with dismantling the wall than addressing the issue. Green also highlights the consequences of the border crisis on crime rates, national security, and K-12 schools.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Instead of focusing on securing the SW border and keeping Americans safe, those in the Biden administration are worried about getting rid of materials for a wall they refused to build. \nhttps://t.co/e8bIya0ZOv",
          "date": "2024-08-15T15:44:10.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Biden’s border crisis is impacting K-12 schools. With nearly 10 million illegal entries in three years, resources are stretched thin. Schools are teaching in hallways and are struggling to meet the demand for multilingual educators.#BorderCrisis\n\nhttps://t.co/dP7j23eE0O",
          "date": "2024-06-18T17:16:02.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In the face of record inflation, VP Harris’s tax plan will make life even harder for the middle class.\n\nhttps://t.co/K5O3FoCfGS",
          "date": "2024-09-11T02:26:43.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Security breaches at Laughlin AFB show the dangers of Biden's open border policies. A human smuggler and an illegal migrant infiltrated our military, compromising national security. This is unacceptable. \n\nhttps://t.co/j1oVAVhUZe",
          "date": "2024-06-20T20:42:03.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "An estimated 7.9 million illegal immigrants have flooded into our country since Joe Biden came into office. \n\nThat’s more than the current population of Tennessee—7.1 million. This border crisis is unsustainable.",
          "date": "2024-06-13T15:31:04.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A picture is worth 1000 words.\n\nThis chart isn’t just about numbers, it’s about the lives that have been harmed by Biden‘s border crisis. \n\nhttps://t.co/SV1HOpMVnp",
          "date": "2024-07-19T15:44:59.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The chaos at our Southwest border is causing crime to rise in communities throughout the nation. Border security is crucial for public safety and national security.",
          "date": "2024-10-02T01:20:26.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our country was never meant to be a sanctuary for MS-13 or other dangerous transnational criminals. \n\nUnder another Trump presidency, our country will be safe once again.",
          "date": "2024-07-19T03:41:22.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Unfortunately, headlines like these have become quite common in the Biden-Harris administration’s America. \n\nIt’s time to get serious about border security.\nhttps://t.co/cmva4ozdHh",
          "date": "2024-09-23T19:33:03.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Releasing two illegal immigrants on the terrorist watchlist who tried to breach a military facility on bail is insane. The Biden-Harris DOJ has abandoned the rule of law.\n\nhttps://t.co/kYGc0RANsz",
          "date": "2024-08-21T15:10:19.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Despite the massive amount of fentanyl coming across the border, the heinous crimes committed by illegal aliens, and the increased terrorist threat, President Biden STILL refuses to take this border crisis seriously.",
          "date": "2024-06-28T02:18:55.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is just sickening. Open-border policies are claiming the lives of innocent Americans, including those from the Volunteer State. It’s time to secure our Southwest border NOW.\n\nhttps://t.co/eQLljM2Rdj",
          "date": "2024-09-27T14:14:04.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since President Biden laid out the welcome mat, there have been over 9.6M encounters of inadmissible aliens nationwide, completely overwhelming Border Patrol and border cities and states.",
          "date": "2024-06-28T01:23:02.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The crisis at our Southwest border continues to be a humanitarian nightmare. This is tragic. \n\nhttps://t.co/hCjwXliARv",
          "date": "2024-11-02T16:55:04.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "VP Harris shares culpability for creating the worst border crisis in our nation’s history. Border security hasn’t been her priority over the past ~4 years, nor will it ever be.\n\nhttps://t.co/41QNV4CcEQ",
          "date": "2024-09-11T01:27:34.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        }
      ]
    },
    {
      "issue": "China",
      "stance": false,
      "desc": "Mark Green advocates for a strong U.S. response to the perceived threat of China, citing concerns over China's actions in the South China Sea, Belt and Road Initiative, and aggressive military posture towards allies, as well as its disregard for human rights and use of economic coercion. He emphasizes the need for America to lead the Free World in standing firm against China's aggression and protecting global democracy.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A truly “Bold Vision for America’s Future” would mean: \n➡️Standing up to China\n➡️Standing up to Iran\n➡️Standing with Israel.",
          "date": "2024-08-21T03:19:08.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "America needs to prioritize energy independence NOW. We can't rely on foreign nations for our energy needs. \n\nTime to unleash American energy potential!",
          "date": "2024-06-21T19:10:03.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The CCP’s repeated disregard for human rights, use of economic coercion, and aggressive accumulation of power demand a strong U.S. response. We must take the China threat seriously and stand up for freedom. \n\nhttps://t.co/853r3zClzc",
          "date": "2024-06-26T16:23:04.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China is a severe threat to global democracy. \n\nChina's actions in the South China Sea, Belt and Road Initiative, and aggressive military posture towards our allies are concerning. \n\nAmerica must lead the Free World in standing firm against China’s aggression.",
          "date": "2024-07-10T20:48:04.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is no conspiracy theory. Our authoritarian adversaries—Communist China and Russia—are taking direct action and strengthening partnerships to undermine our nation’s economic interests and national security. \n\nhttps://t.co/EqVCalv2cR",
          "date": "2024-05-31T17:10:04.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Time and time again, Communist China has proven to be uncooperative in international efforts to promote peace and stability. \n\nhttps://t.co/KMO6zGZYUV",
          "date": "2024-10-01T20:33:02.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        }
      ]
    },
    {
      "issue": "Border Patrol",
      "stance": true,
      "desc": "Mark Green has not made a public statement or policy proposal that can be summarized about his stance on Border Patrol. Insufficient Data.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump is right – we must secure the border and we must do it now!",
          "date": "2024-07-19T03:16:34.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Chinese state-sponsored cyber attacks remain a significant national security threat. We must secure our nation’s borders—including our cyber border.\n\nhttps://t.co/s6Nbz7z2pK",
          "date": "2024-06-04T15:31:04.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "These brave men and women put themselves in harm’s way to defend our nation’s borders. We must stand behind our Border Patrol agents and stop this border crisis.\n\nhttps://t.co/amDZz90ft0",
          "date": "2024-05-14T19:30:12.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump is the leader our country needs, and he’s going to end the Biden-Mayorkas border crisis.",
          "date": "2024-06-28T02:13:26.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since FY21, Border Patrol has encountered more than:\n    ⁃    48,000 Criminal Noncitizens\n    ⁃    2,033 Gang Members\n    ⁃    362 Potential Terrorists\n\nSecure the Border.",
          "date": "2024-06-03T19:14:04.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We need to make America strong once again. That means securing our Southwest border and having a president that can lead. https://t.co/g2n3jn8dtl",
          "date": "2024-07-18T22:26:11.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "With your continued support, I will be in Congress on day one to fight alongside President Trump to get this country back on track and to secure the Southwest border. \n\nWill you please help me reach my fundraising goals so I can win re-election?\n\nhttps://t.co/7lWj5ixbO6",
          "date": "2024-05-22T16:01:06.000Z",
          "scraped_on": "2025-03-31 14:48:05"
        }
      ]
    }
  ]
}