{
  "candidate": "Marsha Blackburn",
  "positions": [
    {
      "issue": "China",
      "stance": false,
      "desc": "Senator Marsha Blackburn is a strong advocate for taking on the threat posed by Communist China. She has introduced several measures to counter the CCP's influence, including:\n\n1. **Prohibiting the FAA from funding foreign drone companies or procuring drones from China, Russia, Iran, North Korea, Venezuela, and Cuba**: Signed into law in 2024.\n2. **No Asylum for CCP Spies Act**: Introduced with her Republican colleagues to prohibit members of communist or totalitarian parties from being granted asylum in the US.\n3. **No Emergency Crude Oil for Foreign Adversaries Act**: Introduced in 2022 to ensure that reserves sold from the US Strategic Petroleum Reserve (SPR) are not exported to US adversaries, including Communist China, Russia, North Korea, and Iran.\n4. **The Iran China Accountability Act**: Led legislation designed to weaken Iran's connections with Communist China.\n5. **No Export of Crowd Control Equipment to Hong Kong Police Force**: Signed into law by President Donald J. Trump in 2019, as a bipartisan measure supporting the Hong Kong freedom fighters during the 2019 protests.\n\nSenator Blackburn has also:\n\n1. **Released her China White Paper** in 2020, a comprehensive analysis examining the state of play and detailing the best ways to start repairing the relationship between the US and China.\n2. **Supported a bipartisan resolution commending Taiwan for its commitment to democratic elections and institutions**, despite ongoing threats from the Chinese Communist Party in early 2024.\n3. **Met with Taiwanese President Tsai Ing-Wen** in Taipei in August 2022 to further diplomatic relations between the two nations and express her support for calling Taiwan a country.\n\nSenator Blackburn has consistently raised concerns about Communist China's increasing threat to the West, including:\n\n1. **The use of AI to grow the surveillance state**: Expressing concern that the CCP is using AI to monitor and control its citizens.\n2. **China's influence in the US technology industry**, particularly with regards to TikTok storing sensitive financial information of US users.\n\nOverall, Senator Blackburn has been a vocal critic of Communist China's growing threat to the US and its allies, and has introduced several measures to counter the CCP's influence in various areas.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The @NBA is playing ball with corrupt regimes in Rwanda and Communist China that both have a long history of human rights abuses.\n\n@SenJeffMerkley and I are demanding answers.\n\n@markfwespn\n\nhttps://t.co/gI3upu838N",
          "date": "2024-08-28T15:55:45.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The @WHO’s response to the COVID pandemic was an absolute disaster, yet Biden wants to give them more power.\n\nWe should make our own health decisions — not Communist China and the WHO.\n\nhttps://t.co/Wz1f9NrGlU",
          "date": "2024-05-06T18:55:08.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China must release the wrongfully detained Taiwanese citizens.\n\nhttps://t.co/8uerbpfZ3I",
          "date": "2024-07-03T20:28:01.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @HudsonInstitute: As China seeks to weaken Taiwan's resolve, Senator @MarshaBlackburn stresses the importance of standing with Taipei an…",
          "date": "2024-05-15T15:17:33.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The global automotive market has been flooded with Chinese-made cars, and importing them into the U.S. could threaten our national security. \n\nI sent a bipartisan letter with @SenGaryPeters demanding Chinese automakers be honest about their ties to the CCP. \n\n@cassandrecoyer1 https://t.co/ybIlxRdBz4",
          "date": "2024-09-12T01:16:09.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @milesyu10: The Pernicious Impact of China's 2005 Anti-Secession Law\n5/8 Remarks by Senator Marsha Blackburn of Tennessee\nhttps://t.co/g…",
          "date": "2024-06-15T00:14:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Just days after reports emerged of potential Chinese drones circling a U.S. military base, Communist China surrounded Taiwan with 125 warplanes.\n\nHow did the Biden-Harris admin respond?\n\nThey told Beijing to “act with restraint.”\n\nReminder — “Don’t” is not foreign policy.",
          "date": "2024-10-15T17:49:55.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China donated $3.6 million to a Virginia school.\n\nWhat is the Biden-Harris administration doing to stop the CCP from infiltrating our educational system?",
          "date": "2024-10-12T19:47:14.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Drone manufacturer DJI claims they are unaffiliated with the Chinese military, and are now suing the Pentagon for designating their firm as a “military company.”\n\nHere’s the bottom line — we cannot allow CCP-made drones into the U.S. military.",
          "date": "2024-10-20T16:07:32.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Other",
          "url": "https://www.presidency.ucsb.edu/documents/remarks-make-america-great-again-rally-nashville-tennessee-0",
          "tweet": null,
          "date": "May 29, 2018",
          "scraped_on": "2025-04-15 14:04:51"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China arrested 6 people in Hong Kong over “inciting” social media posts under the guise of a new “national security law.”\n\nThis is just days before the 35th anniversary of the Tiananmen Square massacre.\n\nWe must always stand with the Hong Kong freedom fighters.",
          "date": "2024-05-29T19:24:58.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The New Axis of Evil — Communist China, Iran, North Korea, and Russia — wants to destroy America.\n \nWe must stop them.",
          "date": "2024-07-21T00:05:46.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China is reportedly operating secret surveillance centers in our country.\n\nWe need to pass the Countering Chinese Espionage Act to ensure @TheJusticeDept is countering these threats.\n\n@james_t_quinn\n\nhttps://t.co/Cgco3qBgs0",
          "date": "2024-06-07T21:33:23.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Russia voted against a U.N. measure to monitor nuclear-weapons sanctions.\n\nWe must fight back against the New Axis of Evil — Communist China, North Korea, Iran, and Russia.",
          "date": "2024-05-05T18:05:30.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "35 years ago, Communist China violently destroyed peaceful protests in Tiananmen Square killing hundreds of civilians.\n\nWe must never forget the brutal repression of the CCP.",
          "date": "2024-06-04T20:45:56.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Wonderful to meet with Taiwan’s Ambassador Alexander Tah-ray Yui today. \n\nThe continued collaboration of our two nations is vitally important as we fight against the CCP’s aggression in the Indo-Pacific.\n\nI stand with Taiwan. https://t.co/Qju3jcR2Mx",
          "date": "2024-05-08T20:51:52.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The EPA’s Clean School Bus Program is putting taxpayer money directly in the pockets of Chinese EV manufacturers.\n\nMy bipartisan Secure School Buses Act will ensure U.S. adversaries like the CCP do not receive federal funding.\n\nhttps://t.co/Q8QXZAXBLc",
          "date": "2024-10-13T23:41:50.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In 2021, the World Anti-Doping Agency allowed 23 Chinese swimmers who used performance enhancing drugs to compete in the Olympics and to win gold medals.\n\nI sent a letter to the President of @wada_ama demanding answers. We must ensure Communist China is not above the rules.",
          "date": "2024-06-04T01:24:17.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The United States must support our friends in Taipei as Communist China keeps ramping up aggression towards Taiwan.\n\nhttps://t.co/FO0fAMX1qv",
          "date": "2024-10-11T13:43:01.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China wants to destroy America. \n \nWhat is Biden doing to stop them?",
          "date": "2024-06-01T21:02:02.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "To ensure that the 21st century is an American century, we must never bow to Communist China.\n\nThat means supporting our cherished allies, including Taiwan. \n\n@HudsonInstitute https://t.co/htXelbFLuV",
          "date": "2024-05-16T00:36:28.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China reportedly launched an intercontinental ballistic missile.\n\nThe CCP wants to destroy America.\n\nWhat are Biden and Harris doing to stop them?",
          "date": "2024-09-26T14:36:36.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China and Big Tech are working together to silence Hong Kong advocates.\n\nThe CCP will do anything to destroy dissent.\n\nhttps://t.co/E0NsC2Xwfn",
          "date": "2024-05-15T02:21:00.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Tariffs",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Other",
          "url": "https://www.presidency.ucsb.edu/documents/remarks-make-america-great-again-rally-nashville-tennessee-0",
          "tweet": null,
          "date": "May 29, 2018",
          "scraped_on": "2025-04-15 14:04:51"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Reckless spending policies are impacting business owners like Jeni Donahue of Artistic Printers in Greeneville.\n\nSmall business owners need lower taxes and less government regulation. https://t.co/grHMIMmYUG",
          "date": "2024-09-04T14:20:54.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Public Healthcare",
      "stance": true,
      "desc": "This text appears to be a collection of statements and actions made by Senator Marsha Blackburn (R-TN) during her time in office. Here are some key points summarized:\n\n**Agriculture and Food**\n\n* Supporting American agriculture and strengthening the food supply chain\n* Protecting the integrity of food systems through regulations, such as the FARM Act\n* Ensuring access to affordable healthcare for Tennesseans, including those with opioid addiction\n\n**Women's Issues**\n\n* Prioritizing legislation that empowers and protects women on various issues, including Title IX, women's sports, human trafficking, and female veterans' health care\n* Introducing a bill to protect women from domestic violence\n* Supporting the Kids Online Safety Act to protect kids online\n\n**Veterans' Issues**\n\n* Advocating for better access to mammograms for veterans\n* Supporting federal prison staff safety measures to prevent harm\n\n**Economy and Inflation**\n\n* Fighting to defeat the state income tax in Tennessee\n* Recognizing the impact of inflation on local businesses, particularly in East Tennessee\n* Supporting a tax-free weekend for back-to-school shopping in Tennessee\n\n**Education and Technology**\n\n* Advocating for 21st-century internet access for all Tennesseans regardless of zip code\n* Supporting legislation to ensure mental health support services are protected and encouraged\n\n**Healthcare**\n\n* Leading efforts to enhance access to surgical oral health care for Medicare patients, particularly children and adults with special needs\n* Working with the White House and Centers for Medicare and Medicaid Services Administrator Seema Verma on telemedicine regulations",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In East Tennessee, I spoke with a local business owner about how inflation is forcing her to raise prices and limit hiring. \n\nTennesseans want to see action to get the inflation caused by Biden &amp; Harris under control.\n\n@RobertSchmad \n\nhttps://t.co/maUWNxeOQC",
          "date": "2024-08-30T16:48:38.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In the Tennessee State Senate, I successfully fought to defeat the state income tax.\n\nTennesseeans want fiscal policies that allow them to keep their money in their pocketbook — not ones that bleed them dry.",
          "date": "2024-07-06T18:53:55.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Senate is set to vote on KOSA in the coming days.\n\nAfter years of fighting to get the Kids Online Safety Act across the finish line, we are one step closer.\n\nI will never stop working to protect our children from the harms of social media. https://t.co/mIuNrOiEmH",
          "date": "2024-07-23T21:11:11.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today, the Senate took a major step forward in protecting kids online by passing the bipartisan Kids Online Safety Act.\n\nI want to thank @SenBlumenthal for his excellent partnership, Majority Leader @SenSchumer, Commerce Committee Chairwoman @SenatorCantwell, and Ranking Member",
          "date": "2024-07-31T00:00:53.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Last year, nearly half of Bureau of Prisons staff surveyed reported that they had been sexually harassed or assaulted by an inmate. \n\nThis is unacceptable. \n\nSenator @Ossoff and I introduced a bill to help ensure federal prison staff are safer on the job.\n\nhttps://t.co/8T2BqMlUMj",
          "date": "2024-09-18T20:03:38.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My colleagues and I are calling on the DEA to permanently extend COVID-era telehealth flexibilities to expand access to treatment for those managing substance use disorders, chronic illnesses, and mental health conditions. https://t.co/gs9L0ZR3Ie",
          "date": "2024-10-31T14:15:00.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This month, women around the world are raising awareness and promoting screening for breast cancer.\n \nIn the U.S. Senate, I’ve led a bipartisan effort to expand veteran access to mammograms. https://t.co/2ELu7Lg0ca",
          "date": "2024-10-28T18:10:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Other",
          "url": "https://www.presidency.ucsb.edu/documents/remarks-make-america-great-again-rally-nashville-tennessee-0",
          "tweet": null,
          "date": "May 29, 2018",
          "scraped_on": "2025-04-15 14:04:51"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Last year, nearly half of surveyed Bureau of Prisons staff were sexually harassed or assaulted by an inmate.\n\nThank you to the National Fraternal Order of Police for supporting my legislation to help address the safety of prison staff who are simply tying to do their jobs. https://t.co/5GsalWPSBe",
          "date": "2024-10-17T14:09:20.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "That’s a wrap on my annual 95 county tour!\n\nI’m always grateful for the opportunity to speak with Tennesseans from across the state each year, and I will continue fighting for them in the United States Senate. https://t.co/YquX09qPkL",
          "date": "2024-08-22T23:57:12.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "October is Domestic Violence Awareness Month, and I am calling on the Senate to pass my bipartisan bill to better protect women before the end of the year.\n\nThe SALONS Stories Act would empower beauty professionals to recognize and respond to domestic violence. https://t.co/wx1t3X4cKd",
          "date": "2024-10-26T21:52:55.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I was honored to be in Normandy, France this week for the 80th anniversary of D-Day.\n\nThere is never enough we can do to thank our veterans from the Greatest Generation for all they have done to defend freedom around the world. https://t.co/K2WJxGuNlJ",
          "date": "2024-06-08T22:48:17.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As you prepare for back-to-school shopping, make sure to take advantage of Tennessee’s tax-free weekend.\n\nThis weekend, clothing, school supplies, and computers can be bought tax-free.",
          "date": "2024-07-26T20:41:35.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Tennesseans know a thing or two about the positive impact that music tourism has on the economy and culture. \n\nThank you to the Tennessee Entertainment Commission for supporting my American Music Tourism Act. https://t.co/JPY9lAsUwV",
          "date": "2024-05-14T23:42:34.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Regulations",
      "stance": true,
      "desc": "Senator Marsha Blackburn is known for her efforts to reduce burdensome regulations on farmers, rural areas, and small businesses. She aims to give these groups more flexibility to implement efficient infrastructure projects while receiving greater federal investment. Additionally, she has introduced legislation to protect the Tennessee Walking Horse industry from stifling regulations while optimizing horse health.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        }
      ]
    },
    {
      "issue": "Illegal/Undocumented Migrants",
      "stance": false,
      "desc": "Senator Marsha Blackburn has taken a tough stance on illegal/undocumented migrants. She supports reinstating the Trump-era policy that requires illegal immigrants seeking asylum at the southern border or without proper documentation to return to Mexico to await their immigration proceedings. Additionally, she has introduced legislation to combat child trafficking and human smuggling, including requiring DNA tests to determine relationships between migrants and children and preventing \"child recycling\" by fingerprinting non-citizens under 14. She also opposes amnesty for all undocumented immigrants and sanctuary cities that create lawless havens for illegal migrants.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden wants to green light mass amnesty for hundreds of thousands of illegal immigrants.\n\nThis is why he opened up the southern border.",
          "date": "2024-06-18T16:29:53.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "An internal Border Patrol memo revealed that agents in San Diego have been instructed to release single adults into the U.S. from over 100 countries in the Eastern Hemisphere.\n\nBiden’s promises of border security are nothing but election year lies. \n\nhttps://t.co/HySBkiqtDM",
          "date": "2024-06-10T23:29:59.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@mommamia1217 The Democrats’ immigration bill sought to allow thousands of illegal aliens into the country daily. I will never vote to make illegal immigration legal.",
          "date": "2024-07-15T17:14:54.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hezbollah — one of Iran’s terrorist proxy groups — launched the deadliest attack on Israel since October 7, killing at least 12 people including children.\n\nThese violent terrorists will not stop until Israel is wiped off the face of the earth.\n\nWe must stand with Israel.",
          "date": "2024-07-28T00:23:17.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since Joe Biden and Kamala Harris took office, more than 10.3 MILLION illegals have entered our nation.\n\nThey have no intention of securing the border or keeping our communities safe.",
          "date": "2024-11-01T14:21:09.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris admin’s CBP One app is inviting violent criminals into our nation.\n\nAn illegal who entered the U.S. in August 2023 through the app allegedly murdered a woman in Tennessee this past weekend.\n\nEnough is enough.",
          "date": "2024-09-12T18:36:21.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden is trying to convince Americans his border policy is a “success.”\n\nIn less than four years we’ve had:\n\n— Over 10 million illegal border crossings\n— Nearly 400 terrorist apprehensions\n— Over 460,000 migrants flown to the U.S.\n— At least 85,000 missing migrant children",
          "date": "2024-07-12T19:00:19.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden wants to handout another $7.7 BILLION in student loan relief.\n\nDoes this include students who chant “We are Hamas” and support terrorism on American soil?",
          "date": "2024-05-23T01:43:17.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@stephenleary Democrats want an open border so they can have greater congressional apportionment.",
          "date": "2024-08-26T17:53:24.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A sex trafficking bust in Texas rescued at least 50 potential victims and exposed ties to a drug cartel.\n\nOur wide open border is fueling these heinous crimes.\n\nWe MUST close the border.",
          "date": "2024-10-25T19:36:11.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Months after @UNWRA tried to kill the story, we now know a U.N. teacher allegedly held an 84-year-old Israeli woman hostage and withheld her diabetes medication from her.\n\nWe should not give one more penny to UNRWA or any U.N. agency that aids and abets terrorists.",
          "date": "2024-06-26T00:34:33.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A devastating new report released last week confirms ICE lost track of at least 32,000 migrant children — but that number could be as high as 323,000. \n\nUnder Biden-Harris, @HHSGov also lost track of 85,000 migrant children.",
          "date": "2024-08-29T21:21:08.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The man who allegedly committed second-degree murder in Knoxville is an illegal immigrant.\n\nThe Biden-Harris open border has turned every town into a border town.\n\nhttps://t.co/EBRYO1Xy46",
          "date": "2024-09-06T21:58:15.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since 2022, Biden has dismissed more than 350,000 asylum applications allowing illegal immigrants to stay in the country.\n\nDemocrats are encouraging illegal immigration to have greater congressional apportionment.\n\nThis is been their plan all along.",
          "date": "2024-06-03T17:40:22.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A year ago today, the House sent H.R. 2 to the Senate. \n\nSenate Democrats continue to stall this legislation, leaving the border wide open. \n\nWe should vote on H.R. 2 and close the border TODAY.",
          "date": "2024-05-15T23:25:10.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Democrats support an open border.\n\nThat’s why they won’t hold a vote on H.R. 2 — the real border security bill.",
          "date": "2024-07-09T17:27:58.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Any migrant who crosses our border illegally and commits heinous crimes should be deported immediately.\n \nThis is not complicated. Pass the CLEAR Act.",
          "date": "2024-06-30T18:10:30.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We cannot allow illegal aliens with criminal backgrounds to have voting power in our nation.\n\nThis is insanity.",
          "date": "2024-06-19T00:32:33.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Across the country, fentanyl overdoses are now the leading cause of death for Americans between the ages of 18-45.\n \nWe need real solutions to save American lives, secure our border, and protect children like Vaughn-Thomas, who tragically lost his life from fentanyl poisoning. https://t.co/NuB5ei1LZJ",
          "date": "2024-09-23T18:53:41.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s no secret Tennesseans are bearing the brunt of the inflation caused by the Biden-Harris administration.\n\nI spoke with a small business owner in East Tennessee who explained to me how rising costs have negatively affected her business. https://t.co/ybja6y0c6h",
          "date": "2024-09-14T21:01:54.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Illegal aliens who tried to breach Marine Corps Base Quantico were allowed to walk free after posting bail. \n\nThese illegal aliens should be deported immediately. The lack of consequences further emboldens these criminals and their flagrant disrespect for our nation’s laws.",
          "date": "2024-08-02T20:51:31.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Under the Biden-Harris administration, we’ve had:\n \n— Over 10M illegal border crossings, the most ever recorded in U.S. history\n— An economic crisis that has put our nation on the brink of a recession\n— Rising crime as gangs, terrorists &amp; violent criminals invade our communities",
          "date": "2024-08-13T15:10:09.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "10.1 million illegal border crossings.\n\n320,000 lost migrant children.\n\nOver 370 suspected terrorist encounters.\n\nThousands of lives lost to fentanyl poisoning.\n\nThis is the result of the Biden-Harris open border.",
          "date": "2024-08-24T14:26:35.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since taking office, the Biden-Harris admin has:\n\n— Opened up the southern border &amp; allowed over 10 million illegals into our nation\n— Launched a war on American energy &amp; banned liquified natural gas\n— Turned their back on Israel\n\nTheir radical policies are harming our country.",
          "date": "2024-08-05T18:59:50.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "An illegal alien who allegedly raped a 15-year-old girl was released on $500 bail.\n\nWe need to secure the border and deport illegal immigrants.\n\nhttps://t.co/5pwVNIb8tk",
          "date": "2024-07-03T14:28:43.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We truly have no idea who is coming into our country.\n\nBiden’s open border is making America less safe. https://t.co/8ZgyZxkYCL",
          "date": "2024-05-30T21:50:30.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since October, more than 27,000 illegal immigrants have come from Communist China to our southern border.\n\nThat’s an 8,000% increase from FY21.\n\nBiden’s open border is a national security threat.",
          "date": "2024-05-16T20:17:58.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Criminal illegal aliens have no place in the United States.\n\nWe cannot allow these lawless individuals to wreak havoc on our communities.\n\nDeport them all.",
          "date": "2024-06-28T13:42:23.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@RogerMarshallMD @SenRickScott “When you hear Democrats say they want to secure the border what they really mean is they want to make it more efficient to encounter, process, and disperse illegal immigrants without an asylum claim into the country.”\n\n@SenRonJohnson https://t.co/pV3JjSF2BN",
          "date": "2024-05-22T19:11:13.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Massachusetts State Government allegedly spent more than $1 billion in taxpayer dollars on “secret migrant crisis spending” to house illegals.\n\nHardworking Americans are being forced to bear the brunt of the radical Left’s open border policies.",
          "date": "2024-08-29T14:22:58.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Members of a violent Venezuelan prison gang are infiltrating the U.S. under the Biden-Harris open border.\n\nThey’ve been described as “MS-13 on steroids” and engage in crimes including human and drug trafficking, kidnapping &amp; money laundering. \n\nWe need to CLOSE the border.",
          "date": "2024-08-07T19:34:32.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden wants an open border so he can give mass amnesty and voting power to illegal immigrants.",
          "date": "2024-06-29T16:43:08.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "An illegal from Guatemala was released from local custody in Massachusetts after allegedly raping a child.\n\nWhy are these Democrat-led states encouraging migrant crime by failing to keep heinous offenders behind bars?",
          "date": "2024-10-11T19:03:01.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Reminder — under the Biden-Harris admin, nearly 300 suspects from the FBI terror watchlist were apprehended by Border Patrol.\n\nThis doesn’t include the suspected terrorists who have gone undetected while illegally crossing the border.\n\nWe MUST close the border.",
          "date": "2024-09-14T14:46:14.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We need to deport illegal immigrants, not give them citizenship.",
          "date": "2024-06-18T17:56:47.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "American families are at risk because of the Biden-Harris administration’s soft-on-crime policies and wide open border.\n\nThis tragic event is a result of this administration’s refusal to institute law and order in our country. This criminal should be deported immediately.",
          "date": "2024-08-14T14:02:08.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris administration cannot hide the fact that they have created the worst border crisis in history.\n\nPleased to see the Senate passed my bill with @JohnCornyn making sure Americans know exactly how many illegal immigrants are being released on the taxpayer’s dime.",
          "date": "2024-09-18T18:00:07.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Are you concerned about the potential for an attack on our nation while Biden allows suspected terrorists to come across the southern border?",
          "date": "2024-07-18T17:37:21.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Democrats want to release and resettle illegal immigrants into our country.",
          "date": "2024-06-03T14:01:54.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden administration is setting up offices in Colombia, Ecuador, Guatemala, and Costa Rica to help illegals fly into our nation without ever having to cross the border.\n\nThey are making illegal immigration legal in as many ways as possible.",
          "date": "2024-06-12T16:18:31.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A Venezuelan gang is recruiting students from middle schools in Texas.\n\nBorder Czar @VP Harris has endangered all Americans.",
          "date": "2024-10-16T18:14:55.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The FBI is alleging that Trump’s attempted assassin was motivated by “extreme” anti-immigration sentiments.\n\nYet, Crook’s Gab account more recently espoused pro-immigration, pro-lockdown &amp; pro-Biden views contrary to their claims.\n\nI confronted the Deputy Director about this ⬇️ https://t.co/PR8rTzg5Dq",
          "date": "2024-07-30T20:25:50.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We need border security, not Biden’s amnesty executive order.",
          "date": "2024-06-04T18:15:58.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris DOJ is helping the United Nations shield antisemitic @UNRWA employees — many of whom have helped Hamas hold Israeli hostages — from prosecution.\n\nThis is absurd. The United States should never shield terrorist sympathizers.",
          "date": "2024-09-24T13:23:40.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden has allowed hundreds of suspected terrorists — some with alleged ties to ISIS — to infiltrate our nation through his wide open border.\n \nOur nation’s safety is at risk because of his radical policies.",
          "date": "2024-07-16T13:57:28.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "From human traffickers, to drug smugglers, violent criminals and suspected terrorists, we have no idea who is coming across the southern border and into our nation.\n \nBiden has been emboldening criminals from day one in office.",
          "date": "2024-07-20T15:25:14.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden issued 94 executive orders to open the southern border within his first 100 days in office.\n\nHe has refused to enforce the laws on the books &amp; turned every state into a border state.\n\nDoes anyone believe this new executive order will actually secure the border?",
          "date": "2024-06-04T17:06:13.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "NYC Mayor Eric Adams is giving taxpayer-funded debit cards to over 7,000 illegals.\n\nDemocrats are fueling Biden’s border crisis.\n\nhttps://t.co/Y73F128UHt",
          "date": "2024-07-08T13:21:17.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "During my recent visit to Franklin, TN, Kathy Borum shared about the tragic loss of her son to fentanyl. \n\nSadly her story is like many others as fentanyl poisons our nation’s youth.\n\nWe must stop the flow of drug trafficking at the southern border. https://t.co/6E5HnBlaAy",
          "date": "2024-08-27T23:45:07.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Democrats want to increase illegal immigration to gain more seats in Congress.\n\nAs long as Biden is in office, our border will remain wide open.",
          "date": "2024-06-05T13:44:37.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "If @SenSchumer and Senate Democrats really want a secure border, why are we not voting on H.R. 2 — the House-passed border security bill that was sent to the Senate over a YEAR ago?",
          "date": "2024-05-20T20:43:16.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A “gotaway” illegal alien with alleged gang ties was accused of murdering a man in Connecticut.\n\nThe American people are unsafe because of the Biden-Harris open border.",
          "date": "2024-10-22T14:12:37.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hamas terrorists murdered nearly 1,200 innocent people.\n\nJoe Biden is now protecting these disgusting terrorists and refusing to send military aid to Israel.",
          "date": "2024-05-09T16:36:29.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Amid the uptick in threats from Iran in the Middle East and the rise in suspected terrorist crossings at our southern border, are you concerned about the potential for an attack on our own soil?",
          "date": "2024-08-13T13:03:18.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "After three Palestinian terror suspects were arrested in CA last month, border patrol in New Mexico this week caught another Palestinian on the terror watchlist.\n\nThe Biden-Harris open border is fueling the potential for a terrorist attack on our soil. https://t.co/GeuHwrtFTo",
          "date": "2024-08-15T16:04:43.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "VP Harris was named “Border Czar” and did nothing to secure the border.\n\nInstead, her policies enabled the migrant crisis and encouraged millions of illegals to invade our nation.",
          "date": "2024-07-23T17:13:41.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Venezuelan gang members are coming across our border and bringing crime and violence into our communities.\n\nStop the madness. Secure the border. https://t.co/mA1DpLhXBO",
          "date": "2024-09-25T15:31:52.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A police officer in St. Louis was allegedly killed in the line of duty by an illegal alien.\n\nEnough is enough.\n\nWhen is the Biden-Harris administration going to close the border and stop these senseless killings?",
          "date": "2024-09-24T17:41:45.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since Joe Biden was elected, over 10 million illegals have crossed our southern border.\n\nFentanyl has poured into our communities.\n\nCrime and terror have threatened our nation’s safety.\n\nIt’s time to SECURE the border.",
          "date": "2024-07-08T23:46:18.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Under the Biden-Harris admin, the government is processing U.S. citizenship applications at its fastest pace in decades — giving 3.3 million immigrants voting status in our nation.\n\nThis was part of their plan all along.\n\nhttps://t.co/r3MXQU2HE2",
          "date": "2024-08-15T17:49:10.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There cannot be a ceasefire until Hamas is destroyed.",
          "date": "2024-07-19T23:57:46.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@SenSchumer wants to vote on a so-called “border security” bill this week.\n\nSurprise — it’s not H.R. 2, an actual border security bill.\n\nDemocrats are playing politics while we face the worst border crisis in our nation’s history.",
          "date": "2024-05-20T16:56:23.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Senate Democrats unanimously BLOCKED the attempt to pass my End Child Trafficking Now Act.\n\nThis would require a DNA test to determine the familial relationship between illegals at the border &amp; any accompanying children. \n\nWhy don’t Democrats want to protect these children? https://t.co/QfrP89IY3W",
          "date": "2024-05-24T14:35:43.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@SenSchumer — if you really wanted to secure the border, you’d hold a vote on H.R. 2.\n\nYour sham immigration bill would make Biden’s open border policies permanent, and you know it. https://t.co/nHtQtloUGJ",
          "date": "2024-05-23T17:02:35.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "American communities are being harmed by the surge in illegal immigration.\n\nWe need to secure the border now.",
          "date": "2024-06-12T13:46:08.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We can never grant mass amnesty to illegal aliens.\n \nIf an immigrant enters our nation unlawfully, they should be deported.",
          "date": "2024-08-13T00:08:36.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is the reality of the Biden-Harris open border.\n\nGang members are illegally crossing our border and continuing to organize crime in America. https://t.co/ZdMwiC6fvG",
          "date": "2024-10-30T15:13:42.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "These Hamas sympathizers hate America.\n\n https://t.co/D6GD6eT7Jr",
          "date": "2024-07-24T21:08:15.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Democrats are refusing to close the border because they want illegals to count towards the population for congressional district apportionment.\n\nThey want to make illegal immigration legal.",
          "date": "2024-05-21T15:53:36.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A 10-year-old girl was allegedly murdered by an illegal alien in Nashville. \n\nUnder Biden-Harris every town is a border town and every state is a border state. \n\nhttps://t.co/LbQ6dq2iBX",
          "date": "2024-10-28T23:53:23.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "An illegal immigrant allegedly shot two New York police officers.\n\nJoe Biden’s open border is destroying law and order in every city.",
          "date": "2024-06-03T18:52:15.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Border Czar Kamala Harris has left our border wide open. \n \nWe need to stop this administration from making illegal legal.",
          "date": "2024-09-05T17:20:55.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "More than 430,000 illegal immigrants have been flown into our country through Biden’s CHNV mass parole program.\n\nBiden is working overtime to make illegal immigration legal.",
          "date": "2024-05-17T18:16:28.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@USCIS is asking Israelis applying for green cards whether they committed war crimes. \n\nBiden is targeting our brave friends from Israel when he should be supporting them in their fight to eliminate Hamas terrorists.\n\nhttps://t.co/YsBjI98bvB",
          "date": "2024-06-21T22:21:40.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you @GovAbbott and @TxDPS for reportedly arresting illegal immigrants from Iran  — the world’s largest state sponsor of terrorism.\n\nOur enemies are taking advantage of the Biden-Harris open border.",
          "date": "2024-10-16T22:19:43.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "UNRWA has been overrun by Hamas operatives paid for by the American taxpayer.\n\nIt is time to permanently defund @UNRWA. https://t.co/NtbLFq6wzF",
          "date": "2024-10-02T15:46:52.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris border crisis is putting an enormous strain on border communities &amp; our nation.  \n\nThis week, my CONTAINER Act — which empowers border states to protect their communities — was included in a House border bill. \n\nIt’s time to get this legislation signed into law.",
          "date": "2024-09-21T15:04:10.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Under the Biden-Harris open border, we’ve seen:\n \n— Americans killed by fentanyl &amp; criminal illegals\n— Women and children smuggled by traffickers\n— Potential terrorists slip through the cracks\n— Violent gangs like Tren de Aragua infiltrate communities",
          "date": "2024-11-01T23:52:52.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris administration has turned every town into a border town, and every state into a border state.\n\nI spoke to Tennessee law enforcement about how open border policies are impacting our communities right at home. https://t.co/gUlDfxndGk",
          "date": "2024-09-17T17:57:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris administration:\n\n— Brought Americans 40-year high inflation\n— Opened the southern border up to over 10 million illegals\n— Weakened American energy",
          "date": "2024-08-21T23:03:17.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Without secure elections, democracy will cease to exist.\n\nI am calling on @SenSchumer to put the House-passed SAVE Act to a vote.\n\nIllegal aliens should never be voting in American elections.",
          "date": "2024-09-25T01:20:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Under Joe Biden, we’ve had:\n \n— Over 10 million illegal border crossings\n\n— Nearly 400 terrorist apprehensions\n\n— Over 460,000 migrants flown to the U.S.\n\n— At least 85,000 missing migrant children",
          "date": "2024-06-29T18:56:18.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When Biden came into office, we had a secure border.\n\nAfter he ended each of Trump’s successful border policies in his first 100 days in office, the number of illegal border crossings EXPLODED.\n\nThis was not done by mistake — it was intentional.",
          "date": "2024-06-04T23:50:35.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hamas sympathizers threatened a Nashville hotel with violence and forced them to cancel a pro-Israel event last week.\n\nThis is completely unacceptable. \n\nArrest these terrorist sympathizers.\n\nhttps://t.co/nTbNEPmbxy",
          "date": "2024-05-14T14:25:34.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris program created to expedite the removal of migrant families has instead allowed 90% to stay in the U.S. \n\nMore evidence their goal is to make illegal legal.\n\nhttps://t.co/vmpUNK9XgG",
          "date": "2024-08-13T22:11:54.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kathy, a Middle Tennessee mom, lost her teenage son to a fentanyl-laced pill he likely purchased on a social media platform.\n\nWatch Kathy’s story to learn why Congress must pass the Kids Online Safety Act. https://t.co/MZXdt0T8Bc",
          "date": "2024-09-16T16:29:23.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rashida Tlaib called Israeli PM Netanyahu a “genocidal maniac.”\n\nDoes she need to be reminded that she has repeatedly called for the genocide of the Jewish people and has reported ties to Hamas terrorists?",
          "date": "2024-10-16T16:39:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Cartels engaging in human trafficking and drug smuggling are reaping the benefits of our open southern border.\n \nWe cannot allow lawlessness to prevail in the United States of America.",
          "date": "2024-06-12T01:44:23.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@norspex Democrats support an open border, which is why they won’t bring H.R. 2 — the real border security bill — to a vote in the Senate.",
          "date": "2024-07-03T17:22:35.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden and the Democrats are encouraging illegal immigration because they want to increase congressional representation of blue cities.\n \nThey keep trying to find ways to increase their power.",
          "date": "2024-07-19T00:31:29.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Iran has reportedly provided financial support to radical pro-Palestinian protestors in our country.\n\nWe need to stop Iran from trying to destroy America &amp; Israel.",
          "date": "2024-07-09T20:43:51.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "NYC Mayor Adams wants illegal immigrants to be the lifeguards for your communities’ pools because “they’re great swimmers.”\n\nDo other Democrats like Joe Biden think breaking the law is qualification for employment in our country?\nhttps://t.co/V82clC6U3h",
          "date": "2024-05-15T13:28:59.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden is lying about inflation to hide the fact that his policies caused the higher prices Americans are paying.",
          "date": "2024-05-29T13:57:52.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hamas sympathizers tried to block Jews from entering a Los Angeles synagogue for worship. \n\nUnthinkable that this could happen in a country that recognizes the right to freedom of religion, but it did.\n\nhttps://t.co/LurzHXicnl",
          "date": "2024-06-24T21:53:42.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@RogerMarshallMD @SenRickScott @SenRonJohnson @SenVancePress @SenLummis “Now the Democrats are claiming they care about fentanyl poisoning after 3.5 years of doing nothing other than facilitate the distribution of this poison.”\n\n@JohnCornyn https://t.co/Y88QXAt5gu",
          "date": "2024-05-22T20:59:20.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden lied to the American people when he claimed inflation was at 9% when he took office.\n\nThis is blatantly false. It was at 1.4%.\n\nHis policies created Bidenflation.",
          "date": "2024-05-15T18:05:43.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since Biden took office, there have been nearly 400 known terrorists apprehended at the southern border.\n\nHow many more terrorists is he going to allow to invade our nation before he finally secures the border?",
          "date": "2024-06-12T21:01:10.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris believes that a pathway to citizenship would end the border crisis.\n \nHow does encouraging more illegal immigration help solve the open border crisis her administration created?",
          "date": "2024-07-28T21:54:07.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This administration has failed to keep migrant children safe at every turn, and I’m demanding answers from DHS and ICE.\n\n@AdamShawNY\n\nhttps://t.co/ewEC3NA1id",
          "date": "2024-08-29T21:21:09.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT if you think we need to build the wall and deport ALL illegals.",
          "date": "2024-08-24T23:57:08.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Any protestor who promotes terrorism, engages in terrorist acts, or violates federal law in the name of Hamas should be prosecuted and deported immediately.",
          "date": "2024-07-24T18:51:22.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris is set to visit the southern border tomorrow, but not in her official capacity as Vice President.\n\nWhen will the “Border Czar” finally own up to the fact that she has no intention of securing the border?",
          "date": "2024-09-27T01:03:27.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We need to build the wall and deport EVERY illegal immigrant.",
          "date": "2024-07-17T17:26:39.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "$2.5 billion to house illegal immigrants.\n$80 billion to hire 87,000 IRS agents.\n$1.3 billion in stimulus checks to 1.1 million criminals.\n\nAll approved by the Biden-Harris administration.",
          "date": "2024-08-20T00:19:42.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There is a distinct difference when talking about ‘border security.’\n\nThe Left means release and resettle illegal immigrants. \n\nRepublicans mean deny and deport illegals.",
          "date": "2024-05-22T16:01:57.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @SenateGOP: Senator @MarshaBlackburn leads Senate Republicans in slamming Schumer’s Open-Border Bill https://t.co/VfzzDqSYrZ",
          "date": "2024-05-22T15:16:19.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Despite being named the Border Czar, Kamala Harris has reportedly never spoken with the Border Patrol Chief.\n \nShe does not care about the open southern border or our national security.",
          "date": "2024-07-27T15:05:56.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden has no intention of securing the border.\n\nHis administration has exacerbated this crisis at every turn. https://t.co/SlmMS00v8j",
          "date": "2024-06-12T17:29:07.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In the weeks leading up to the wave of college campus protests, student organizers consulted &amp; trained with National Students for Justice in Palestine.\n\nThis was a coordinated event and NSJP chapters should be banned by colleges.",
          "date": "2024-05-04T18:11:18.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@RogerMarshallMD @SenRickScott @SenRonJohnson “Joe Biden can open the border.\n\nJoe Biden can close the border.”\n\n@SenVancePress https://t.co/YXlqKuORpW",
          "date": "2024-05-22T19:51:01.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We know that under the Biden-Harris administration, at least 99 illegal immigrants on the terrorist watchlist have been released into the country.\n \nHow many more have been able to cross our border undetected because of their radical policies?",
          "date": "2024-08-11T20:35:02.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Reminder — Biden and Harris could close the border right now if they wanted to.\n\nThey don’t, and they won’t.",
          "date": "2024-08-31T18:29:17.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "An illegal immigrant allegedly attempted to commit sexual assault in Nashville.\n\nUntil we build a wall, every town is a border town.",
          "date": "2024-05-21T18:58:24.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris has long supported illegal immigration and said she would NOT enforce immigration laws.\n\nThis is part of her radical agenda to destroy our border security.",
          "date": "2024-07-25T14:33:56.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden allegedly wants to allow over 1.4 million illegal immigrants to enter our country this year. \n\nOnly our 7 largest U.S. cities have populations that high.\n\nStop the madness. Secure the border. https://t.co/vINhOjkrBF",
          "date": "2024-05-16T23:27:55.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I spoke with @Harford_Sheriff on my podcast Unmuted with Marsha about how Biden’s open border policies killed Rachel Morin.\n\nUntil we secure the border, every town is a border town.\n\n@cami_mondeaux\n\nhttps://t.co/I9mf148gAy",
          "date": "2024-06-24T14:11:00.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Traffickers posing as parents are drugging &amp; smuggling children as young as 8 years old at the border.\n\nWe need to pass my End Child Trafficking Now Act, which would require a DNA test to determine the relationship between migrants and children they are trying to cross with.",
          "date": "2024-09-24T16:08:32.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Big Tech has failed to protect our kids online.\n\nWe need to pass the Kids Online Safety Act.",
          "date": "2024-06-22T17:36:57.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris administration has refused to secure our southern border since taking office.\n\nTheir negligence is to blame for over 370 individuals on the terrorist watchlist attempting to illegally enter our country.",
          "date": "2024-08-22T19:39:02.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Shelby County’s woke bail policies let a criminal back onto the streets who:\n\n— Is the suspect in an interstate shooting that injured a father &amp; four children this week\n— Allegedly shot an Army veteran this month during a carjacking \n— Was out on bond on a significant gun charge",
          "date": "2024-06-13T18:12:49.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris is reportedly refusing to attend Israeli PM Benjamin Netanyahu’s address before Congress tomorrow.\n\nDisgraceful. She continues to show her antisemitism and contempt for the Jewish people.",
          "date": "2024-07-24T01:00:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We need to pass my CLEAR Act to allow state and local law enforcement to detain criminal illegal aliens until @ICEgov can deport them.\n\n@SenJohnThune\n\nhttps://t.co/DDlOK3i9PG",
          "date": "2024-05-21T23:08:38.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was a pleasure catching up with folks in Jefferson, Sevier, Cocke, and Greene counties. Tennesseans made it clear that they want a secure border, lower inflation, and criminals to be kept behind bars. https://t.co/Y9c5nTl2bv",
          "date": "2024-08-09T15:32:46.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Chuck Schumer’s open border bill allows thousands of illegals PER DAY to cross our southern border &amp; creates for them a 5-year pathway to citizenship.\n\nI’m holding a press conference today to expose this legislation for what it really is — a fake immigration bill.",
          "date": "2024-05-22T14:57:00.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Senator Schumer’s sham immigration bill failed in the Senate.\n\nBottom line — this was a bad bill that made illegal immigration legal &amp; did nothing to secure the border.\n\nHow about a vote on H.R. 2 now, @SenSchumer?",
          "date": "2024-05-24T13:15:29.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "NYC Mayor Adams’ administration is extending a migrant tent city lease in Brooklyn for another year.\n\nAmerican taxpayers are footing the bill for the radical Left’s open border agenda.",
          "date": "2024-09-16T23:23:53.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris admin has said an undocumented immigrant is not a criminal.\n\nThis is how they view illegals who are committing heinous acts inside our nation.",
          "date": "2024-08-19T23:02:04.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden is making it perfectly clear he wants to make illegal legal. \n\nNow offering amnesty to half a million illegal immigrants. \n\nNot on my watch. https://t.co/iljl6WXqCr",
          "date": "2024-06-19T02:26:41.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s simple. Open border policies encourage illegal immigration and make our nation less safe.\n\nTennessee law enforcement told me how the migrant crisis has brought drugs, crime, and lawlessness into our communities.\n\n@SeanMoran3\n\nhttps://t.co/gASZXvWfQ1",
          "date": "2024-09-17T18:57:42.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Yesterday, Senate Democrats unanimously BLOCKED my bill that would protect migrant children from human trafficking at the southern border.\n\nRepublicans want to bring forward solutions.\n\nDemocrats want to keep the border open.",
          "date": "2024-05-25T00:08:00.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As Americans mourn the loss of loved ones at the hands of illegal immigrants, Mayorkas is claiming that the Biden administration is “bringing order” to the border.\n\nThis couldn’t be further from the truth. \n\nWe need real border security.",
          "date": "2024-06-27T13:27:59.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Other",
          "url": "https://www.presidency.ucsb.edu/documents/remarks-make-america-great-again-rally-nashville-tennessee-0",
          "tweet": null,
          "date": "May 29, 2018",
          "scraped_on": "2025-04-15 14:04:51"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s simple.\n\nDemocrats don’t want to secure the border.\n\nThey want to make illegal immigration legal. https://t.co/JeXgkWD5bi",
          "date": "2024-05-22T15:15:36.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden’s open border has made every state a border state.\n \nWe need to secure the border — not create amnesty programs.",
          "date": "2024-06-24T16:52:43.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A pro-Palestinian protestor told Jewish people he wishes Hitler “would’ve wiped all you out.”\n\nWe need to protect the Jewish community from these Hamas sympathizers.",
          "date": "2024-06-11T21:10:05.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @SenateGOP: @MarshaBlackburn @MarshaBlackburn:\n\n“The truth is — Democrats are the party of open borders.\n\nThe left means to release and…",
          "date": "2024-05-22T16:02:07.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Just this week, a 25-year-old woman in Tennessee was allegedly murdered by an illegal who came into our nation through the CBP One app.\n\nBiden-Harris wants to make illegal legal, and it has to stop.\n\nSecure the border.",
          "date": "2024-09-13T01:45:52.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In the past week, dozens of migrants from countries with extensive terrorist activity have attempted to cross over our southern border. \n\nThe Biden-Harris administration’s efforts to legalize illegal immigration put this nation at risk every day. \n\nhttps://t.co/wsVMv13bqR",
          "date": "2024-10-08T21:17:45.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There have been nearly 175,000 known gotaways at the southern border in this fiscal year alone — an average of 800 per day.\n\nAs long as Biden is in office, our border will remain wide open.",
          "date": "2024-05-13T14:35:00.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Prioritizing access to health care for illegal immigrants over our veterans is disgraceful. \n\nKamala Harris wants to send American heroes to the back of the line. https://t.co/hwILSBUCp3",
          "date": "2024-07-25T13:13:01.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden’s open border policies are creating public safety concerns across the country.\n\nWe need to deport illegal immigrants. https://t.co/nWqr1XLHvj",
          "date": "2024-06-25T21:46:15.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Under the direction of the Biden-Harris admin, FEMA has been siphoning more than $1B in taxpayer dollars meant for disaster relief to support illegal aliens.\n\nEven in the face of massive destruction and heartbreak in our communities, this administration puts America last.",
          "date": "2024-10-03T18:58:45.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As Americans continue to be massacred by criminals illegally crossing our southern border, Border Czar Kamala Harris supports mass amnesty.\n\nThis administration’s failure to secure the border is disgraceful.",
          "date": "2024-08-21T21:23:53.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "By giving citizenship to illegal immigrants, Biden wants to make illegal legal.",
          "date": "2024-06-20T00:06:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A Jordanian national involved in an attempted Marine Corps base breach crossed the southern border &amp; was released by the Biden admin into the U.S. in April on a notice to appear.\n\nDeport all criminal illegal aliens.",
          "date": "2024-05-23T19:37:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden’s executive order is a last ditch effort ahead of November to trick Americans into believing he cares about border security.\n\nSadly for him, the American people know the truth.\n\nBiden created the border crisis.",
          "date": "2024-06-05T15:29:52.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@SenSchumer’s partisan open border legislation is really a feeble attempt to make illegal immigration legal.\n\nWATCH ⬇️ https://t.co/aeSLizGh35",
          "date": "2024-05-22T15:36:23.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Pollutant Controls",
      "stance": true,
      "desc": "Marsha Blackburn has expressed support for the agricultural industry and has proposed policies to help small businesses diversify and expand. She has also advocated for increased funding for grants that support dairy farmers and processors, aiming to create opportunities for consumers to access local dairy products and promote regional economic growth. Additionally, Senator Blackburn has taken a stance against excessive government regulation in industries such as horse breeding, stating that it can harm the economy and American families.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s no secret Tennesseans are bearing the brunt of the inflation caused by the Biden-Harris administration.\n\nI spoke with a small business owner in East Tennessee who explained to me how rising costs have negatively affected her business. https://t.co/ybja6y0c6h",
          "date": "2024-09-14T21:01:54.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "1998 — that was the last year Congress passed a major law to protect children in the virtual space. Since then, a lot has changed.\n\nToday, we are taking a big step to protect them with the Senate’s passage of the bipartisan Kids Online Safety Act. https://t.co/4LD9udPnav",
          "date": "2024-07-30T15:46:07.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Other",
          "url": "https://www.presidency.ucsb.edu/documents/remarks-make-america-great-again-rally-nashville-tennessee-0",
          "tweet": null,
          "date": "May 29, 2018",
          "scraped_on": "2025-04-15 14:04:51"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today in Carter County, I walked the grounds of Hampton High School &amp; spoke with leaders about rebuilding efforts post Hurricane Helene.\n\nIn Johnson County, Butler Depot has served as a supply hub for families. I was pleased to see the donations &amp; outpour of community support. https://t.co/GQNcOFzW4X",
          "date": "2024-10-24T21:05:07.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Praying for the Jewish community and Israel.",
          "date": "2024-07-19T18:11:54.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "After the Trump administration repealed Net Neutrality:\n\n— 94% of Americans secured access to high speed broadband \n— The number of rural Americans without access to high speed internet was cut in half \n— Broadband prices decreased up to 42%\n\nThe internet is not broken.",
          "date": "2024-05-05T02:37:56.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Dairy Business Innovation Act",
      "stance": true,
      "desc": "Marsha Blackburn supports the reauthorization and strengthening of the Dairy Business Innovation (DBI) Initiatives, aimed at helping American dairy farmers and processors add value to their businesses through creating new products, expanding markets, and modernizing production facilities.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        }
      ]
    },
    {
      "issue": "Limits on Prescription Drug Prices",
      "stance": true,
      "desc": "This text appears to be a collection of statements and press releases from Senator Marsha Blackburn (R-TN) regarding various issues she has been involved in. Here are some of the key topics:\n\n1. **Protecting children online**: Senator Blackburn introduced the Kids Online Safety Act, which aims to protect children from online harms, such as cyberbullying, predators, and explicit content.\n2. **Title IX and women's sports**: Senator Blackburn expressed support for the principles of Title IX, which requires equal resources for female athletic programs, and has called on sports-governing bodies to protect biological women in sports.\n3. **Prescription drug costs**: Senator Blackburn introduced the Patients Before Middlemen (PBM) Act to de-link the compensation of PBMs from drug price, with the goal of reducing prescription drug costs for Medicare Part D beneficiaries.\n4. **Veterans' healthcare and cybersecurity**: Senator Blackburn has pushed for stronger cybersecurity measures for the Department of Veterans Affairs (VA) and introduced legislation to protect veterans' personal information from being leaked or targeted by scammers.\n5. **Education reform**: Senator Blackburn has supported efforts to reduce violent crime among juveniles, including introducing the bipartisan AFTER SCHOOL Act, which would establish a grant program for local communities to establish, maintain, and strengthen after-school programs.\n6. **National security**: Senator Blackburn has been involved in various national security issues, including fighting against the COVID-19 vaccine mandate for military personnel and supporting legislation related to the Federal Aviation Administration (FAA) Reauthorization Act.\n\nOverall, Senator Blackburn's statements suggest that she is committed to protecting the rights of women, children, veterans, and seniors, as well as promoting national security and reducing violent crime.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "After years of fighting to protect children online and hold Big Tech accountable, the Kids Online Safety Act is taking a major step forward after passing the U.S. Senate with 91 votes in favor.\n\n@SenBlumenthal and I could not be more thrilled to see it advance to the House. https://t.co/VzYmL0A35F",
          "date": "2024-08-17T19:30:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "At 17 years old, Vaughn-Thomas from Middle Tennessee unknowingly bought a fentanyl-laced pill likely on Snapchat, and tragically lost his life.\n\nWe need to sign the Kids Online Safety Act into law and stop social media companies from pushing drugs &amp; fentanyl onto our children.",
          "date": "2024-09-16T17:50:51.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As the radical Left continues its assault on real women, we must protect female athletes against discriminatory practices.\n\nMy American Girls in Sports Day resolution calls on sports-governing bodies in the U.S. and abroad to protect biological women &amp; restore fair competition.",
          "date": "2024-09-19T13:19:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The bipartisan Kids Online Safety Act will play a critical role in holding Big Tech accountable for failing to protect our children in the virtual space.\n\nI could not be more thrilled to see this legislation pass the U.S. Senate.\n\nhttps://t.co/AOFIwpO7fy",
          "date": "2024-08-12T18:29:43.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you, @SenTedCruz, for working to move the Kids Online Safety Act through Senate Commerce Committee and for supporting it on the Senate floor yesterday. https://t.co/fwcaGvZarj",
          "date": "2024-07-31T16:46:37.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On World Mental Health Day, it is critical we call out social media’s role in the mental health crisis impacting our nation’s youth.\n\nThe House must pass the Kids Online Safety Act to protect our children and hold Big Tech accountable.",
          "date": "2024-10-10T22:57:33.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Last week, I introduced a bill with @ChrisVanHollen to cut funding for the World Anti-Doping Agency if it fails to promote fair play. \n\n@wada_ama must answer for turning a blind eye to the Chinese doping scandal.\n\nhttps://t.co/VEaSoImC8g",
          "date": "2024-08-05T14:14:54.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "🚨REMINDER🚨\n\nThere is no charge to file a FEMA or Small Business Administration claim. Beware of scammers who may charge fees to file assistance.\n\nFor more information visit my website at https://t.co/4JyUIF7bHN.",
          "date": "2024-10-08T17:27:42.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Kids Online Safety Act is centered around providing families with resources to protect children from online harms. \n\nEmpowering families to make the best decisions for their children is at the heart of conservative values. \n\nRead what top conservative voices are saying ⬇️",
          "date": "2024-09-13T15:04:19.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Abortion",
      "stance": true,
      "desc": "Senator Blackburn strongly supports protecting unborn children at all stages, has championed pro-life investigations and legislation, and aims to ensure transparency about federal funding for organizations like Planned Parenthood. She has introduced several bills to promote life, including the Title X Abortion Provider Prohibition Act, Unborn Child Support Act, and the Woman's Right To Know Act, which sets medical standards for informed consent before abortions.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today, my colleagues and I urged the @NCAA to keep biological men out of women’s sports. \n\nAs the Biden-Harris administration continues its dangerous attack on Title IX, the NCAA must put female athletes first. \n\nhttps://t.co/j8DckSXqlA",
          "date": "2024-08-06T20:31:42.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Across the nation, 64% of violent juvenile crime happens on school days.\n\nI’m calling on the Senate to pass my bipartisan AFTER SCHOOL Act, which would help combat this by giving more tools to our local communities to address juvenile crime.\n\nhttps://t.co/Aemj7L1xIG",
          "date": "2024-09-07T20:40:50.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Senate Republicans will:\n \n— Cut wasteful Washington spending\n— Stop costly regulations\n— Prevent Democrat tax increases\n— Unleash American energy",
          "date": "2024-10-23T16:31:04.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Title IX was created to protect women and girls in sports.\n\nWe need to stop Biden from taking those opportunities away. https://t.co/lI8BDRSWiY",
          "date": "2024-06-18T20:01:13.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Last week, I spent time in Scott and Campbell counties. We discussed two issues on Tennesseans’ minds: inflation and our open southern border. In Washington, I will continue fighting Biden’s radical policies. https://t.co/qWo6Perl2g",
          "date": "2024-05-25T22:14:42.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As we remember the suffragists who fought for the 19th Amendment, we must recognize that women today are still fighting for a seat at the table.\n\nI’ve introduced the Women’s Suffrage National Monument Location Act to honor women’s history with a monument on the National Mall. https://t.co/kB4bBPPTvO",
          "date": "2024-06-05T01:53:51.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On this day 105 years ago, the U.S. Senate voted to ratify the 19th Amendment to the Constitution.\n\nMay we never forget the plight of the female suffragists who fought for equality &amp; our right to vote.",
          "date": "2024-06-04T13:25:29.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In the last 50 years, female athletes have gone from the sidelines to the center stage of competition. \n \nAs the Biden-Harris administration wages war on Title IX and undermines women’s sports, Congress should stand with female athletes fighting for fair play.",
          "date": "2024-10-11T01:28:22.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@Fitgear_Central I am pleased to support our Air Force and recognize this exciting development!",
          "date": "2024-10-25T17:15:51.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you, @RichardGrenell, for supporting the Kids Online Safety Act and our efforts to hold Big Tech accountable.\n\nYou’re right — I won’t back down. https://t.co/BuIEUYGKAT",
          "date": "2024-07-31T21:06:53.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Senate Democrats unanimously BLOCKED the attempt to pass my End Child Trafficking Now Act.\n\nThis would require a DNA test to determine the familial relationship between illegals at the border &amp; any accompanying children. \n\nWhy don’t Democrats want to protect these children? https://t.co/QfrP89IY3W",
          "date": "2024-05-24T14:35:43.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@Erin_RDN We must secure our border. I will keep fighting for a vote on H.R. 2.",
          "date": "2024-07-15T17:15:24.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Dairy Business Innovation Initiatives",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        }
      ]
    },
    {
      "issue": "Renewable Energy",
      "stance": true,
      "desc": "Marsha Blackburn's stance on Renewable Energy: Unfortunately, Insufficient Data is not available. However, it is stated that she supports national energy policies that promote a diverse, domestic energy supply and reduce our dependence on foreign countries.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since Biden took office, gas prices have risen by more than 50%.\n\nWe need to unleash American energy.",
          "date": "2024-07-10T20:01:32.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris “Green New Deal” agenda has caused gas prices to rise nearly 50% since 2021. \n \nWe need to unleash American energy.",
          "date": "2024-09-05T13:25:10.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Election Integrity",
      "stance": true,
      "desc": "**Election Integrity:**\n\nMarsha Blackburn has not explicitly stated her stance on election integrity. However, she did express concern about the importance of securing elections during a statement.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "With 70 Senate cosponsors, Democrats and Republicans are united in the fight to protect our children online and hold Big Tech accountable.\n\nI could not be more thrilled that the Kids Online Safety Act will be passing the Senate in the coming days.\n\n#PassKOSA",
          "date": "2024-07-23T23:39:44.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @fairplayforkids: THANK YOU @MarshaBlackburn, @SenBlumenthal, @SenMarkey, and @SenSchumer for taking action to protect kids online. \n\n\"A…",
          "date": "2024-07-31T18:00:39.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Amid pushback from special interest groups, attacks from Big Tech’s band of lobbyists, and a barrage of online misinformation about #KOSA, @SenBlumenthal &amp; I never gave up on the fight to protect our children online.\n \nWith the Senate passage of the Kids Online Safety Act, we won",
          "date": "2024-08-01T20:36:57.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "For years, Big Tech has gone unchecked in their mission to make our children the product online.\n\nWith #KOSA one step closer to becoming law, Congress is stepping up to the plate to protect our nation’s youth.\n\nLearn more about the Kids Online Safety Act here:",
          "date": "2024-07-31T13:26:18.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Without secure elections, democracy will cease to exist.\n\nI am calling on @SenSchumer to put the House-passed SAVE Act to a vote.\n\nIllegal aliens should never be voting in American elections.",
          "date": "2024-09-25T01:20:06.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Military Spending",
      "stance": true,
      "desc": "Senator Blackburn supports increased military spending as part of her efforts to bolster the nation's security, particularly through investments in research and development initiatives such as Oak Ridge National Laboratory and Y-12 National Security Complex. Her bipartisan bills aim to establish Civilian Cybersecurity Reserve programs to enhance the U.S. government's cybersecurity capabilities. Additionally, she introduced the Defense Quantum Acceleration Act to advance the Department of Defense's approach to quantum technology and national security.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The American public should have access to safe, reliable, and affordable aviation travel.\n\nI am pleased to have championed solutions in this year’s FAA Reauthorization Act that will protect our national security interests &amp; stimulate economic growth for the Volunteer State ⬇️",
          "date": "2024-05-17T23:53:29.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Border Patrol",
      "stance": true,
      "desc": "Senator Marsha Blackburn supports securing the southern border by supporting efforts to build walls and fences, and has visited the border four times since starting her term in the Senate. She believes that every town will be a border town until the border is secured, and has expressed support for legislation that would provide border states with the authority to protect their communities.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "An illegal alien from Ecuador who crossed the border in 2023 allegedly murdered a woman in New York on her 21st birthday.\n\nHe was caught on camera carrying her body.\n\nEnough is enough. CLOSE the border.",
          "date": "2024-06-27T19:34:27.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden allegedly wants to allow over 1.4 million illegal immigrants to enter our country this year. \n\nOnly our 7 largest U.S. cities have populations that high.\n\nStop the madness. Secure the border. https://t.co/vINhOjkrBF",
          "date": "2024-05-16T23:27:55.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I spoke with @Harford_Sheriff on my podcast Unmuted with Marsha about how Biden’s open border policies killed Rachel Morin.\n\nUntil we secure the border, every town is a border town.\n\n@cami_mondeaux\n\nhttps://t.co/I9mf148gAy",
          "date": "2024-06-24T14:11:00.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "@RogerMarshallMD “Chuck Schumer is only worried about the election.\n\nThis isn’t a bill that secures the border.”\n\n@SenRickScott https://t.co/6EYIikgClv",
          "date": "2024-05-22T18:39:18.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@VP Harris’ performance as “Broadband Czar” has mirrored her performance as “Border Czar.”\n\nSimply put, she has failed.\n\nMy colleagues and I want to know why not a single American has been connected to the internet using the $42.45 billion allocated for broadband expansion.",
          "date": "2024-09-19T21:45:24.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden is trying to convince Americans his border policy is a “success.”\n\nIn less than four years we’ve had:\n\n— Over 10 million illegal border crossings\n— Nearly 400 terrorist apprehensions\n— Over 460,000 migrants flown to the U.S.\n— At least 85,000 missing migrant children",
          "date": "2024-07-12T19:00:19.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris border crisis is putting an enormous strain on border communities &amp; our nation.  \n\nThis week, my CONTAINER Act — which empowers border states to protect their communities — was included in a House border bill. \n\nIt’s time to get this legislation signed into law.",
          "date": "2024-09-21T15:04:10.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A sex trafficking bust in Texas rescued at least 50 potential victims and exposed ties to a drug cartel.\n\nOur wide open border is fueling these heinous crimes.\n\nWe MUST close the border.",
          "date": "2024-10-25T19:36:11.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden’s open border has allowed hundreds of suspected terrorists to infiltrate our nation.\n\nRecently, 8 illegals with alleged ties to ISIS were arrested in major U.S. cities.\n\nHere’s the bottom line — our country is less safe with Biden in office.\n\nWe need to secure the border. https://t.co/GOXp86OL17",
          "date": "2024-06-12T18:41:40.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Between the border, the economy, and rising crime, Tennesseans know our nation needs a course correction in the White House.\n\n#TelephoneTownHall☎️ https://t.co/2rxdpj9dm6",
          "date": "2024-05-15T00:58:54.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On National Day of the Deployed, I am praying for our troops fighting for freedom overseas and our Tennessee National Guard.",
          "date": "2024-10-27T00:19:41.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Democrats support an open border.\n\nThat’s why they won’t hold a vote on H.R. 2 — the real border security bill.",
          "date": "2024-07-09T17:27:58.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris was the Border Czar that opened up the border.\n\nWe need to secure the border.",
          "date": "2024-07-26T15:13:03.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On the night before the D-Day invasion, the 101st Airborne Division landed by parachute near the town of Ste. Mere-Eglise and obstructed enemy efforts to reinforce beach defenses.\n\nThank you to our 101st Airborne veterans and active duty soldiers for protecting freedom.",
          "date": "2024-06-06T23:08:22.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Under the Biden-Harris administration, Tennesseans are suffering from high prices and a wide open border.\n\nAlong my 95 county tour, Tennesseans made it clear they want a secure border, lower prices, and safer communities. https://t.co/maW71KE5Gi",
          "date": "2024-08-20T17:46:30.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As Americans mourn the loss of loved ones at the hands of illegal immigrants, Mayorkas is claiming that the Biden administration is “bringing order” to the border.\n\nThis couldn’t be further from the truth. \n\nWe need real border security.",
          "date": "2024-06-27T13:27:59.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Other",
          "url": "https://www.presidency.ucsb.edu/documents/remarks-make-america-great-again-rally-nashville-tennessee-0",
          "tweet": null,
          "date": "May 29, 2018",
          "scraped_on": "2025-04-15 14:04:51"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "An illegal immigrant from Colombia, who was wanted in Spain for drug trafficking charges, was arrested in Massachusetts.\n\nUntil we secure the border, every state is a border state.",
          "date": "2024-07-10T16:56:12.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you to all our active duty military &amp; veterans from Tennessee for fighting to protect freedom around the world.\n\n#DDay80thAnniversary https://t.co/ugtG9WE40H",
          "date": "2024-06-10T01:02:22.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Venezuelan gang members are coming across our border and bringing crime and violence into our communities.\n\nStop the madness. Secure the border. https://t.co/mA1DpLhXBO",
          "date": "2024-09-25T15:31:52.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Build the wall.",
          "date": "2024-05-31T01:49:13.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since Joe Biden was elected, over 10 million illegals have crossed our southern border.\n\nFentanyl has poured into our communities.\n\nCrime and terror have threatened our nation’s safety.\n\nIt’s time to SECURE the border.",
          "date": "2024-07-08T23:46:18.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Democrats support the invasion of our southern border.\n\nShut down the border.",
          "date": "2024-06-04T19:25:28.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Last week, I spent time in Scott and Campbell counties. We discussed two issues on Tennesseans’ minds: inflation and our open southern border. In Washington, I will continue fighting Biden’s radical policies. https://t.co/qWo6Perl2g",
          "date": "2024-05-25T22:14:42.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Until we secure the border, every town is a border town.",
          "date": "2024-07-16T18:56:46.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Just this week, a 25-year-old woman in Tennessee was allegedly murdered by an illegal who came into our nation through the CBP One app.\n\nBiden-Harris wants to make illegal legal, and it has to stop.\n\nSecure the border.",
          "date": "2024-09-13T01:45:52.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "FLASHBACK — just months ago, FBI Director Wray said he sees “blinking red lights everywhere” when talking about the potential for a terrorist attack on U.S. soil.\n\nSince then, at least 8 suspected terrorists with ties to ISIS have been found inside our nation.\n\nSecure the border.",
          "date": "2024-06-12T23:29:47.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@SenSchumer wants to vote on a so-called “border security” bill this week.\n\nSurprise — it’s not H.R. 2, an actual border security bill.\n\nDemocrats are playing politics while we face the worst border crisis in our nation’s history.",
          "date": "2024-05-20T16:56:23.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "VP Harris has said that, “we need to critically examine ICE.”\n \nThis is who is dictating our national border policy.",
          "date": "2024-07-27T18:40:05.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Make no mistake — Biden’s mass amnesty plan for half a million illegals is an entirely intentional effort to boost Democrats’ power and pander to his radical base ahead of November.\n \nThis is why they won’t pass H.R. 2 or secure the border.",
          "date": "2024-06-25T18:04:10.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "If the Biden-Harris administration truly cared about the American people, they would:\n\n— Close the border\n— Unleash American energy\n— Restore law &amp; order\n— Stop the reckless spending that is crippling our economy and drives prices up over 20%",
          "date": "2024-09-03T13:58:30.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Pleasure meeting with @knoxsheriff Tom Spangler in Knox County today! Tennessee is fortunate to have commonsense leaders like Sheriff Spangler who care about deterring crime, securing the border, and keeping our communities safe. https://t.co/wAuzMGknaY",
          "date": "2024-10-18T21:03:29.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT if you think we should build the wall.",
          "date": "2024-06-29T13:37:14.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "🚨LIVE: I’m holding a press conference right now debunking Democrats’ lies about how they want to “secure the border.”\n\nTune in ⬇️ https://t.co/fN8Ltkt1oV",
          "date": "2024-05-22T15:03:55.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A mother of five in Maryland who was murdered last August was allegedly killed by an illegal from El Salvador who crossed the border in February 2023 — under the Biden administration.\n\nHow many more lives will be taken before Biden secures the border?",
          "date": "2024-06-17T15:05:40.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rachel Morin and Laken Riley were killed because of Biden’s open border policies.\n \nWe need to secure the border.",
          "date": "2024-06-24T20:06:17.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Pass H.R. 2 — the REAL border security bill. https://t.co/L87yDpBVFk",
          "date": "2024-05-21T20:38:27.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden said border encounters today are lower than they were under President Trump.\n\nThis is blatantly false.\n\nStop lying to the American people, @POTUS.",
          "date": "2024-07-12T16:33:10.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Decreasing Immigration",
      "stance": false,
      "desc": "Marsha Blackburn's stance on decreasing immigration is not explicitly mentioned in the provided text. However, a related policy proposal is mentioned:\n\nShe has expressed support for limiting the number of immigrants by addressing \"chain migration,\" which refers to the practice of allowing family members of already legalized immigrants to apply for permanent residency and citizenship.\n\nInsufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Other",
          "url": "https://www.presidency.ucsb.edu/documents/remarks-make-america-great-again-rally-nashville-tennessee-0",
          "tweet": null,
          "date": "May 29, 2018",
          "scraped_on": "2025-04-15 14:04:51"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Why won’t the Biden-Harris administration unleash our domestic energy production and bring down gas prices for the American people?",
          "date": "2024-08-31T13:42:51.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Agricultural Industry Protection",
      "stance": true,
      "desc": "Marsha Blackburn supports protecting the American agricultural industry by introducing bipartisan legislation to safeguard it from improper foreign investment, aiming to bolster the sector's resilience.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        }
      ]
    },
    {
      "issue": "Carbon Emissions Controls",
      "stance": true,
      "desc": "Marsha Blackburn has expressed skepticism towards aggressive carbon emission controls, suggesting that policies such as the proposed climate-disclosure rule and Federal Supplier Climate Risks and Resilience Rule would impose unnecessary burdens on businesses. She has also implied that these rules could lead to increased regulatory overreach by the government.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        }
      ]
    },
    {
      "issue": "Inflation",
      "stance": false,
      "desc": "Marsha Blackburn has expressed strong opposition to high inflation, stating that administrative actions that increase prices should be avoided. She has accused the Biden-Harris administration of exacerbating inflation and called on them to take action to address it, citing the significant burden it places on Tennessee households.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Americans are struggling to make ends meet as inflation continues to take its toll.\n\nBetween rent, gas, groceries, and other basic necessities, the Biden-Harris administration has made daily living unaffordable.",
          "date": "2024-09-22T20:10:51.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In East Tennessee, I spoke with a local business owner about how inflation is forcing her to raise prices and limit hiring. \n\nTennesseans want to see action to get the inflation caused by Biden &amp; Harris under control.\n\n@RobertSchmad \n\nhttps://t.co/maUWNxeOQC",
          "date": "2024-08-30T16:48:38.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Inflation under Biden-Harris is costing the average Tennessee household more than $12,000 per year.\n\nThis administration is robbing Americans.",
          "date": "2024-09-12T16:02:22.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Why is the Biden administration touting 3.4% inflation as a “success” when prices are still up nearly 20% across the board?",
          "date": "2024-05-19T18:27:51.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As prices rise at the gas station and grocery store, Biden is lying to the American people about inflation. \n\n@StephenMoore explains why core inflation matters to consumers.\n\nhttps://t.co/SwI7SV3Ymy",
          "date": "2024-05-31T21:44:39.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Under Biden-Harris, gas prices have risen 49%.\n\nEvery American should be outraged by the inflation caused by this administration.",
          "date": "2024-08-25T17:18:28.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Harris administration:\n\n— Brought Americans 40-year high inflation\n— Opened the southern border up to over 10 million illegals\n— Weakened American energy",
          "date": "2024-08-21T23:03:17.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Ukraine War",
      "stance": false,
      "desc": "Marsha Blackburn's stance on the Ukraine War is not explicitly stated in the provided text. However, based on her voting record and public statements, she appears to be critical of President Biden's handling of various foreign policy issues, including Russia's actions in Ukraine. She has supported measures to impose sanctions on Iran and Russia, and has demanded answers from the administration regarding its policies towards these countries.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Russia voted against a U.N. measure to monitor nuclear-weapons sanctions.\n\nWe must fight back against the New Axis of Evil — Communist China, North Korea, Iran, and Russia.",
          "date": "2024-05-05T18:05:30.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hardworking Americans have funded this administration’s blunders to the tune of BILLIONS.\n \nFrom the border crisis to Afghanistan, to Putin’s war in Ukraine &amp; Hamas terrorists’ attacks on Israel, Biden-Harris has failed at every turn and forced Americans to pay for the fallout.",
          "date": "2024-11-03T21:07:51.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Gov Website",
          "url": "Marsha Blackburn Senate.Gov",
          "tweet": null,
          "date": "2025-04-28 00:15:25",
          "scraped_on": "2025-04-28 00:15:25"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Why won’t the Biden administration mention that Israel was able to rescue four hostages in the operation?\n\nAre they siding with terrorists over our ally? https://t.co/G22rHoOs8M",
          "date": "2024-06-10T21:28:07.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Other",
          "url": "https://www.presidency.ucsb.edu/documents/remarks-make-america-great-again-rally-nashville-tennessee-0",
          "tweet": null,
          "date": "May 29, 2018",
          "scraped_on": "2025-04-15 14:04:51"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden is reportedly withholding sensitive information about Hamas from Israel until Israel “pulls back.”\n\nSo much for that “unwavering” and “rock solid” support for Israel, @POTUS.",
          "date": "2024-05-14T15:22:45.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our athletes deserve to compete in fair  competitions.\n\nWe will not be bullied by WADA's attempts to stop the investigation into how the positive tests for banned substances were handled.\n\nhttps://t.co/LRy8L5lvq4",
          "date": "2024-07-31T18:02:38.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden administration doesn’t want our allies to confront Iran on their nuclear program.\n\nThis is just weeks after the regime launched its first ever direct attack on Israel from Iranian territory.\n\nStop appeasing terrorists, @POTUS.",
          "date": "2024-05-28T19:11:45.000Z",
          "scraped_on": "2025-03-26 22:20:06"
        }
      ]
    },
    {
      "issue": "Taxation",
      "stance": false,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.presidency.ucsb.edu/documents/remarks-make-america-great-again-rally-nashville-tennessee-0",
          "tweet": null,
          "date": "May 29, 2018",
          "scraped_on": "2025-04-15 14:04:51"
        }
      ]
    }
  ]
}