{
  "candidate": "Mike Rogers",
  "positions": [
    {
      "issue": "China",
      "stance": false,
      "desc": "Mike Rogers has expressed concerns about China's growing influence in global trade and manufacturing. He believes that China's entry into the World Trade Organization was a strategic move to compete with other nations, including Japan and South Korea, and now many electric cars are expected to be manufactured in China. As a result, Rogers seems to view China as a competitor to be watched closely, particularly when it comes to issues like trade and manufacturing.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When a small community in Mecosta County took the fight to Communist China, #ShadySlotkin didn’t just ignore their pleas for help… she was in on it the whole time, and signed an NDA to try and cover her tracks!\n\nWhen I get to the Senate, you bet I’ll have their back. https://t.co/U4dtwXUaUD",
          "date": "2024-09-22T20:09:59.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden-Slotkin EV Mandates:\n\n- More Reliant on China\n- Eliminate Up To 70K MI Auto Jobs\n- Decimate Michigan’s Economy",
          "date": "2024-07-10T18:08:45.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-warren-michigan-d04b6",
          "tweet": null,
          "date": "November 2, 2024",
          "scraped_on": "2025-04-15 14:09:37"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ve always stood up to China, and I’ll stop Slotkin’s China deal. https://t.co/Wo1DT22DkL",
          "date": "2024-10-22T19:44:38.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Call me crazy, but I don’t believe that elected leaders should be signing NDAs and hiding shady deals from their constituents — especially not ones tied to the likes of Communist China. \n\nSlotkin is too compromised for the Senate, and too radical for Michigan. https://t.co/DgCrR8lVBD",
          "date": "2024-08-29T23:04:16.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is what standing up to Communist China looks like. \n\nWhile Slotkin enables the CCP and their affiliates in Michigan, I'll work with the local communities being impacted by her selfish decisions to get them out of town! https://t.co/baopi0uOYb",
          "date": "2024-08-21T22:22:30.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Politicians like Slotkin are allowing Communist China to move into our backyards, putting our national security in jeopardy. \n\n“The five were found with cameras near numerous military vehicles, tents, and classified communications equipment during Northern Strike, one of the… https://t.co/KNvykfFFz3",
          "date": "2024-10-02T18:09:47.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @MAGAIncWarRoom: .@MikeRogersForMI: \"It is impossible to build an EV without getting in bed with the Communist Party of China.\" https://…",
          "date": "2024-07-16T23:30:22.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump hit the nail on the head! Gotion is funded by the CCP and has been labeled a national security threat. https://t.co/dMd3PkigNK https://t.co/LEiHyuTSBh",
          "date": "2024-08-21T15:48:26.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I was blowing the whistle on the threats of Communist China before it was cool. \n\nSlotkin signed an NDA involving the Chinese Communist Party. \n\nThe juxtaposition couldn't be more clear... Slotkin is too compromised for Michigan.",
          "date": "2024-08-29T16:09:50.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "China is the greatest threat to our national &amp; economic security. That's why I've spent my career standing up to their efforts to undermine America. \n\nWatch my interview with @foxandfriends discussing China's new spy base in Cuba &amp; Elissa Slotkin's secret deal involving the CCP. https://t.co/zkv7FUcEwe",
          "date": "2024-07-03T14:18:48.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "You can't be serious... Michigan voters aren't going to reward someone who calls the fire department on the blaze they set. \n\nYour support of the Gotion plant within 100 miles of Camp Grayling is a gift to the CCP's efforts to spy on the U.S. military. https://t.co/bTC1MjZuKI",
          "date": "2024-08-28T19:53:50.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @TeamMikeRogers: Watch @MikeRogersForMI tear apart CCP-owned Gotion LIVE from Green Charter Township!",
          "date": "2024-08-21T16:13:03.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-novi-michigan",
          "tweet": null,
          "date": "October 26, 2024",
          "scraped_on": "2025-04-15 14:09:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "And, we HAVE to stop the Harris-Slotkin EV mandates that are destroying Michigan’s auto industry. \n\nWe are the state that put the world on wheels, but DC Democrats like Slotkin want to mandate away our gas-powered cars and ship our auto jobs off to China.",
          "date": "2024-09-07T23:05:11.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This afternoon, I held a press conference about combatting the Chinese Communist Party, their efforts to spy in America, and Slotkin’s NDA.\n\nElected representatives have no business signing NDAs, let alone involving the CCP. If Slotkin is hiding the truth about Gotion from… https://t.co/eYEn6gZN3N https://t.co/A0WQqtdHhy",
          "date": "2024-09-09T22:50:17.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @aricnesbitt: Mike Rogers has been fighting against China’s economic incursions for years, while defending Michigan jobs.\n\nElissa Slotki…",
          "date": "2024-08-19T20:52:25.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Lowering the cost of gas &amp; groceries, securing the southern border, standing up to Communist  China, improving your kids’ education and stopping Slotkin’s radical EV mandates. \n\nThat’s what I’ll get to work doing on Day One in the United States Senate. #MISenateDebate https://t.co/w3wY3VrooL",
          "date": "2024-10-15T00:40:01.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @MAGAIncWarRoom: .@MikeRogersForMI: \"In all my time working to protect America, I have never seen anything like the Biden-Harris open bo…",
          "date": "2024-07-16T23:30:29.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "NEW AD: Slotkin is lying about me and my family because it’s more politically convenient than telling the truth about her secret deal that helped Communist China. \n\nIf Slotkin won’t tell the truth, I will. https://t.co/0j50NGk0uL",
          "date": "2024-08-21T19:24:21.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The CCP is relentless in its espionage efforts targeting the U.S. \n\nThis is just another example of why we cannot let the CCP Gotion plant be built in Michigan. I’ll fight like hell to bring China’s espionage efforts in our state to an emphatic stop!\n\nhttps://t.co/ndm7P0wmrq",
          "date": "2024-09-03T21:42:49.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "WATCH LIVE: Press conference on the Gotion battery plant, Communist China’s influence in America, and Slotkin’s flip-flop https://t.co/Noxocwijwr",
          "date": "2024-09-09T17:11:31.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "BREAKING: Gotion is forced to tell the truth about their allegiance to the Chinese Communist Party. \n\nWhen can we expect @ElissaSlotkin to tell the truth about her shady secret deal with Gotion and the CCP? Michiganders deserve to know.\n\nhttps://t.co/td8HAbHh95",
          "date": "2024-08-07T23:26:12.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden should immediately blacklist Gotion &amp; CATL from the U.S. for their child labor violations.\n\nThank you, Chairman Moolenaar, for your continued leadership &amp; service holding China accountable for their military &amp; economic aggression &amp; horrific human rights violations.",
          "date": "2024-06-06T20:47:44.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The difference is clear:\n\nI’ve spent decades fighting back against the growing threat of Communist China — and winning. \n\n#ShanghaiSlotkin signed an NDA to bring the CCP to our backyard. #MISenateDebate https://t.co/9qV8PW6OOw",
          "date": "2024-10-08T23:39:02.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China is no friend to the United States — and we need to start acting like it. \n\n“Chinese cargo cranes used at U.S. seaports around the country have embedded technology that could allow Beijing to covertly gain access to the machines, making them vulnerable to espionage… https://t.co/GPPgYFtqWL https://t.co/IZiExLK9Y9",
          "date": "2024-09-16T16:57:28.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        }
      ]
    },
    {
      "issue": "Gun Ownership",
      "stance": true,
      "desc": "Rep. Mike Rogers advocates for a strong defense of the Second Amendment, emphasizing his commitment to protecting gun ownership rights and upholding the constitutional right to bear arms.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-novi-michigan",
          "tweet": null,
          "date": "October 26, 2024",
          "scraped_on": "2025-04-15 14:09:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Gun violence is a real issue in our nation — and one that can be traced back to the mental health epidemic that is running roughshod all throughout the country. \n\nWe have to address the mental health crisis in our country. In the Senate, I’ll get to work to do just that.… https://t.co/lbQBxUCnS7",
          "date": "2024-10-14T23:30:26.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Other",
          "url": "https://www.fox17online.com/news/national-politics/america-votes/down-to-the-wire-mike-rogers-sits-down-for-a-candid-look-on-the-campaign-trail",
          "tweet": null,
          "date": "October 25, 2024",
          "scraped_on": "2025-04-15 14:09:20"
        }
      ]
    },
    {
      "issue": "Illegal/Undocumented Migrants",
      "stance": false,
      "desc": "Mike Rogers has advocated for stricter enforcement and deportation policies against undocumented migrants, calling it \"a necessary measure to protect American citizens\" and stating his intention to launch \"the largest deportation program in American history\". He also supports banning sanctuary cities and invoking the Alien Enemies Act of 1798 to target specific gangs.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-warren-michigan-d04b6",
          "tweet": null,
          "date": "November 2, 2024",
          "scraped_on": "2025-04-15 14:09:37"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris is no hero. \n\nShe and Elissa Slotkin have left our Southern Border wide open – and Americans have paid the price. In November, we will defeat both of them.",
          "date": "2024-07-23T18:19:24.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Another horrific and entirely preventable tragedy. Every single state in the union is a border state thanks to Border Czar Kamala Harris. We must secure the border and prevent more tragedies like this in our communities. \n\nhttps://t.co/QPJcxKyNm6",
          "date": "2024-07-31T00:56:21.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is what standing up to Communist China looks like. \n\nWhile Slotkin enables the CCP and their affiliates in Michigan, I'll work with the local communities being impacted by her selfish decisions to get them out of town! https://t.co/baopi0uOYb",
          "date": "2024-08-21T22:22:30.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Slotkin border crisis has made every state a border state. \n\nSouth American gangs are coming into our country and victimizing families right here in Michigan.\n\nOn Day One, I’ll get to work and finally secure our border.\n\nhttps://t.co/2SxVNe0sPC",
          "date": "2024-05-20T14:51:00.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "If someone tells you who they are, believe them. Harris and Slotkin cannot run from their radical EV mandates, and if they truly don’t support them, they should do the right thing and repeal the EV mandates today! https://t.co/69tsY957lG",
          "date": "2024-08-27T19:50:29.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The open border, sponsored by Joe Biden and Elissa Slotkin, isn’t just bad policy — it’s dangerous.\n\nKnown terrorists, human traffickers, Chinese nationalists, and fentanyl are all pouring into our nation.",
          "date": "2024-05-08T18:33:11.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "While Michiganders are struggling to make ends meet, Kamala Harris believes in giving handouts to illegal immigrants. \n\nFlip-flop Kamala might try to weasel her way out of it, but we know the truth. https://t.co/hbOzrBIuwL",
          "date": "2024-09-11T00:35:00.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Slotkin border crisis continues to devastate families around the country. Now, two of New York’s finest have been SHOT by an illegal immigrant who has a record of victimizing New Yorkers.\n\nhttps://t.co/lzfmedj5tW",
          "date": "2024-06-04T13:58:45.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Chaos at the Southern Border — claiming thousands of American lives each year. \n\nSlotkin had the chance to do something about it, but she followed in lockstep behind Kamala Harris instead. Slotkin is too radical and too dangerous for Michigan. https://t.co/xTxJ7omlet",
          "date": "2024-10-12T22:04:03.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "People are having a hard time affording their groceries, violent crime thanks to an open southern border is devastating communities, and job-destroying EV mandates are crushing Michigan.\n\nCome November 5th, we’ll Get America Back on Track! https://t.co/wkOn8JGI5W",
          "date": "2024-10-21T14:49:55.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Innocent lives are being lost as a result of our wide-open southern border. At the same time, those who serve and protect our communities are being vilified by far-left democrats. \n\nIn the Senate, I’ll stand by President Trump and right both of those wrongs. https://t.co/khr8dgZmxj",
          "date": "2024-10-18T23:40:22.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Just like Kamala Harris, #ShadySlotkin thinks she can flip-flop her way out of her radical record. \n\nBut not in Michigan. Slotkin is responsible for bringing Gotion and the CCP to our state — and Michiganders expect her to answer for it. https://t.co/RCIKs5hxBe",
          "date": "2024-09-08T00:11:39.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Seniors across Michigan are having to choose between paying for their medication or putting food on the table. \n\nCongresswoman Slotkin put them in this position. But in the Senate, I’ll fight like hell to get them out of it. #MISenateDebate\n\nhttps://t.co/IrRMsJfZqh",
          "date": "2024-10-08T23:23:20.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-novi-michigan",
          "tweet": null,
          "date": "October 26, 2024",
          "scraped_on": "2025-04-15 14:09:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Another ad from Slotkin means more lies being spewed on the airwaves trying to deceive Michiganders. \n\nSlotkin and DC Democrats don’t want you to believe your lying eyes. But we know the truth — they caused the border crisis. \n\nWith your help, we’ll secure the border. https://t.co/VoOVVpJf3g",
          "date": "2024-08-26T21:25:35.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’d be willing to bet she won’t repeat it on the debate stage tonight, but the truth is Kamala Harris is so radical that she called law enforcement efforts to deport illegal immigrants a “campaign of terror.” https://t.co/eoxn7FSqvr",
          "date": "2024-09-10T23:27:17.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When I am in the Senate, I will work with President Trump on DAY ONE to secure our border.  \n\nThe American people have paid the price of the Harris-Slotkin border policy for long enough. Getting America Back on Track starts with a secure border. #MISenateDebate https://t.co/QoGQJUvUl7",
          "date": "2024-10-08T23:55:03.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Like she always does, Slotkin followed Harris in lockstep and opened the floodgates at the southern order — allowing violent criminals and drugs like fentanyl into our backyards. \n\nThe only thing Slotkin should be saying about the border is “I’m sorry.” #MISenateDebate",
          "date": "2024-10-08T23:53:53.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is the Harris-Slotkin legacy. \n\nA wide-open border, putting American citizens in harm’s way. We have to right this ship. https://t.co/lm2ortwgFu",
          "date": "2024-09-29T18:00:42.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Harris-Slotkin disastrous border agenda and foreign policy put Americans and our allies in the crosshairs. https://t.co/cjc7n2JCjO",
          "date": "2024-08-22T18:04:57.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Israeli confirmation that Hamas leader Yahya Sinwar was killed in Gaza is rightful justice for this terrorist.\n\nIt also presents an opportunity for the Palestinian people, who’ve suffered greatly under the yoke of Hamas, to seek peace and reconciliation.\n\nLet us all pray that is… https://t.co/nQwtztUqkL",
          "date": "2024-10-17T19:04:22.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        }
      ]
    },
    {
      "issue": "Border Patrol",
      "stance": true,
      "desc": "Mike Rogers supports securing America's southern border, emphasizing its importance for protecting American families and communities. He believes in a secure border, safe streets, and economic stability, and promises to work with President Trump to achieve these goals on Day One if elected to the Senate.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-warren-michigan-d04b6",
          "tweet": null,
          "date": "November 2, 2024",
          "scraped_on": "2025-04-15 14:09:37"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-novi-michigan",
          "tweet": null,
          "date": "October 26, 2024",
          "scraped_on": "2025-04-15 14:09:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kristi and I were honored to have Senators @CapitoforWV and @joniernst with us on the trail yesterday, meeting with a fantastic group of women in Oakland County. \n\nWhether it be protecting women’s sports, fighting to save our kids’ education, or securing our southern border —… https://t.co/2puYz3REdi https://t.co/vQ5pdPzEmh",
          "date": "2024-10-17T21:01:11.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kristi and members of Team Rogers are out in full force all over the state fighting to win this race and Get America Back on Track! \n\nYou can join us by visiting https://t.co/YWk4mgVhrf https://t.co/NCNZKR73nl",
          "date": "2024-09-12T23:04:10.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kristi spent the morning in Kent County meeting with a fantastic group of voters. They discussed everything from the crisis at our southern border to the rising cost of gas and groceries — and, of course, our plan to Get America Back on Track! https://t.co/svGY5Esv4h",
          "date": "2024-10-04T22:51:37.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Next, we have to secure our border. Stories like the one of Ruby Garcia right here in Michigan are entirely avoidable. \n\nNot to mention the 3,000+ fentanyl deaths in Michigan last year. If we don’t bring swift and decisive action to secure our border, American families will… https://t.co/xrBCF8zrhu",
          "date": "2024-09-07T23:05:11.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Another ad from Slotkin means more lies being spewed on the airwaves trying to deceive Michiganders. \n\nSlotkin and DC Democrats don’t want you to believe your lying eyes. But we know the truth — they caused the border crisis. \n\nWith your help, we’ll secure the border. https://t.co/VoOVVpJf3g",
          "date": "2024-08-26T21:25:35.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In case you missed it, I made a big speech on Tuesday night at the @GOPConvention about lowering costs for families, ending job-killing EV mandates, and securing our border! Watch here 👇 https://t.co/kQb3HNNu7Y",
          "date": "2024-07-18T20:28:59.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When I am in the Senate, I will work with President Trump on DAY ONE to secure our border.  \n\nThe American people have paid the price of the Harris-Slotkin border policy for long enough. Getting America Back on Track starts with a secure border. #MISenateDebate https://t.co/QoGQJUvUl7",
          "date": "2024-10-08T23:55:03.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden should apologize to the American people for the crisis the #BidenSlotkin open border has created.\n\nWith President Trump and a Republican Senate, we’ll secure the southern border and our communities. #PresidentialDebate",
          "date": "2024-06-28T01:22:14.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Biden-Slotkin border crisis has made every state a border state. \n\nSouth American gangs are coming into our country and victimizing families right here in Michigan.\n\nOn Day One, I’ll get to work and finally secure our border.\n\nhttps://t.co/2SxVNe0sPC",
          "date": "2024-05-20T14:51:00.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Want to know what normal looks like? It looks like a secure border, safe streets, and paychecks lasting to the end of the month when it’s time to buy groceries. \n\n\n\nThat’s why we’re going to win in November. Because Michiganders are ready to Get America Back on Track! https://t.co/IIYipny0Fn",
          "date": "2024-08-08T23:37:11.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We were glad to welcome @JDVance to Green Charter Township yesterday, once again drawing attention to the threat of the Gotion Chinese battery plant — which will crush our auto industry and destroy this community. \n\nOnce I’m in the Senate I’ll fight like hell to protect Michigan… https://t.co/UCI68JUbgl https://t.co/le2KxyVbFi",
          "date": "2024-08-29T00:14:41.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Here’s my message to Michigan voters ahead of tomorrow’s primary elections: Once we pull off a win tomorrow, we start the fast track toward Election Day. \n\nCome November 5th, voters have the chance to stand up and demand a strong economy, a secure border and safe streets. Join… https://t.co/fbuwkT5aun https://t.co/Z1JkZKGg2w",
          "date": "2024-08-05T16:57:48.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is what Kamala’s and Slotkin’s “vetting” of migrants has done to our communities. \n\nOver 400,000 convicted criminals let loose on our streets\n\nWe will secure the border on Day One!\n\nhttps://t.co/KIuaDoCLxD",
          "date": "2024-09-28T15:04:34.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The Kalamazoo County GOP is fired up and ready to win big on November 5th! \n\nWe tore down the Democrats’ blue wall in Michigan brick by brick and we’ll elect Republicans to restore a secure border, a thriving economy, and safe streets to our communities. https://t.co/MECxbkxyBG",
          "date": "2024-07-29T18:27:31.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        }
      ]
    },
    {
      "issue": "Abortion",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-warren-michigan-d04b6",
          "tweet": null,
          "date": "November 2, 2024",
          "scraped_on": "2025-04-15 14:09:37"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-novi-michigan",
          "tweet": null,
          "date": "October 26, 2024",
          "scraped_on": "2025-04-15 14:09:28"
        },
        {
          "type": "Other",
          "url": "https://www.fox17online.com/news/national-politics/america-votes/down-to-the-wire-mike-rogers-sits-down-for-a-candid-look-on-the-campaign-trail",
          "tweet": null,
          "date": "October 25, 2024",
          "scraped_on": "2025-04-15 14:09:20"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I am running for Senate because our way of life is worth fighting for. \n\nAnd I will never give up on the promise of American freedom!",
          "date": "2024-07-03T23:01:55.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Let Slotkin’s record speak for itself: \n\n❌ She supports a plan that could close 44 rural hospitals in Michigan \n❌ She voted to restrict access to medication and treatments that would save lives \n❌ She voted to increase Medicare premiums by 57%\n\nSlotkin works for Washington —… https://t.co/O822Z89kom https://t.co/NnnrshFsLu",
          "date": "2024-09-20T13:41:28.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Michigan voters have made it clear where they stand on the issue of abortion — and I respect that. \n\nIn the Senate, I won’t do a thing to change it. https://t.co/t3W63dAWpi",
          "date": "2024-09-19T16:50:30.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ve made my stance perfectly clear: I am pro IVF, and I respect Michiganders’ decision on abortion. As your Senator, I will uphold the will of the voters and our Constitution.\n\n#MISenateDebate https://t.co/uPSJZkpBl3",
          "date": "2024-10-14T23:19:59.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Democrats are failing Michigan families, I’ll always fight for YOU, not Washington. Catch my interview with @kilmeade 👇 https://t.co/ruQqC669Ib",
          "date": "2024-09-20T22:01:37.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We had an incredible round table discussion with @Riley_Gaines_, @PaulaYScanlan, Secretary @BetsyDeVos, and student athletes from around the state. \n\nIn front of a packed room in Grand Blanc, I signed a pledge to stand up and defend women’s sports. In the Senate, I’ll always… https://t.co/2BX1HZEeBU https://t.co/2nnfOPuhCc",
          "date": "2024-08-06T02:33:35.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        }
      ]
    },
    {
      "issue": "Public Healthcare",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-warren-michigan-d04b6",
          "tweet": null,
          "date": "November 2, 2024",
          "scraped_on": "2025-04-15 14:09:37"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-novi-michigan",
          "tweet": null,
          "date": "October 26, 2024",
          "scraped_on": "2025-04-15 14:09:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The 21st Century can belong to America if we fight for it. https://t.co/MirOxSTVUk",
          "date": "2024-07-11T14:53:23.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Join me in celebrating the farmers and agriculture workers that support Michigan’s economy and feed the world! https://t.co/dCoQgvlqjq",
          "date": "2024-10-12T19:13:22.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We had a fantastic evening on Friday, meeting with over 50 seniors in Troy. \n\nThe Harris-Slotkin economy is absolutely crushing the senior community. In the senate, I’ll fight to make life more affordable — that means bringing down the cost of gas, groceries, prescription drugs… https://t.co/8MSZMICfgq https://t.co/oCWJlU798j",
          "date": "2024-09-22T15:30:42.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thank you, @MichREALTORS, for your strong endorsement and support to help us Get America Back on Track!\n\nTogether, we can solve the housing crisis and lower costs for families across our great state. https://t.co/1o7p83luY4",
          "date": "2024-10-12T15:36:32.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Markets work, mandates don’t. \n\nThe Harris-Slotkin EV mandates are killing Michigan’s auto industry. \n\nWe have to stop this madness and protect Michigan workers. https://t.co/Ux6YPU4cT2",
          "date": "2024-09-03T16:56:31.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m grateful to have earned the endorsement of The Detroit News Editorial Board.\n\nAs Michigan's next U.S. Senator, I’ll never stop fighting for the hard working families that make our state so special.\n\nhttps://t.co/hnzTTqQbuz",
          "date": "2024-07-12T15:48:46.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In Congress, I fought for the creation of Medicare Part D so that prescription drug costs would be covered. \n\nI have always been a champion for lowering the cost of medication for seniors, and will continue that fight in the Senate.  #MISenateDebate",
          "date": "2024-10-14T23:38:28.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In the Senate, I’ll fight to give our kids a chance. Right now, their leaders are failing them. We HAVE to do something about the literacy rates in our country — our future depends on it. https://t.co/8u75rAeA4l",
          "date": "2024-09-27T13:51:35.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        }
      ]
    },
    {
      "issue": "Pollutant Controls",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-warren-michigan-d04b6",
          "tweet": null,
          "date": "November 2, 2024",
          "scraped_on": "2025-04-15 14:09:37"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-novi-michigan",
          "tweet": null,
          "date": "October 26, 2024",
          "scraped_on": "2025-04-15 14:09:28"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Inflation keeps outstripping wage growth month after month.\n\nBidenflation = Pay Cuts\n\nhttps://t.co/LQQI8x3aud",
          "date": "2024-05-20T19:32:21.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Michigan always has been and always will be worth fighting for!",
          "date": "2024-08-27T13:07:44.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There are many other issues that we need to tackle — like getting the cost of gas and groceries under control, improving our education &amp; literacy rates in the state, supporting law enforcement, ensuring that our daughters have safe places to play sports, and so much more. \n\nBut… https://t.co/JcDWrI2eAe",
          "date": "2024-09-07T23:05:12.000Z",
          "scraped_on": "2025-03-17 18:47:38"
        }
      ]
    },
    {
      "issue": "Ukraine War",
      "stance": false,
      "desc": "Mike Rogers supports ending the war in Ukraine and believes it would not have occurred if he were president. He states that the US should not have entered the conflict, suggesting that the war was a mistake and that he would have prevented it from happening under his leadership.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-warren-michigan-d04b6",
          "tweet": null,
          "date": "November 2, 2024",
          "scraped_on": "2025-04-15 14:09:37"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/trump-rally-in-novi-michigan",
          "tweet": null,
          "date": "October 26, 2024",
          "scraped_on": "2025-04-15 14:09:28"
        }
      ]
    }
  ]
}