{
  "candidate": "Rick Scott",
  "positions": [
    {
      "issue": "Illegal/Undocumented Migrants",
      "stance": false,
      "desc": "This is a long transcript of a speech or interview with a politician, likely a Republican candidate or representative, discussing the issues of immigration, border security, and the policies of President Joe Biden and Vice President Kamala Harris.\n\nHere are some key points made in the transcript:\n\n1. **Criticism of open borders**: The speaker strongly criticizes the Biden-Harris administration's open border policy, arguing that it has created a crisis and posed a significant threat to national security.\n2. **Emphasis on human safety**: The speaker repeatedly emphasizes the importance of protecting American citizens from the risks associated with an open border, including violence, rape, and murder.\n3. **Contrast with previous administrations**: The speaker contrasts the current administration's policies with those of President Trump, who they claim successfully secured the border and protected America's interests.\n4. **Focus on consequences**: The speaker focuses on the long-term consequences of the Biden-Harris open border policy, arguing that it will have far-reaching negative impacts on American society and economy for decades to come.\n5. **Call to action**: The speaker concludes by calling on Americans to take action to address the crisis at the border and to demand that their elected officials take a stronger stance against immigration policies that they see as threatening national security.\n\nSome of the specific issues mentioned in the transcript include:\n\n* Rapes and murders committed by undocumented immigrants\n* Venezuelan gangs taking over apartment complexes and other public spaces\n* The Mexican cartel's ability to profit from the open border policy\n* The need for stronger border security measures, including increased funding for border patrol agents and infrastructure.\n* The importance of addressing the root causes of migration, such as poverty and violence in Central America.\n\nOverall, this transcript presents a starkly partisan view of the issue, with the speaker arguing that the Biden-Harris administration's policies are misguided and pose a significant threat to American security and prosperity.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/republican-press-conference-on-voting-security",
          "tweet": null,
          "date": "September 11, 2024",
          "scraped_on": "2025-04-15 14:10:46"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Watch my new ad about Debbie Mucarsel-Powell's socialist record, including her support of a wide-open border, taxpayer-funded benefits to illegal immigrants, and higher taxes for Americans. https://t.co/NpwhXpV0Eg",
          "date": "2024-09-12T12:02:37.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris is trying to pull a bait-and-switch on the American people.\n\nThe truth is there have been over 10 MILLION illegals that have crossed our border under her watch as border czar.\n\nShe desperately wants voters to forget, but they remember now &amp; will remember on Nov 5. https://t.co/uriG3f46BE",
          "date": "2024-09-03T15:39:07.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris has been Vice President for 1,329 days.\n\nShe has NO plan to secure our border, lower the cost of living, or create jobs.\n\nPresident @realDonaldTrump has a plan to #SaveAmerica on day one. https://t.co/UsKkPVte3G",
          "date": "2024-09-10T20:03:51.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Every day we read more stories of innocent Americans who are brutally attacked or killed because of Joe Biden’s open border.\n\nWhen will this end? When will it finally be enough for Biden to act? \n\nSecure the border NOW! This is sick. https://t.co/jOFkzor9db",
          "date": "2024-07-17T20:30:35.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "While Kamala Harris &amp; her socialist running mate continue hiding from the press, President @realDonaldTrump has been fully transparent with the American people.\n\nKamala is hiding because she has NO plan to fix the chaos caused by her and Biden.\n\nRepublicans have a plan👇 https://t.co/0mjL5n3VvQ",
          "date": "2024-09-10T16:52:14.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Democrats think that by comparing President Trump to Dictators of LATAM they would have a chance to win the Hispanic vote. They are wrong.\n\nFloridians know all too well the threat of socialism and they know it’s the Democrats who embrace and appease dangerous dictators.\n\nThat's",
          "date": "2024-06-19T19:39:50.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida’s Gulf Coast &amp; Big Bend has been destroyed. Western NC is unrecognizable.\n\nWhile Americans struggle to recover from Hurricane Helene &amp; @SecMayorkas says FEMA is out of money, the Biden-Harris admin is sending your tax dollars to Lebanon &amp; abandoning our own citizens. https://t.co/wAVLDAeonn",
          "date": "2024-10-05T00:47:46.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @CarlosGimenezFL: 🚨NEWS —&gt; Our Hispanic community stands with Senator Rick Scott, a champion for freedom against the socialist dictators…",
          "date": "2024-09-21T13:52:07.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden/Harris have chosen to prioritize the safety &amp; well-being of illegals over American citizens time &amp; time again, &amp; @DebbieforFL has supported them every step of the way.\n\nI applaud @AshleyMoodyFL for standing up to their failed immigration policies. https://t.co/R9AakMsac8",
          "date": "2024-08-27T12:47:16.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Democrats &amp; the liberal media are desperately trying to rewrite history on the massive border crisis Biden &amp; Harris created.\n\nNo one who’s been paying attention for the last 4 years believes that our border is “more secure” than when Biden took office. https://t.co/CE0rp79Rb5",
          "date": "2024-07-25T22:50:04.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Only in Biden’s America could border patrol agents actually get fired for just doing their jobs.\n\nThis is not what border security looks like. https://t.co/AYKOHWi0Lx",
          "date": "2024-06-18T13:10:14.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "How many more Americans need to lose their lives for Joe Biden to finally enforce the law? The blood of this woman and many others killed by illegal immigrants are on his hands. https://t.co/Onl5Y0uxzD",
          "date": "2024-06-03T00:25:05.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Not only is the Biden/Harris border crisis affecting the safety of our communities, it’s costing taxpayers BILLIONS.\n\nWith President @realDonaldTrump back in the White House, and Republican majorities in the House and Senate, we will put an end to the crisis on Jan 20, 2025. https://t.co/igZWpMXvWn",
          "date": "2024-08-29T19:39:29.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Three months ago, I launched #EcuadoriansForScott in Coral Gables.\n\nThe Ecuadorian community here in Florida stands STRONGLY against the socialist policies we have seen fully embraced by the Dems. https://t.co/t0AAw1dXCu https://t.co/8R4Lj4u6cH",
          "date": "2024-09-19T14:16:38.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @GOP: Under President Trump, the border was secure. Joe Biden fueled the worst border crisis in U.S. history. https://t.co/dADxTOtPQk",
          "date": "2024-06-28T01:26:36.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "According to a new poll, 78% of consumers view fast food as a luxury because it’s become increasingly expensive.\n\n@DebbieforFL is so beholden to DC Dems that she can't even admit their socialist policies are causing Americans pain.\n\nMore from Team Scott👇https://t.co/tZfi6Q2gHN",
          "date": "2024-05-29T15:42:24.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "An illegal immigrant was arrested for the TENTH TIME since July in Chicago.\n \nThis is the lawlessness and danger that Joe Biden has unleashed on the American people. https://t.co/2akGHKtZ76",
          "date": "2024-05-28T21:57:46.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kicking off our caravan around Miami today with @darielfernandez @MiamiDadeGOP and a great group of supporters who are ready to show Miami, and the state of Florida, that we will be voting for FREEDOM - not socialism - in November! https://t.co/myHIMxdh0b",
          "date": "2024-09-21T15:10:05.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We are blessed to have strong leaders like AG @AshleyMoodyFL who are standing up to defend Floridians from Joe Biden’s dangerous open border. \n \nViolent criminals who illegally enter our country have no place in Florida! https://t.co/adCaq9rdG2",
          "date": "2024-06-15T22:50:44.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s been 24 hours since antisemitic extremists burned our flag, defaced monuments, and chanted “Hamas is coming” in our nation’s capital.\n\nEven @KamalaHarris denounced these acts of hate and violence, why hasn’t @DebbieforFL? https://t.co/KN510oCw2E",
          "date": "2024-07-25T19:15:14.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Still waiting to hear if Debbie Powell supports border czar Harris' plan to give amnesty to the millions of illegals she has allowed into our country.\n\nFloridians, especially those who immigrated here legally, won't support open-border socialists in Nov. https://t.co/lzs1h604mY",
          "date": "2024-08-02T18:41:46.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden and his allies broke our economy, opened our border, and made our world less safe.\n\nTonight, President Trump will lay out his vision to secure our nation and rebuild our economy.\n\n#PresidentialDebate https://t.co/zG4yxsaqcl",
          "date": "2024-06-27T19:16:38.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump secured our border – and Joe Biden has done everything in his power to undo that progress.\n\nWe need someone in the White House who will support border patrol agents and enforce our laws – that person is President Trump! https://t.co/oOvrCgUOwq",
          "date": "2024-05-29T14:20:25.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "\"Rick Scott is our senator. He has done a spectacular job.\" -Monica Rich\n\nCollier County supporters made it clear this weekend that Socialist Debbie is not welcome in Naples. https://t.co/DBGaXxHpKk",
          "date": "2024-09-16T23:38:17.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hundreds of potential terrorists have been allowed to illegally cross our border under Kamala’s tenure as border czar.\n\nOur country is becoming less safe by the day under the Biden/Harris border catastrophe. https://t.co/JOd7BUoJO2",
          "date": "2024-08-05T20:00:42.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Gov Website",
          "url": "Rick Scott Senate.Gov",
          "tweet": null,
          "date": "2025-04-27 23:55:34",
          "scraped_on": "2025-04-27 23:55:34"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is who Joe Biden put in charge of our southern border.\n\nWhen Kamala Harris says “my values have not changed” we should believe her. https://t.co/kPx0ETxJrY",
          "date": "2024-09-23T16:45:39.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "\"Debbie Mucarsel-Powell promised she would fight for us, but when she got to Congress, she sided with socialists &amp; far-left politicians who represent the opposite of what we stand for. Rick Scott is a TRUE leader who has been on our side since day one.\" -Maria Beatrice Faggioni https://t.co/eThpnQEl9G",
          "date": "2024-06-05T14:09:01.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden’s State Dept. announced the removal of Cuba from list of countries that don’t fully cooperate against terrorism.\n\nThis is an INSULT to everyone fighting for freedom in Cuba.\n\nFloridians deserve to know if Biden’s hand-picked senate candidate, @DebbieForFL, supports this",
          "date": "2024-05-16T19:42:25.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden opened the border with an executive order, he can close the border with an executive order.\n\nNeither Biden nor Harris give a damn about border security. \n#Debate2024",
          "date": "2024-09-11T01:53:49.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Border Czar Kamala Harris has made clear time and time again what she thinks our border should look like.\n\nShe believes in a wide-open border, mass amnesty, and zero punishment for breaking our laws. https://t.co/7IlLv3SegS",
          "date": "2024-08-14T00:11:53.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "We have a wide-open southern border, and every month, hundreds of thousands of people are breaking into our country illegally.\n\nNo serious person disputes this.\n\nThe SAVE Act will prevent illegals from voting and protect the integrity of US elections. https://t.co/sh5iwj2EBR",
          "date": "2024-09-10T17:51:26.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My opponent recently blamed PM Netanyahu for Hamas continuing to hold Americans hostage.\n\nWhy is she afraid of her pro-terrorist base?\n\nMore from Team Scott👇https://t.co/WWecgeT25Z",
          "date": "2024-08-29T18:47:44.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Honored to be with freedom fighters here in Miami to reaffirm my unwavering support for freedom in Latin America.\n\nVenezuelans, Cubans, and Nicaraguans in Florida know firsthand the dangers of socialism, and as their Senator I will always fight for freedom at home and abroad! https://t.co/nWcnqMHZ8Z",
          "date": "2024-08-27T22:02:47.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "#ComradeKamala Harris' Platform Promises More Migrants, More Amnesty, and More Government.\n\nI’ve said it before and I’ll say it again – our southern border would be nonexistent under a Harris presidency. https://t.co/GtZXKdLgOd",
          "date": "2024-08-23T14:57:31.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "After 3 years of Kamala Harris as border czar, we have seen:\n\n10+ million illegal border crossings\n99+ suspected terrorists released onto our streets\n32.4 tons of fentanyl trafficked across the border\n\nShe's been a complete failure and is UNFIT to serve as president. #Debate2024",
          "date": "2024-09-11T00:37:43.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Benefits? Tell that to the families of Laken Riley &amp; Rachel Morin. Tell that to the hundreds of thousands of Americans fatally poisoned by fentanyl that’s crossed your WIDE OPEN BORDER.\n\nThe only benefits are to illegals, cartels, gangs &amp; smugglers. You’ve left Americans behind. https://t.co/BRHI233zC6",
          "date": "2024-08-30T12:21:45.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @GuyBensonShow: \"ZERO ENERGY FOR HARRIS\": @ScottforFlorida joined the #guybensonshow today and discussed Kamala Harris' radical policies…",
          "date": "2024-08-20T13:13:06.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As Senate Majority Leader I will force a vote to halt ALL funding to the UN - which gives a global stage to the world’s worst human rights abusers and terror sponsors and for years has supported Iran-backed Hamas terrorism. Enough. https://t.co/LhTVxRudDt",
          "date": "2024-10-02T12:58:49.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Make no mistake – Kamala Harris created the inflation crisis facing Americans.\n\nNow, she’s pushing a textbook socialist “plan” to fix her own mess.\n\nPresident @realDonaldTrump will restore our economy while keeping California socialism OUT of the White House.",
          "date": "2024-08-16T18:37:16.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden has been lying to the American people about our southern border since day one of his presidency.\n\nHe caused this crisis himself.\nhttps://t.co/W0gWQi6Aq1",
          "date": "2024-06-07T17:01:48.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Thanks to Joe Biden’s unwillingness to secure our border, two New York law enforcement officers were attacked &amp; shot. What does it say to future police cadets that our president prioritizes the safety &amp; well-being of illegals over our men &amp; women in blue? https://t.co/CjKfaj8Ib1",
          "date": "2024-06-04T13:25:22.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Migrant charged in brutal beating of NYC cops had been caught at border — and released — last year.\n\nBut remember – our Border Czar Kamala Harris doesn’t believe that people who cross our border illegally are guilty of any crime. https://t.co/S8YreW5iYC",
          "date": "2024-08-29T13:12:38.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/rick-scott-speaks-at-rnc-2024-night-two",
          "tweet": null,
          "date": "July 16, 2024",
          "scraped_on": "2025-04-15 14:10:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My SAVE Act would protect our elections by ensuring only American citizens can vote.\n\nIt’s simple, commonsense, and overwhelmingly supported by Americans.\n\nBut radical Dems like my opponent, Socialist Debbie, would rather see the government shutdown than pass this bill. https://t.co/91E0QFz5Re",
          "date": "2024-09-14T19:26:34.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris is a California socialist, plain and simple. \n \nFloridians know all too well the threat of socialism, many coming here to escape dangerous regimes in Latin America. They aren’t going to stand by &amp; allow Kamala to bring socialism to the US.\nhttps://t.co/UREsFLgyp0",
          "date": "2024-07-22T22:51:59.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@DebbieforFL's support of amnesty and allowing illegals to vote in our federal elections puts her in good company with Joe Biden, the Socialist Squad, and every other radical Dem in Washington.\n\nFloridians don't want an open-border socialist representing them in Washington.",
          "date": "2024-08-26T18:55:40.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Actions speak louder than words. \n\nWhen you had the chance to defend the Cuban people and stand up to the radicals in your party, you cowered and followed the party line. \n\nIt’s because you’re one of the radicals. https://t.co/Al4sFXQG0M https://t.co/oISDc3J6fW",
          "date": "2024-05-17T23:21:44.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Of course Debbie Mucarsel-Powell is so excited to support Harris/Walz, they’re the ticket for terrorist-sympathizing socialists. https://t.co/yJ6rTxKjfo",
          "date": "2024-08-13T01:34:20.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris said she would close immigration detention centers “on day one” as president.\n\nOn day one President Trump will SECURE our border &amp; enforce our laws.\n\nVoters have a clear choice – more chaos &amp; lawlessness or secure communities &amp; safer streets.https://t.co/2FjwICnlVB",
          "date": "2024-08-15T20:12:05.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This is the result of the border crisis that @DebbieforFL calls misinformation. \n\nVote today like your life depends on it, because it does. https://t.co/jYiiEyBj92",
          "date": "2024-10-22T21:31:12.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden flew hundreds of thousands of illegals into Florida last year. His open border crisis has made our state less safe, and @DebbieforFL wants this chaos to continue. https://t.co/I1ZHrld4ha",
          "date": "2024-05-04T17:24:55.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Mass amnesty for the 10 million+ illegals Kamala let into our country? That’s her plan.\n\nWill Florida socialist Debbie Powell condemn her fellow socialists and denounce this plan?\n\nMore from Team Scott👇https://t.co/Eq4YyOm3IR",
          "date": "2024-08-01T14:50:38.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @FLVoiceNews: WATCH: @ScottforFlorida says he has been in every Florida county in the last eight months and \"there was no energy for Bid…",
          "date": "2024-08-20T13:11:37.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@DebbieforFL voted with Nancy Pelosi 100% of the time during her short stint in Congress. She would be nothing more than a rubber stamp for the Dems’ radical open borders &amp; amnesty agenda.\n\nDemocrats want to give housing &amp; healthcare to illegals on taxpayers’ dime &amp; we can’t https://t.co/eXkBVK04Sg",
          "date": "2024-09-01T00:51:27.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "They’re not even pretending to hide it anymore.\n\nMake no mistake: If Kamala Harris becomes president, she will immediately work to give citizenship to the millions of illegals she has let pour across our border under her watch as border czar. https://t.co/QzuYWPcvv9",
          "date": "2024-07-30T19:12:02.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala’s biggest Florida fangirl, @DebbieforFL, has been silent on the pro-Hamas protests that took place 4 days ago in our nation’s capital.\n\nEven Kamala has denounced these antisemitic demonstrations of hate, why won’t Debbie? https://t.co/TAX7VZrEhc",
          "date": "2024-07-29T17:03:20.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s been nearly 4 years since we’ve had a president who actually enforced our border security laws.\n\nThat will end on Jan 20, 2025.\n\nPresident @realDonaldTrump will put an end to the Biden/Harris border crisis on day one. https://t.co/DjO9D0iOkC",
          "date": "2024-08-24T13:45:54.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Families like the one I grew up in wouldn’t stand a chance in the Biden/Harris economy.\n\nNow to combat the inflation crisis she helped cause, Kamala is proposing federal price controls - a plan we know has NEVER WORKED anywhere it’s been tried. Just ask anyone in Venezuela. https://t.co/ZejfHMGR9z",
          "date": "2024-08-19T18:48:39.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Border czar @KamalaHarris has overseen the worst border crisis in history - allowing thousands of terror suspects &amp; dangerous criminals to invade our country.\n\nThe president’s top job is protecting Americans. Biden tasked Harris with doing that by securing the border. She failed. https://t.co/JOd7BUphDA",
          "date": "2024-07-28T15:28:14.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Border Czar Kamala Harris, unburdened by her responsibility to secure our border and keep Americans safe. https://t.co/i0xUDfSrF4",
          "date": "2024-08-09T20:37:15.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The people of Miami, especially those who came here fleeing communism, know what’s at stake this November. No amount of misleading billboards will make them forget the Democrats’ embrace of socialism.\n\nBiden is wasting his money. Florida is TRUMP country! https://t.co/YbgRiVsugK",
          "date": "2024-07-10T23:16:39.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Floridians are abandoning the Democrats thanks to their radical socialist policies that have destroyed blue states.\n\nThis November we will keep Florida RED!",
          "date": "2024-05-07T18:36:11.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris' tax plan could cost US nearly 800K jobs.\n\nHer running mate was exactly right when he said WE CAN’T AFFORD 4 MORE YEARS OF THIS. https://t.co/o9DzriqEyi",
          "date": "2024-09-24T14:32:44.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Since @KamalaHarris was named #BorderCzar, there have been nearly 10 MILLION illegal alien border crossings, constituting the WORST border crisis in history.\n\nOur southern border would be completely non-existent under a Harris presidency. https://t.co/FMhJCdBZE6",
          "date": "2024-07-25T13:41:58.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My socialist opponent is so desperate, she has to lie and politicize a disaster that took the lives of Floridians.\n\nWatch my latest ad and read more from Team Scott here: https://t.co/g0GssNIkkJ https://t.co/d2KaC1r8Sn",
          "date": "2024-10-04T19:13:57.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This speaks volumes to Kamala Harris’ true priorities.\n\nOver $1 BILLION for illegal immigrants, but only $750 for Americans hit by #Helene.\n\nThis is the agenda supported by @DebbieforFL: illegals before Americans. https://t.co/i7OXYCsa0t",
          "date": "2024-10-04T18:24:12.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden and Harris halted construction of the border wall on DAY ONE.\n\nThen Kamala was named border czar, and in nearly 4 years on the job she has never once supported finishing the wall.\n\nShe has ZERO intention of finishing the wall or securing our border. https://t.co/5bPLexfXFl",
          "date": "2024-08-27T20:36:57.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "For years, Debbie has supported appeasement policies and the Democrats’ embrace of dangerous dictators around the world.\n\nDo you really think Biden/Harris, who negotiated with Maduro and his thugs, eased sanctions on the regime, granted clemency to Maduro’s closest allies, and",
          "date": "2024-07-29T19:08:04.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Seniors are getting crushed under the Biden-Harris economic agenda.\n\nKamala helped get us into this mess and will continue recklessly spending, worsening the inflation crisis that’s crushing Americans.  https://t.co/9pcKVcrOKh",
          "date": "2024-07-23T22:55:24.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "There’s an election coming up!\n\nYou know what that means – it’s time for Biden to start giving socialist handouts in a desperate attempt to get votes for his party.\n\nStudent loan “forgiveness” is socialism. https://t.co/BMXyJB0k4Z",
          "date": "2024-09-05T15:06:36.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        }
      ]
    },
    {
      "issue": "Israel-Gaza War",
      "stance": false,
      "desc": "Senator Rick Scott has expressed strong support for holding the United Nations Relief and Works Agency (UNRWA) accountable for its ties to Iran-backed Hamas, alleging that the organization has enabled the spread of hateful antisemitism. He believes UNRWA's staff members participated in the 2015 attacks on Israelis and Americans, leaving a lasting impact on innocent lives.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @Floridianpress: EXCLUSIVE: @SenRickScott calls out President Joe Biden over his position against Israel.\n\n\"Joe Biden is the Most Pro-Ha…",
          "date": "2024-05-17T22:41:58.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "The most radical ticket in my lifetime of Harris and Walz have a history of embracing well-known antisemites, awarding tax dollars to terror sympathizers, and completely abandoning Israel.\n\nThey are the pro-Hamas ticket. https://t.co/Uzq0qpGQpe",
          "date": "2024-09-05T21:05:36.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was an honor to join @realDonaldTrump, Dr. Miriam Adelson and so many Jewish leaders tonight to mark the anniversary of the horrific Oct. 7th attack on Israel by Iran-backed Hamas. \n\nTerrorism will never win. We will never forget October 7th and we will never stop fighting to https://t.co/dBXKOTyghG",
          "date": "2024-10-08T00:05:23.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Gov Website",
          "url": "Rick Scott Senate.Gov",
          "tweet": null,
          "date": "2025-04-27 23:55:34",
          "scraped_on": "2025-04-27 23:55:34"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Some may be upset with President Trump for saying Kamala hates Israel, but it’s the truth - and the truth is upsetting.\n\nShe refused to attend PM Netanyahu’s address to Congress and she refused to pick a Jewish governor as her running mate, all to appease her pro-terrorist base.",
          "date": "2024-09-11T02:25:25.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Debbie — you are a coward.\n\nYou supported the Iran deal that freed up the money for this attack.\n\nYou’ve stayed silent as your party embraced their pro-hamas base.\n\nYou’ve sat back as Jewish students are terrorized on their college campuses.\n\nFloridians are tired of your lies. https://t.co/S0h7EpA0EU",
          "date": "2024-10-01T20:48:03.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Estados Unidos puede y DEBE responsabilizar a Irán por sus ataques a Israel.\n\nMás en @tampafreepress👇 https://t.co/8Uvj7afLR1",
          "date": "2024-10-02T19:56:29.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@JoeBiden and @KamalaHarris threatened Netanyahu and withheld weapons to stop him from going into Rafah. The bodies of Hersh and the 5 other hostages murdered by Hamas were recovered in tunnels under Rafah. If Biden would not have impeded Israel’s advance, these innocent people",
          "date": "2024-09-01T14:16:33.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@CoriBush now that Missouri fired you, please don’t move to Florida. I hear Minnesota is more welcoming to antisemitic socialists like you. (cc. @IlhanMN)\n\nGreat work by @AIPAC on kicking this Hamas sympathizer out of Congress.👏 https://t.co/YhUnw7riNa",
          "date": "2024-08-07T14:26:07.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump is going to win BIG in November! He has done so much for Israel and our Jewish community, unlike Joe Biden! https://t.co/0mzSYl0u1h",
          "date": "2024-05-16T20:09:55.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@KamalaHarris and her minion @DebbieforFL STILL haven’t denounced Saturday’s horrific terrorist attack that killed innocent CHILDREN in Israel.\n\nTheir silence and pandering to their Hamas-inspired base speaks volumes.",
          "date": "2024-07-29T20:02:11.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Joe Biden has now joined the pro-Hamas wing of the Democrat party.\n\nPresident Trump was the most pro-Israel president in American history, and we need him back in the White House. https://t.co/hgz3UIhAlo",
          "date": "2024-05-15T16:37:46.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Debbie todavía no ha encontrado el tiempo para denunciar los disturbios pro-Hamas de la semana pasada NI el horrible ataque terrorista del sábado contra Israel que mató a niños inocentes, pero sí encontró el tiempo para hacer este meme vergonzoso burlándose de mí por denunciar su",
          "date": "2024-07-30T17:49:36.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @TrumpWarRoom: Senator @SenRickScott SCORCHES Biden's political move to abandon Israel to appease pro-Hamas leftists: Biden is now a par…",
          "date": "2024-05-12T14:01:45.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Radical Democrats are choosing to support Hamas terrorists over Israel due to pressure from their antisemitic base. @DebbieforFL owes it to Floridians to say if she agrees with her top surrogate @DWStweets in abandoning our ally Israel. https://t.co/ynJueguhFU",
          "date": "2024-05-17T17:03:21.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden and Debbie’s top surrogate weighs in. \n\nThe radical Democrats are willing to abandon Israel and support Hamas’s efforts to murder Israeli civilians so they can appease their terrorist sympathizing base. https://t.co/an3IFXj3aC",
          "date": "2024-05-09T01:27:28.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        }
      ]
    },
    {
      "issue": "Limits on Prescription Drug Prices",
      "stance": true,
      "desc": "Senator Rick Scott has been a vocal advocate for lowering prescription drug prices, supporting legislation like the Lowering Drug Costs for American Families Act, which aims to expand the Inflation Reduction Act's drug price negotiation program to all Americans. He also seeks to increase the annual number of prescription drugs selected for negotiation.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Senator Rick Scott has been a tireless advocate for seniors, fighting to lower prescription drug prices and protect essential programs like Social Security and Medicare.” -Magaly García, a Cuban-American senior\nhttps://t.co/unbAjITOdc",
          "date": "2024-08-25T14:39:42.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Gov Website",
          "url": "Rick Scott Senate.Gov",
          "tweet": null,
          "date": "2025-04-27 23:55:34",
          "scraped_on": "2025-04-27 23:55:34"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Harris Price Hikes &amp; #Bidenomics have made everything more expensive &amp; families are struggling to make ends meet.\n\nI’m fighting to provide relief for families with up to $10,000 of federal tax deductions on the cost of homeowners insurance premiums. https://t.co/Zn1zaPtHNd",
          "date": "2024-08-09T15:51:12.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Other",
          "url": "https://states.aarp.org/florida/scott-mucarsel-powell-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 14:10:58"
        }
      ]
    },
    {
      "issue": "Terrorism",
      "stance": false,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Gov Website",
          "url": "Rick Scott Senate.Gov",
          "tweet": null,
          "date": "2025-04-27 23:55:34",
          "scraped_on": "2025-04-27 23:55:34"
        }
      ]
    },
    {
      "issue": "Abortion",
      "stance": true,
      "desc": "Rick Scott's stance on abortion is not explicitly stated in the provided data. However, as a Republican senator, he has generally been associated with anti-abortion views and has supported legislation that restricts access to abortion. He has also signed the Born-Alive Survivors Protection Act, which prohibits an abortion if a fetus shows signs of life after an attempt to terminate the pregnancy.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Socialist Debbie just said that preventing illegals from voting is “voter suppression.”\n \nShe is literally advocating for the 10 million+ illegals Biden/Harris let in to have voting rights.\n \nDebbie Mucarsel-Powell is a SOCIALIST. https://t.co/L8Pkn90Li8",
          "date": "2024-09-12T19:17:08.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My message to American colleges and universities is simple: protect the safety and well-being of Jewish students or lose your federal funding. https://t.co/aV4mAE8ECo",
          "date": "2024-05-23T20:34:33.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden &amp; Harris broke our economy &amp; sent prices through the roof.\n\nNow Kamala Harris, who has ZERO experience in building businesses, is proposing federal price controls.\n\nI have some news for her – the reason everything is so expensive is not because of “price gouging,” it’s",
          "date": "2024-08-16T14:04:26.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @TrumpWarRoom: Senator @ScottforFlorida: \"We're going to win... Trump's going to win the White House. In my state, there is NO energy fo…",
          "date": "2024-09-04T13:31:25.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @AndrewPollackFL: My daughter was killed in the Parkland school shooting. It’s absolutely abhorrent that Tim Walz has befriended school…",
          "date": "2024-10-02T02:32:48.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was a great to roll out our “Venezuelans for Rick Scott” coalition in Miami this afternoon! The community of Venezuelan freedom fighters in Florida is unwavering in the fight to keep socialism out of our country, and I’m honored to fight with them. https://t.co/wMgRjPOPh3",
          "date": "2024-07-02T20:09:03.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Honored to receive the overwhelming support from hundreds of veterans from across our state these past few weeks!\n\nEvery veteran chose to give up the comforts of civilian life to defend our nation and keep us safe, and as a fellow vet I will always have their backs in the senate! https://t.co/OL7C6fBCtk",
          "date": "2024-08-31T19:15:16.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "This election comes down to a simple choice: freedom or socialism.\n\nMy opponent spent her one term in Congress supporting socialist ideas like AOC’s Green New Steal and Biden’s Inflation Expansion Act.\n\nVoters rejected her once already, and will again this Nov. https://t.co/nOlbZcmVce",
          "date": "2024-08-21T17:36:36.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden’s rewrite of Title IX is an attack on women and puts every female athlete in danger.\n\nWe’re not standing for it in Florida.\n\nI applaud @AshleyMoodyFL for defending fairness, equality, and safety for Florida women and girls. https://t.co/aLjlpf0CvM",
          "date": "2024-08-02T21:00:30.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Gov Website",
          "url": "Rick Scott Senate.Gov",
          "tweet": null,
          "date": "2025-04-27 23:55:34",
          "scraped_on": "2025-04-27 23:55:34"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In 4 days, we will vote for safer communities✅\n\nIn 4 days, we will vote for a secure border✅\n\nIn 4 days, we will vote to reject socialism and extremism✅\n\nIn 4 days, we will vote to MAKE AMERICA GREAT AGAIN!🇺🇸",
          "date": "2024-11-01T16:11:58.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @realannapaulina: . @SenRickScott is the leader we need in Senate. America needs someone that will fight for us… not sell us out to DC s…",
          "date": "2024-05-24T18:10:17.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden’s State Dept. announced the removal of Cuba from list of countries that don’t fully cooperate against terrorism.\n\nThis is an INSULT to everyone fighting for freedom in Cuba.\n\nFloridians deserve to know if Biden’s hand-picked senate candidate, @DebbieForFL, supports this",
          "date": "2024-05-16T19:42:25.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "ICYMI: My campaign launched our latest ad highlighting my commitment to always protect IVF.\n\nTake a look👇https://t.co/rtphjbiuaX",
          "date": "2024-06-07T15:19:32.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It was an honor to join @IVACMiami yesterday to commemorate their 20th anniversary!\n\nWe have an amazing Venezuelan community in FL. Thank you for your commitment to the fight for freedom, and for helping to ensure that socialism does not take root in the United States! https://t.co/kjjFvGogW2",
          "date": "2024-09-22T23:45:06.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My story is that of the American dream. In Washington, I’m fighting every day to keep that dream alive.\n\nThat’s why I’m running for re-election and why I’m running for Senate Republican Leader. https://t.co/ykkKVFzcqd",
          "date": "2024-06-14T22:06:33.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "As the next Senate Republican Leader, I will fight like hell to turn this country around.\n\nMore from my interview with @MariaBartiromo👇https://t.co/tphTCGgYB3",
          "date": "2024-05-29T18:44:38.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Socialism in Florida has a name – it’s Debbie Mucarsel-Powell.\n\nMy new Spanish campaign ad reminds voters exactly who Socialist Debbie is.\n\nFloridians won’t forget - when she was about to lose her re-election in 2020, Debbie unsuccessfully tried to censor Hispanic media stations https://t.co/wsruoxI3vB",
          "date": "2024-10-14T19:52:36.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Honored to be with so many Florida veterans here in Naples this morning!\n\nOur vets sacrificed so much to keep our country safe and free, and we’re committed to defeating socialism again in November! https://t.co/U4OJhBP99L",
          "date": "2024-08-22T18:23:46.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @Floridianpress: .@SenRickScott labels Democratic Senate opponent @DebbieforFL as \"Socialist Debbie\"\n\n\"Socialist Debbie doesn’t say anyt…",
          "date": "2024-07-03T13:53:30.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I refuse to let any Democrat try to lie about my stance on IVF &amp; contraceptives in their desperate attempt to try to win an election.\n\nIVF has brought beautiful babies to so many families, and for my family, it’s personal.\n\nI will always protect IVF. https://t.co/VjaYlXQtpO",
          "date": "2024-06-05T17:29:22.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“Senator Scott will always be an advocate for freedom and fight back against any attempts to impose Democrats’ socialist policies on Floridians” @commishbermudez\n\n“Floridians in Palm Beach County are better off thanks to Senator Rick Scott’s leadership” Comm. Michael Barnett",
          "date": "2024-06-28T17:36:21.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "No surprise @DebbieforFL would endorse Biden’s border czar for President. \n\nDebbie is fighting to bring California socialism to Florida. https://t.co/hWgxY4BQJR",
          "date": "2024-07-21T19:25:37.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Harris/Walz is the most radical ticket in U.S. history.\n\nThe Green New Deal, open borders, defunding the police, men in women’s sports, destroying the middle class. The list goes on and on.\n\nThey are hellbent on bringing California socialism to every state, and we’re ready to",
          "date": "2024-08-06T13:38:58.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "ICYMI: I was honored to roll out my “Venezuelans for Rick Scott” coalition in Miami with the support of Venezuelan business &amp; community leaders who have contributed so much to our state.\n\nUnlike Biden &amp; my socialist opponent, I will always stand with the people of Venezuela.",
          "date": "2024-07-05T15:12:12.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Each of my 7 grandkids is a precious gift from God. But sometimes families need help.\n\nYou can count on this grandpa to always protect IVF. \n\nWatch my latest campaign ad👇 https://t.co/UEf5ByrFeo",
          "date": "2024-06-14T13:30:21.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Tonight my #IVF ad will be running throughout the #PresidentialDebate.\n\nI will always fight to protect access to IVF. For me, it’s personal.\nhttps://t.co/UEf5Bysd3W",
          "date": "2024-06-27T22:21:21.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @DianaLTaub: I voted ⁦@ScottforFlorida⁩ today! In Jax he said https://t.co/LEWxx8L4ww &amp; Vote No on 3! He will protect my SS/Medicare $ i…",
          "date": "2024-08-20T19:58:54.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "IVF is a personal issue for many Florida families, including my own. I will always protect IVF. https://t.co/K1sSDcxAYA",
          "date": "2024-06-08T17:25:47.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I disagree. This is a perfect example of why we need a real conservative leader in the Senate. I’m running to be leader because every senator needs to be on the record on whether illegals vote.\n\nMy Dem opponent @DebbieforFL has refused to answer whether she supports my SAVE Act https://t.co/JUujXSVhAR",
          "date": "2024-08-26T15:10:50.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Debbie Powell denies the fact that she embraced socialism during her time in Congress, but her support of the Harris/Walz ticket only confirms what I’ve said since day one of her candidacy – she is a socialist through and through.\n\nFloridians recognize a socialist when they see",
          "date": "2024-08-06T18:23:35.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida sigue siendo el estado número uno del país para las personas de la tercera edad.\n\nComo Senador, estoy trabajando para aprobar mi Ley de Protección de las Personas de la tercera edad para preservar Medicare y la Seguridad Social y proteger a las personas mayores del caos",
          "date": "2024-09-07T16:08:42.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        }
      ]
    },
    {
      "issue": "Border Patrol",
      "stance": true,
      "desc": "Senator Rick Scott advocates for securing the US-Mexico border through enforcement of existing laws. He supports banning sanctuary cities and has expressed support from law enforcement and business groups, highlighting his commitment to addressing border security concerns.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @TomCottonAR: Great to be with @ScottForFlorida and @marcorubio --Florida, get out and vote for secure borders and lower inflation!",
          "date": "2024-10-22T14:12:51.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s been nearly 4 years since we’ve had a president who actually enforced our border security laws.\n\nThat will end on Jan 20, 2025.\n\nPresident @realDonaldTrump will put an end to the Biden/Harris border crisis on day one. https://t.co/DjO9D0iOkC",
          "date": "2024-08-24T13:45:54.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "A huge congratulations to @VoteAPL on your primary win! Looking forward to continuing to fight for Floridians alongside you! https://t.co/gIjEjFVyCu",
          "date": "2024-08-21T00:17:21.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Incredible group of job creators at the Boca Chamber of Commerce luncheon today! Thank you for all you do to grow jobs in FL! \n\nI’m fighting every day in Washington to get government out of the way so businesses can thrive. https://t.co/AmKS6NTj6K",
          "date": "2024-07-02T19:08:47.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "In 4 days, we will vote for safer communities✅\n\nIn 4 days, we will vote for a secure border✅\n\nIn 4 days, we will vote to reject socialism and extremism✅\n\nIn 4 days, we will vote to MAKE AMERICA GREAT AGAIN!🇺🇸",
          "date": "2024-11-01T16:11:58.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Rep. @DeanBlackFL: Rick Scott knows and understands small business, and he is just the man to tackle the problems facing small business owners. https://t.co/Gs6io7H2EO",
          "date": "2024-06-13T20:56:18.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Wakulla Sheriff Jared Miller is a great friend and has dedicated his life to keeping Floridians safe, and I’m excited to announce my endorsement for his re-election! I know that he will never stop fighting to protect families in Wakulla County! https://t.co/PK3MF0YjgX",
          "date": "2024-07-19T13:45:11.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Kamala Harris said she would close immigration detention centers “on day one” as president.\n\nOn day one President Trump will SECURE our border &amp; enforce our laws.\n\nVoters have a clear choice – more chaos &amp; lawlessness or secure communities &amp; safer streets.https://t.co/2FjwICnlVB",
          "date": "2024-08-15T20:12:05.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump has the plan to MAKE AMERICA GREAT AGAIN!\n\n✅Seal the border\n✅End taxes on tips\n✅Stop the inflation crisis\n✅Restore energy independence\n✅Protect Social Security &amp; Medicare\n\nIf you agree, join me in supporting @realDonaldTrump TODAY👇https://t.co/UsKkPVtLTe",
          "date": "2024-09-10T15:13:27.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“As a former small business owner, Senator Rick Scott has always had our back! Every time we have an issue in Washington, we know we can call Senator Scott who will answer our call and advocate for us!” -Walter Carpenter, @NFIB Leadership Council Chairman https://t.co/dZ3lENEREo",
          "date": "2024-05-26T19:25:43.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“When a Hurricane was supposed to hit Tampa, Sen. Scott was the first one here.\n\nAs Sheriff of one of the biggest counties in Florida, I support Senator Rick Scott.” -@ChadChronister https://t.co/vpuEJk6c4u",
          "date": "2024-10-02T17:37:22.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I agree with President Trump.\n\nIt’s time we ban sanctuary cities. https://t.co/tqqeiD6DXx",
          "date": "2024-09-24T20:33:13.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/rick-scott-speaks-at-rnc-2024-night-two",
          "tweet": null,
          "date": "July 16, 2024",
          "scraped_on": "2025-04-15 14:10:06"
        }
      ]
    },
    {
      "issue": "Election Integrity",
      "stance": true,
      "desc": "Description: Rick Scott has expressed strong support for Election Integrity, advocating for measures such as proof-of-citizenship requirements and voter ID laws to ensure only eligible American citizens can vote. He believes these safeguards are essential to protecting the integrity of the electoral system and upholding democracy. His policies aim to prevent election interference and promote fairness in the voting process.",
      "sources": [
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/republican-press-conference-on-voting-security",
          "tweet": null,
          "date": "September 11, 2024",
          "scraped_on": "2025-04-15 14:10:46"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My SAVE Act would protect our elections by ensuring only American citizens can vote.\n\nIt’s simple, commonsense, and overwhelmingly supported by Americans.\n\nBut radical Dems like my opponent, Socialist Debbie, would rather see the government shutdown than pass this bill. https://t.co/91E0QFz5Re",
          "date": "2024-09-14T19:26:34.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m honored to have more than 250 veterans from across Florida supporting my re-election! I will never stop fighting to make Florida the most military and veteran-friendly state in the country. https://t.co/N2RpTXTkxx",
          "date": "2024-07-30T14:49:02.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Great night at the @MiamiDadeGOP Lincoln Day dinner! Grateful for their hard work to support Republicans up and down the ballot! 🇺🇸🐘 https://t.co/s1A72Nt0cN",
          "date": "2024-07-21T13:51:00.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Sign up as a poll watcher today and help us protect the vote, stop election interference, and send President Trump back to the White House! https://t.co/6b8xrowK1H",
          "date": "2024-10-03T22:58:44.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "🚨Tomorrow is the LAST DAY you can register to vote for the Nov 5th election!\n\nLet’s expand our GOP registration majority and Keep Florida RED! ➡️https://t.co/tr7E4tCuh8 https://t.co/lTwyGZUsMK",
          "date": "2024-10-06T16:11:21.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        }
      ]
    },
    {
      "issue": "Balancing the Budget",
      "stance": true,
      "desc": "Rick Scott advocates for balancing the budget, citing his experience as Governor of Florida where he successfully balanced the state's budget every year. He supports cutting wasteful spending and operating within means to ensure fiscal responsibility. As a Senator, Scott aims to \"get government spending under control\" and pay down the national debt, while also bolstering Social Security payments to protect seniors from inflation.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @FLVoiceNews: WATCH: @SenRickScott is running for Mitch McConnell's Senate Republican Leader position to finally balance the budget\n\n\"Ou…",
          "date": "2024-09-04T14:13:34.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/republican-press-conference-on-voting-security",
          "tweet": null,
          "date": "September 11, 2024",
          "scraped_on": "2025-04-15 14:10:46"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "When I became Governor of Florida, I balanced the budget, cut wasteful spending, and we operated within our means.\n\nWe can do the same thing in Washington – and I’ll get it done as the next Senate Republican Leader. https://t.co/KvnyTiIMyu",
          "date": "2024-08-14T17:28:09.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Other",
          "url": "https://states.aarp.org/florida/scott-mucarsel-powell-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 14:10:58"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "It’s time we get our fiscal house in order in Washington.\n\nAs Governor, I balanced our budget every year.\n\nAs the next Senate Majority Leader, I will work to force our federal government to live within its means so American families can thrive. https://t.co/FBvPI4dxWX",
          "date": "2024-10-18T18:14:33.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Dan Franzese is a successful businessman who knows how important it is to create jobs and balance a budget, and Floridians would benefit from having him represent them in Washington.\n\nProud to endorse @danforfl! https://t.co/BFcLhWisar",
          "date": "2024-09-24T13:46:27.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        }
      ]
    },
    {
      "issue": "Gun Ownership",
      "stance": false,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "“We don’t need Debbie Mucarsel-Powell in Congress, we don’t need another squad wannabe, and we don’t need her socialist ideas”. -@CarlosGimenezFL\n\nThank you Carlos for being the Representative for Miami-Dade that Socialist Debbie could NEVER be. https://t.co/JLA9cU7bUE",
          "date": "2024-10-16T19:41:33.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @Floridianpress: .@SenRickScott labels Democratic Senate opponent @DebbieforFL as \"Socialist Debbie\"\n\n\"Socialist Debbie doesn’t say anyt…",
          "date": "2024-07-03T13:53:30.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Socialist Debbie has no place in Congress. https://t.co/fIwtEWuVX9",
          "date": "2024-07-03T20:40:24.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/republican-press-conference-on-voting-security",
          "tweet": null,
          "date": "September 11, 2024",
          "scraped_on": "2025-04-15 14:10:46"
        }
      ]
    },
    {
      "issue": "Public Healthcare",
      "stance": true,
      "desc": "Rick Scott's stance on public healthcare can be described as follows:\n\nAs a Senator, Rick Scott supports protecting vital programs like Social Security and Medicare from going insolvent. He advocates for preserving these programs to ensure that seniors have access to critical health coverage. Scott also proposes expanding Medicaid services and improving access to care under Medicare Advantage. Additionally, he introduces the Protect Our Seniors Act to safeguard vital programs against Washington's reckless spending.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’ve been able to live the American dream, and I won’t stop fighting so that dream remains possible for our kids and grandkids. Thank you for your kind words and support, Commissioner @KMCabreraFL! https://t.co/APLuPCQtYy",
          "date": "2024-06-21T17:07:42.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/republican-press-conference-on-voting-security",
          "tweet": null,
          "date": "September 11, 2024",
          "scraped_on": "2025-04-15 14:10:46"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "My SAVE Act would protect our elections by ensuring only American citizens can vote.\n\nIt’s simple, commonsense, and overwhelmingly supported by Americans.\n\nBut radical Dems like my opponent, Socialist Debbie, would rather see the government shutdown than pass this bill. https://t.co/91E0QFz5Re",
          "date": "2024-09-14T19:26:34.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Florida remains the #1 state in the nation for seniors.\n\nAs Senator, I’m working to pass my Protect our Seniors Act to preserve Medicare and Social Security and protect seniors from Biden/Harris’ financial chaos. https://t.co/HGkeYAcJej",
          "date": "2024-09-07T16:08:42.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Great morning visiting 21st Amendment Distillery in Vero Beach! I will always do everything I can to support Florida’s incredible veterans and veteran-owned businesses like 21st Amendment Distillery! https://t.co/Y8JY3kgG9v",
          "date": "2024-07-02T14:02:33.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Housing prices have surged 47% since Joe Biden took office.\n\nHis economic failures are literally killing the American dream for millions. https://t.co/cCD9ptGQek",
          "date": "2024-05-24T22:50:23.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Other",
          "url": "https://states.aarp.org/florida/scott-mucarsel-powell-senate-2024-q-and-a",
          "tweet": null,
          "date": "October 1, 2024",
          "scraped_on": "2025-04-15 14:10:58"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m so grateful to the Florida veterans who joined me this week to officially kick off my “Veterans for Scott” coalition!\n\nIt’s been my honor to fight for my fellow veterans as Florida’s Governor &amp; now as Senator, &amp; I’ll continue fighting to deliver as the next Senate GOP Leader. https://t.co/jQbiqiLI6R",
          "date": "2024-07-24T22:32:26.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Car prices under Biden/Harris are up $10k, while the cost to maintain your car is up $300/month.\n\nMoney that working families could otherwise be spending on groceries or school supplies is instead being spent just to maintain what they already have.\n\nTHAT’S #Bidenomics. https://t.co/Jw5TxTMkfs",
          "date": "2024-08-08T16:14:13.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I’m proud to endorse @darielfernandez for Miami-Dade Tax Collector!\n\nDariel genuinely cares about the community, and I’m confident he’ll bring the leadership, efficiency, and transparency needed as Tax Collector! https://t.co/q1HzCbgMlM",
          "date": "2024-08-19T23:47:38.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Great to start the morning with @abcflgulf! I will always fight to make sure Florida’s incredible builders and contractors have what they need to succeed and continue creating jobs! https://t.co/VK23q3NKzm",
          "date": "2024-07-26T20:39:07.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump has the plan to MAKE AMERICA GREAT AGAIN!\n\n✅Seal the border\n✅End taxes on tips\n✅Stop the inflation crisis\n✅Restore energy independence\n✅Protect Social Security &amp; Medicare\n\nIf you agree, join me in supporting @realDonaldTrump TODAY👇https://t.co/UsKkPVtLTe",
          "date": "2024-09-10T15:13:27.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": ".@JDVance is right - we must prioritize school safety across America, just like we did in Florida. As Governor, I worked hard to make sure every student had a school resource officer to keep them safe at school.\n\nIt’s time we do this nationwide and pass my School Guardian Act, https://t.co/ly2lv8gwDL",
          "date": "2024-10-02T02:30:41.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I enjoyed getting to spend some time with Florida seniors in Miami Springs this afternoon! As Florida’s Senator and member of the Senate Aging Committee, I will always fight to protect our seniors in Washington! https://t.co/v8HGVFguPd",
          "date": "2024-09-20T18:30:27.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        }
      ]
    },
    {
      "issue": "China",
      "stance": false,
      "desc": "Rick Scott has expressed strong opposition to China, viewing it as a threat to American interests and way of life. He accuses the country of lying, stealing, and attempting to infiltrate US government, and has criticized policies such as price controls and socialism for being supported by his opponents, including Kamala Harris and Joe Biden. Scott has also called out Joe Biden's debate performance, stating it emboldened adversaries like China and Cuba, and emphasized the need for a hardline stance against China and other enemies of the US.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Biden’s Cuba appeasement will fuel terror in the Western Hemisphere, and the Schumer/Biden handpicked FL Dem Senate candidate @DebbieforFL supports his continued weakness.\n\nI’m fighting to stop it. Read my full op-ed in the @MiamiHerald👇 https://t.co/SZSOhRxofC",
          "date": "2024-05-24T20:19:08.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Communist China is actively trying to destroy our way of life and they are doing it by lying, stealing, and trying to infiltrate our government.\n\nInstead of standing up to Communist China, Harris picked Walz as her running mate - a man whose ties to China are more than red flags. https://t.co/MZq7fDA4Dk",
          "date": "2024-09-03T16:51:47.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "President Trump will always fight for American workers, and as the next Senate GOP Leader I will continue to lead the fight alongside him🇺🇸 https://t.co/U2CbdgBh0v",
          "date": "2024-09-03T18:29:21.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Our adversaries like China and Cuba saw Joe Biden’s debate performance and have been emboldened. Our national security depends on getting a strong leader like President Trump back in the White House. https://t.co/3uOZL0BR6f",
          "date": "2024-07-02T22:00:30.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Make no mistake – every time Biden appeases the illegitimate communist Cuban regime, he supports terrorism and actively aids America’s enemies in Russia, Iran, and Communist China. Actions that @DebbieforFL fully supports. Now, this weakness has allowed Russian warships 90 miles",
          "date": "2024-06-07T19:17:40.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Every time you buy a product made in Communist China you are supporting a government that is trying to destroy our way of life.\n\nIf we want to protect American jobs, end our reliance on countries like Communist China and stop supporting evil regimes that hate us, we need to use https://t.co/KvTmWygoV3",
          "date": "2024-07-02T18:20:47.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @BreitbartNews: Exclusive — @SenRickScott: Kamala Harris’s Price Controls Are \"Socialism\" https://t.co/BDxdgsOLXk",
          "date": "2024-08-19T23:14:06.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Hispanic families want what all families want: safe communities, good-paying jobs, and a strong education for their kids. That is exactly what Trump is fighting for, and Florida Republicans have led the way!\nhttps://t.co/XzGknNRGME",
          "date": "2024-06-10T23:46:43.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Other",
          "url": "https://www.rev.com/transcripts/rick-scott-speaks-at-rnc-2024-night-two",
          "tweet": null,
          "date": "July 16, 2024",
          "scraped_on": "2025-04-15 14:10:06"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Yesterday, I was honored to be in Chicago to support President @realDonaldTrump and to contrast the prosperity and success we saw under his administration with Kamala’s socialism. https://t.co/8gHqr6KmAB",
          "date": "2024-08-20T13:30:04.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "What’s happening in Venezuela should be a warning: this is where socialism leads - absolute destruction and oppression.\n\nThe United States will NOT put a California socialist in the White House.",
          "date": "2024-07-31T16:12:17.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Harris/Walz is the most radical ticket in U.S. history.\n\nThe Green New Deal, open borders, defunding the police, men in women’s sports, destroying the middle class. The list goes on and on.\n\nThey are hellbent on bringing California socialism to every state, and we’re ready to",
          "date": "2024-08-06T13:38:58.000Z",
          "scraped_on": "2025-03-28 23:31:13"
        }
      ]
    }
  ]
}