{
  "candidate": "Shawn Harris",
  "positions": [
    {
      "issue": "Election Integrity",
      "stance": true,
      "desc": "Insufficient Data.",
      "sources": [
        {
          "type": "Tweet",
          "url": null,
          "tweet": "MTG is afraid to debate me because she sees our momentum.\n\nAs we're getting closer to filing the final FEC report, it's crucial that we keep up our momentum.\n\nPls retweet and consider matching our avg. donation of $28.49 or chip in any amount to fire MTG.https://t.co/xxy5BGTV2M",
          "date": "2024-09-24T03:14:05.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "WATCH:\n\nDon Westlake is a lifelong Republican, and I'm honored to have his support. We don't agree on everything, but we share a mutual love for agriculture.\n\nPeople like Don are why we're going to beat MTG. Listen to him why he's crossing party lines to support me over MTG. https://t.co/5MFtsFISkr",
          "date": "2024-06-21T23:54:30.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I'm Shawn Harris, a retired Brigadier General, and I'm a Democrat running against Marjorie Taylor Greene.\n\nI served in the military for 40 years, fighting for our nation and its democracy.\n\nI'm now stepping up to fight for our democracy once again by getting rid of MTG. https://t.co/WZwMRjcWzB",
          "date": "2024-05-19T03:55:42.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Unlike MTG, my priority will be the people of North Georgia, not headlines.\n\nUnlike MTG, I'm going to work together, not against my colleagues.\n\nUnlike MTG, I won't insult people or other groups every other day.\n\nUnlike MTG, I'll honor our flag and fight to defend our democracy.",
          "date": "2024-05-26T23:17:27.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "MTG IS LOSING MOMENTUM!\n\nIt's crucial that we keep up our momentum as we approach the final FEC deadline at the end of the month.\n\nCan you retweet and chip in $7, $14, $24, 50, or whatever you can afford right now to flip GA14 and end MTG's toxic career?https://t.co/nwUCLU30a9",
          "date": "2024-09-18T03:55:01.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Marjorie Taylor Greene and I both took an oath to defend the Constitution. She violated it and called on people to attack our democracy on Jan. 6.\n\nIt's now my patriotic duty to remove her from Congress.\n\nCan you retweet and chip in $24 to send MTG packing?https://t.co/dygGFX9BHQ",
          "date": "2024-08-19T03:32:31.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "RT @ShawnForGeorgia: MTG IS LOSING MOMENTUM!\n\nIt's crucial that we keep up our momentum as we approach the final FEC deadline at the end of…",
          "date": "2024-09-20T22:55:08.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "🚨No amount is too small to help end MTG's career.\n\nThere's a few hours left until our final FEC deadline, and in order to be able to keep up our momentum, we must meet our fundraising goals.\n\nCan you kindly retweet and chip in ANY AMOUNT before 11:59pm?https://t.co/RzejOwZvTg",
          "date": "2024-10-01T01:31:18.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I retired as Brigadier General after serving 40 years fighting for our nation and its democracy.\n\nNow I'm stepping up, and I'm fighting for our democracy here at home by getting rid of MTG and her extreme agenda.\n\nCan you chip in $7 to end MTG's career?https://t.co/PErybiDNdI",
          "date": "2024-05-05T15:07:58.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I retired as a Brigadier General after fighting for our nation and its democracy for 40 years.\n\nI'm stepping up once again to fight for our democracy by running and defeating MTG.\n\nPls retweet and chip in $14 via the ActBlue link below to help me flip GA14.https://t.co/7XoP49sEjB",
          "date": "2024-07-22T03:15:53.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "🚨 24 HOURS LEFT!\n\nI'm counting on you to help me defend our democracy by unseating MTG.\n\nTomorrow night is the first FEC deadline since we won the Democratic nomination.\n\nCan you retweet and chip in whatever you can afford to end MTG's toxic career?https://t.co/BXHnmiuZB6",
          "date": "2024-06-30T03:58:28.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "I'm running against MTG because, unlike her, I know what it takes to actually serve our great country.\n\nIt's crucial that we keep up our momentum as we approach the final FEC deadline.\n\nCan you retweet and chip in $14 to flip GA14 and retire MTG?\nhttps://t.co/3G3bk6YiDH",
          "date": "2024-09-13T20:25:48.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "$34.98 is the average donation from people across the nation joining to support our fight to defend our democracy.\n\nThe first FEC report since winning the nomination is due in a few days, and we must show big momentum.\n\nCan you chip in even $1 to fire MTG?https://t.co/Ut2vh3FtgJ",
          "date": "2024-06-23T18:31:09.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "MTG loves conspiracies. As dangerous as they are, her radical fan club, watching her on Bannon and OANN, shower her with money.\n\nWe're 4 days away from the 1st FEC deadline since winning the Democratic nomination. We must show BIG numbers.\n\nCan you chip in?https://t.co/2oW6vVPhOU",
          "date": "2024-06-27T02:15:05.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "On Nov. 5th, I'm filing a motion to vacate Marjorie Taylor Greene from Congress, and the people of North Georgia are going to support it at the ballot box.",
          "date": "2024-05-07T00:16:29.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Marjorie Taylor Greene and I took the same oath, but we see our oaths differently.\n\nBy glorifying Jan 6 insurrectionists and Putin, MTG endangers our democracy at home and abroad.\n\nI served 40 years in the military, and it's my patriotic duty to save our democracy and unseat MTG.",
          "date": "2024-06-12T22:23:40.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Marjorie Taylor Greene is PANICKING because she sees our momentum.\n\nShe's spreading lies to set up a narrative that if she loses, she can claim the vote is rigged.\n\nCan you please retweet and chip in to defend our democracy by ending the MTG chaos?https://t.co/Rs6XxOQMsc",
          "date": "2024-10-23T17:14:33.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        },
        {
          "type": "Tweet",
          "url": null,
          "tweet": "Today, we're celebrating the land of the free and the home of the brave.\n\nAs we honor the spirit of America's founding, let's recognize the progress and commit to continuing to fight for our freedom and democracy.\n\nRed, white, and blue, and proud of it.\n\nHappy Independence Day!🇺🇸",
          "date": "2024-07-04T14:03:53.000Z",
          "scraped_on": "2025-04-02 00:47:50"
        }
      ]
    }
  ]
}